// Default Data Structure
// Default Data Structure (Preloaded with current active data)
const DEFAULT_DATA = {
    "teachers": [
        {
            "id": "t_1",
            "name": "นายธาตรี พิบูลมณฑา"
        },
        {
            "id": "t_2",
            "name": "นางสาวสายฝน สาระผล"
        },
        {
            "id": "t_3",
            "name": "นายสุวิชา มั่นยืน"
        },
        {
            "id": "t_4",
            "name": "นายไวพจน์ ศรีธัญ"
        },
        {
            "id": "t_5",
            "name": "นางราตรี สะดีวงศ์"
        },
        {
            "id": "t_6",
            "name": "นายกตนนท์ นาทัน"
        },
        {
            "id": "t_7",
            "name": "นายบัณฑิตย์ เหลาทอง"
        },
        {
            "id": "t_8",
            "name": "นายเอกพร วรรณประภา"
        },
        {
            "id": "t_9",
            "name": "นายจำรัส ชนะสิงห์"
        },
        {
            "id": "t_10",
            "name": "ว่าที่ ร.ต.ศตวัฒน์ มงคลดิษฐ์"
        },
        {
            "id": "t_11",
            "name": "นายณัฐพล เทพมา"
        },
        {
            "id": "t_12",
            "name": "นายอภิสิทธิ์ พรมดอน"
        },
        {
            "id": "t_13",
            "name": "นางกนกพร ไชยวิเศษ"
        },
        {
            "id": "t_14",
            "name": "นายปริวัฒน์ ยืนยิ่ง"
        },
        {
            "id": "t_15",
            "name": "นางเบญญาดา อ่อนน้อม"
        },
        {
            "id": "t_16",
            "name": "นายอุทัย พลเขตต์"
        },
        {
            "id": "t_17",
            "name": "นายอิทธิวัฒน์ ไทยแท้"
        },
        {
            "id": "t_18",
            "name": "นายสมัคร อินทร์เลิศ"
        },
        {
            "id": "t_19",
            "name": "นายเกียรติพล บุญหล่อ"
        },
        {
            "id": "t_20",
            "name": "นายภัทรศักดิ์ ภัทรธรรมพิบูล"
        },
        {
            "id": "t_21",
            "name": "นายสวัสดิ์ ธงไชย"
        },
        {
            "id": "t_22",
            "name": "นางมลีทอง จารุพงษ์"
        },
        {
            "id": "t_23",
            "name": "นางทิพากร ผุยพรม"
        },
        {
            "id": "t_24",
            "name": "นางสาวพิมพ์อธิชา จันทร์สุตะ"
        },
        {
            "id": "t_25",
            "name": "นางสุภัดสา ศิริชนะ"
        },
        {
            "id": "t_26",
            "name": "นายสรรพสิทธิ์ ละออเอี่ยม"
        },
        {
            "id": "t_27",
            "name": "นางสาวธิดารัตน์ บุญดล"
        },
        {
            "id": "t_28",
            "name": "นายศักดิ์สิทธิ์ จันทะแสง"
        },
        {
            "id": "t_29",
            "name": "นายวัฒนา ทองเทพ"
        },
        {
            "id": "t_30",
            "name": "นางพนิดา องค์สวัสดิ์"
        },
        {
            "id": "t_31",
            "name": "นายทรงศักดิ์ สันตนาโค"
        },
        {
            "id": "t_32",
            "name": "นายคารมย์ แก้วกันยา"
        },
        {
            "id": "t_33",
            "name": "นางสุภาพร ไชยชนะ"
        },
        {
            "id": "t_34",
            "name": "นายชนินทร์ พบลาภ"
        },
        {
            "id": "t_35",
            "name": "นางสาวชญานันทน์ หอมจิตร"
        },
        {
            "id": "t_36",
            "name": "ว่าที่ ร.ต.กรีฑาวุฒิ ทนงจิตร"
        },
        {
            "id": "t_37",
            "name": "นายอิทธิพล สุขเติม"
        },
        {
            "id": "t_38",
            "name": "นางทิพวรรณ สายพิณ"
        },
        {
            "id": "t_39",
            "name": "นายอาคม ปาสีโล"
        },
        {
            "id": "t_40",
            "name": "นายวันชัย นิยมวงศ์"
        },
        {
            "id": "t_41",
            "name": "นายธีรเดช ทิมา"
        },
        {
            "id": "t_42",
            "name": "นายนราวัฒน์ เขียวอ่อน"
        },
        {
            "id": "t_43",
            "name": "นายสถิระ กาญจันดา"
        },
        {
            "id": "t_44",
            "name": "นางมนัสนันท์ ไทยแท้"
        },
        {
            "id": "t_45",
            "name": "นางสาวปรานี ศรีมันตะ"
        },
        {
            "id": "t_46",
            "name": "นายณราวิตญ์ มีดี"
        },
        {
            "id": "t_47",
            "name": "นางสาวพิมพิไล วุ่นอภัย"
        },
        {
            "id": "t_48",
            "name": "นางดาราวรรณ รอดสิน"
        },
        {
            "id": "t_49",
            "name": "นายสุนันท์ อินทร์งาม"
        },
        {
            "id": "t_50",
            "name": "นายอนุชิต ศรีสมบูรณ์"
        },
        {
            "id": "t_51",
            "name": "ผู้ช่วยศาสตราจารย์ ดร.อาคม ปาสีโล"
        },
        {
            "id": "t_52",
            "name": "นายอภิสิทธิ์ โคนพันธ์"
        },
        {
            "id": "t_53",
            "name": "นายอินทรายุธ เชสูงเนิน"
        },
        {
            "id": "t_54",
            "name": "นายจตุรงค์ อ่อนสาร"
        },
        {
            "id": "t_55",
            "name": "นายวสันต์ สุดหา"
        },
        {
            "id": "t_56",
            "name": "สิบเอกเดชศรี พนมเขต"
        },
        {
            "id": "t_57",
            "name": "นายณัฐกร หมื่นทอง"
        },
        {
            "id": "t_58",
            "name": "นางสาวไพลิน แนวจำปา"
        },
        {
            "id": "t_59",
            "name": "นายพงศธร วงษ์ศรีแก้ว"
        },
        {
            "id": "t_60",
            "name": "นายนรา เดชะคำภู"
        },
        {
            "id": "t_61",
            "name": "นายถาวร สีถาการ"
        },
        {
            "id": "t_62",
            "name": "นายอนุชิต มุงคุณการ"
        },
        {
            "id": "t_63",
            "name": "นายสมบัติ แนวจำปา"
        },
        {
            "id": "t_64",
            "name": "นายวีระพล นันตะเสน"
        },
        {
            "id": "t_65",
            "name": "นายอิทธิพล บุดดีคำ"
        },
        {
            "id": "t_66",
            "name": "นายวีระพงศ์ รองทอง"
        },
        {
            "id": "t_67",
            "name": "นายฐิติกร ยืนยั่ง"
        },
        {
            "id": "t_68",
            "name": "นายพิศาล นันทะสาร"
        },
        {
            "id": "t_69",
            "name": "นายสานิต อัคชาติ"
        },
        {
            "id": "t_70",
            "name": "นายวีรสิทธ นาทัน"
        },
        {
            "id": "t_71",
            "name": "นายหลักชัย เล็กเมฆา"
        },
        {
            "id": "t_72",
            "name": "นายอิศรา เปลี่ยมไธสง"
        },
        {
            "id": "t_73",
            "name": "นายสถาพร แสวงแก้ว"
        },
        {
            "id": "t_74",
            "name": "นายภูวดล วันโมลา"
        },
        {
            "id": "t_75",
            "name": "นายไกรวิชญ์ เกตุนา"
        },
        {
            "id": "t_76",
            "name": "นายขวัญ ชิณวงษ์"
        },
        {
            "id": "t_77",
            "name": "นายอนุพันธ์ จารุพงษ์"
        },
        {
            "id": "t_78",
            "name": "นายชนะ สุทธิประภา"
        },
        {
            "id": "t_79",
            "name": "นายศักรินทร์ ไชยปัญญา"
        },
        {
            "id": "t_80",
            "name": "นายตฤณ แสนลา"
        },
        {
            "id": "t_81",
            "name": "นางกัลยาณี บุญสุข"
        },
        {
            "id": "t_82",
            "name": "นายพงค์ศักดิ์ สีลาคม"
        },
        {
            "id": "t_83",
            "name": "นายธีรวัฒน์ ศรีกะกุล"
        },
        {
            "id": "t_84",
            "name": "นายพิริยะ ข่ายกระโทก"
        },
        {
            "id": "t_85",
            "name": "นางสาวชุติกาญจน์ สุขเกษม"
        },
        {
            "id": "t_86",
            "name": "นางสาวจุฑารัตน์ แสงรูจี"
        },
        {
            "id": "t_87",
            "name": "นางสาวศิริยาพร สำเภา"
        },
        {
            "id": "t_88",
            "name": "นายอุกฤษฎ์ จันดาบุตร"
        },
        {
            "id": "t_89",
            "name": "นายนัฐพล แสงประดิษฐ์"
        },
        {
            "id": "t_90",
            "name": "นายธนกร บุตรศรี"
        },
        {
            "id": "t_91",
            "name": "นายวิทยา กองตระกูลดี"
        },
        {
            "id": "t_92",
            "name": "ว่าที่ ร.ต.ขวัญชัย เนืองเนตร"
        },
        {
            "id": "t_93",
            "name": "นายเกรียงไกร สายสุพรรณ์"
        },
        {
            "id": "t_94",
            "name": "นายศตวรรษ วารินทร์"
        },
        {
            "id": "t_95",
            "name": "นายคมสัน กล่ำพุฒธา"
        },
        {
            "id": "t_96",
            "name": "นายสุนทร ดอนชัย"
        },
        {
            "id": "t_97",
            "name": "นายปัญจพร พฤกษชาติ"
        },
        {
            "id": "t_98",
            "name": "นายยศสรัล แสงสาย"
        },
        {
            "id": "t_99",
            "name": "นายเจริญพร เจตอธิการ"
        },
        {
            "id": "t_100",
            "name": "นายอนุรักษ์ กลางแก้ว"
        },
        {
            "id": "t_101",
            "name": "นายสุกรี พรมนิกร"
        },
        {
            "id": "t_102",
            "name": "นางสาวแสงเดือน เพชรผดุง"
        },
        {
            "id": "t_103",
            "name": "นางสาวสุวรรณา โกศัลวัฒน์"
        },
        {
            "id": "t_104",
            "name": "นายสมลักษณ์ ศรีพนากุล"
        },
        {
            "id": "t_105",
            "name": "นายภาสกร ศรีขาว"
        },
        {
            "id": "t_106",
            "name": "นายเอกฉัตร พลรัตน์"
        },
        {
            "id": "t_107",
            "name": "นางสาวปิยะดา เดชประทุม"
        },
        {
            "id": "t_108",
            "name": "นายเศรษฐา วงศ์สวัสดิ์"
        },
        {
            "id": "t_109",
            "name": "นางสาวบุญญาพร วิลามาศ"
        },
        {
            "id": "t_110",
            "name": "นายศักดิ์ศิรินทร์ ชิณเกตุ"
        },
        {
            "id": "t_111",
            "name": "นายกฤษณะ เพชรไพร"
        },
        {
            "id": "t_112",
            "name": "นายพงศ์ดนัย รายน้ำเงิน"
        },
        {
            "id": "t_113",
            "name": "นายอนาวิล บุญศิริโชควัฒนา"
        },
        {
            "id": "t_114",
            "name": "นายบรรชัย นาคสุวรรณ"
        },
        {
            "id": "t_115",
            "name": "นายกฤษฎา อ่อนศรี"
        },
        {
            "id": "t_116",
            "name": "นายหิรัญทรัพย์ แสนทวีสุข"
        },
        {
            "id": "t_117",
            "name": "นางสาวนิภาพร พันลำ"
        },
        {
            "id": "t_118",
            "name": "นายเจษฎาภรณ์ ศรีหาพงษ์"
        },
        {
            "id": "t_119",
            "name": "นายอาทิตย์ พุฒพิม"
        },
        {
            "id": "t_120",
            "name": "นายก้องไกร สุทธิ"
        },
        {
            "id": "t_121",
            "name": "นายจิรโชติ ศรีวะโสภา"
        },
        {
            "id": "t_122",
            "name": "นางสาวภัทรสุดา ศรีวะโสภา"
        },
        {
            "id": "t_123",
            "name": "นายกุลพัทธ์ บุราณเดช"
        },
        {
            "id": "t_124",
            "name": "นายพีระพัฒน์ แสนพล"
        },
        {
            "id": "t_125",
            "name": "นางสาวสุกัญญา ถมมา"
        },
        {
            "id": "t_126",
            "name": "นายวิเชียร กำทอง"
        },
        {
            "id": "t_127",
            "name": "นายพรศักดิ์ บุญพา"
        },
        {
            "id": "t_128",
            "name": "นายชูเกียรติ ประมุขกุล"
        },
        {
            "id": "t_129",
            "name": "นางจุฬาพรรณ์ คณารักษ์"
        },
        {
            "id": "t_130",
            "name": "นายทรงศักดิ์ สัตนาโค"
        },
        {
            "id": "t_131",
            "name": "ว่าที่ ร.ต. คมกริช สายพิณ"
        },
        {
            "id": "t_132",
            "name": "นายวัฒนกร ไชยพล"
        },
        {
            "id": "t_133",
            "name": "นายภัทรพนธ์ ไชยคำภาวีราธัช"
        },
        {
            "id": "t_134",
            "name": "นายสุรชาติ วิชาชัย"
        },
        {
            "id": "t_135",
            "name": "นายสุรพงษ์ สามแก้ว"
        },
        {
            "id": "t_136",
            "name": "นางสาวประภาพรรณ กำทอง"
        },
        {
            "id": "t_137",
            "name": "นายชวินทร์ พลหาญ"
        },
        {
            "id": "t_138",
            "name": "ผู้ช่วยศาสตราจารย์ สวัสดิ์ ธงไชย"
        },
        {
            "id": "t_139",
            "name": "นายชวาล แข็งแรง"
        },
        {
            "id": "t_140",
            "name": "นายเทพลิขิต ศิริวงศ์"
        },
        {
            "id": "t_141",
            "name": "นางสุภาภรณ์ ไชยชนะ"
        },
        {
            "id": "t_142",
            "name": "นางเสาร์วันดี ผ่านเมือง"
        },
        {
            "id": "t_143",
            "name": "นายณภัทร พรกิตติกมล"
        },
        {
            "id": "t_144",
            "name": "นายฐาปกรณ์ บุภู่"
        },
        {
            "id": "t_145",
            "name": "นายมรุต นามบุญ"
        },
        {
            "id": "t_146",
            "name": "นายสุภภณ สวาสดิพันธ์"
        },
        {
            "id": "t_147",
            "name": "นายธนวัฒน์ พร้อมสุข"
        },
        {
            "id": "t_148",
            "name": "นายพงศ์ธร ปานรัตน์"
        },
        {
            "id": "t_149",
            "name": "นายธัชวัฒน์ ศรีพนากุล"
        },
        {
            "id": "t_150",
            "name": "นายบัญชา หาแก้ว"
        },
        {
            "id": "t_151",
            "name": "นายคณิตกร พรมหล่อ"
        },
        {
            "id": "t_152",
            "name": "นางสาวภุชฌาพร ชาจุหวัน"
        },
        {
            "id": "t_153",
            "name": "นางสาวกาญจนาวรรณ พรมสอน"
        },
        {
            "id": "t_154",
            "name": "นายสุรพงศ์ กันตะบุตร"
        },
        {
            "id": "t_155",
            "name": "นายอุทัย ไชยวิเศษ"
        },
        {
            "id": "t_156",
            "name": "นายภาวัช วรกฤษเรืองกุล"
        },
        {
            "id": "t_157",
            "name": "นางสาวภัททิรา ศรีนัครินทร์"
        },
        {
            "id": "t_158",
            "name": "นายกรกฎ บุญศิริโชควัฒนา"
        },
        {
            "id": "t_159",
            "name": "นายพีรคุปต์ ทิพยจันทร์"
        },
        {
            "id": "t_160",
            "name": "นางสาวจิญาศินี ศิริกิจ"
        },
        {
            "id": "t_161",
            "name": "นายสินวิชญ์ จารุตันติ์"
        },
        {
            "id": "t_162",
            "name": "นายดุลยวัต รักษ์พงศ์"
        },
        {
            "id": "t_163",
            "name": "นายปิยรัตน์ คันธจันทร์"
        },
        {
            "id": "t_164",
            "name": "นายณัฐวรรธน์ เกษกุล"
        },
        {
            "id": "t_165",
            "name": "นายอภิพงศ์ เจือสนิท"
        },
        {
            "id": "t_166",
            "name": "นางสาววิรุฬพรรณ บุญรมย์"
        },
        {
            "id": "t_167",
            "name": "นายเดชณรงค์ ดอกบัว"
        },
        {
            "id": "t_168",
            "name": "นางสาวจริญญา หล้าลุน"
        },
        {
            "id": "t_169",
            "name": "นายปัญญา บุญเล่ห์"
        },
        {
            "id": "t_170",
            "name": "นายศุภสิทธิ์ สายขุน"
        },
        {
            "id": "t_171",
            "name": "นางสาวประไพสุข เกษมสุข"
        },
        {
            "id": "t_172",
            "name": "นายปฏิภาณ ชมภูมาศ"
        },
        {
            "id": "t_173",
            "name": "นางสาวธันยาภักค์ ธนชัยผลฐานิส"
        },
        {
            "id": "t_174",
            "name": "นางสาวณภัสภรณ์ บุตรเงิน"
        },
        {
            "id": "t_175",
            "name": "นางกัลยกร อมรคำตัน"
        },
        {
            "id": "t_176",
            "name": "นางสาวณัฐธิดา ประดับจันทร์"
        },
        {
            "id": "t_177",
            "name": "นายสุพัฒน์ แนวจำปา"
        },
        {
            "id": "t_178",
            "name": "นายสมปอง เพิ่มพูล"
        },
        {
            "id": "t_179",
            "name": "นายกายสิทธิ์ นามลาด"
        },
        {
            "id": "t_180",
            "name": "นายธนาคาร กอมณี"
        },
        {
            "id": "t_181",
            "name": "นายวุฒินันท์ วงค์อินทร์"
        },
        {
            "id": "t_182",
            "name": "นางศิรินณา ดอนชัย"
        },
        {
            "id": "t_183",
            "name": "นางสาวทิพยดา สาระชาติ"
        },
        {
            "id": "t_184",
            "name": "นายอัครวินท์ พละศักดิ์"
        },
        {
            "id": "t_185",
            "name": "นางสาวรัญยารัตน์ สิงห์คำ"
        },
        {
            "id": "t_186",
            "name": "นางสาวดุษฎีพร ดวงศรี"
        },
        {
            "id": "t_187",
            "name": "นางจินตนา จินดาศรี"
        },
        {
            "id": "t_188",
            "name": "นายธนพัฒน์ ใจตรง"
        },
        {
            "id": "t_189",
            "name": "นางสรัญญา งานสัมพันธฤทธิ์"
        },
        {
            "id": "t_190",
            "name": "นางสาวนัทธ์ชนัน ช่องวารินทร์"
        },
        {
            "id": "t_191",
            "name": "นางมนันสนันท์ ไทยแท้"
        },
        {
            "id": "t_192",
            "name": "นางอรทัย ซาเสน"
        },
        {
            "id": "t_193",
            "name": "นายธานินทร์ สันตะวงษ์"
        },
        {
            "id": "t_194",
            "name": "นางสาวพิมพ์พัชชา แก้วมหาวงศ์"
        },
        {
            "id": "t_195",
            "name": "นายธนาธร กว้างขวาง"
        },
        {
            "id": "t_196",
            "name": "นางสาวรุ่งอรุณ ไตรวงษ์"
        },
        {
            "id": "t_197",
            "name": "นางขนิษฐา ดาโรจน์"
        },
        {
            "id": "t_198",
            "name": "นางณชิตา เถาว์โท"
        },
        {
            "id": "t_199",
            "name": "ว่าที่ ร.ต.หญิง ฐิตารีย์รัตน์ อาญาเมือง"
        },
        {
            "id": "t_200",
            "name": "นางสุพรรษา หิมะคุณ"
        },
        {
            "id": "t_201",
            "name": "นางสาวปวรวรรณ นามขุนทอง"
        },
        {
            "id": "t_202",
            "name": "นางสาวสกลสุภา สุนทร"
        },
        {
            "id": "t_203",
            "name": "นางขวัญฤทัย วรพิมพ์รัตน์"
        },
        {
            "id": "t_204",
            "name": "นางสาวธนพร บรรลือหาญ"
        },
        {
            "id": "t_205",
            "name": "นางสาวสุทธีรา มีชัย"
        },
        {
            "id": "t_206",
            "name": "นางปิยะนุช ส่องแสง"
        },
        {
            "id": "t_207",
            "name": "นางสาวสบันงา ไชยชนะ"
        },
        {
            "id": "t_208",
            "name": "นางสาวเยาวเรศ ทรายแดง"
        },
        {
            "id": "t_209",
            "name": "นางธัญชนก ชาติสง่า"
        },
        {
            "id": "t_210",
            "name": "นางยุภาพร ดวงแก้ว"
        },
        {
            "id": "t_211",
            "name": "นางสาวปิยธิดา สอนตะคุ"
        },
        {
            "id": "t_212",
            "name": "นางสาวพิมมาดา พลอินต๊ะ"
        },
        {
            "id": "t_213",
            "name": "นางสาวพิมพ์ลภัส หอมหวล"
        },
        {
            "id": "t_214",
            "name": "นางสาวจุไรรัตน์ อักโข"
        },
        {
            "id": "t_215",
            "name": "นางสาวปาริฉัตร เฟื่องฟูคุณธรรม"
        },
        {
            "id": "t_216",
            "name": "นางวิมลพันธ์ พร้อมสุข"
        },
        {
            "id": "t_217",
            "name": "นางสาวธิดารัตน์ แสนสม"
        },
        {
            "id": "t_218",
            "name": "นางสาวสุดารัตน์ บุญจอง"
        },
        {
            "id": "t_219",
            "name": "นางสาวสุเมธนันท์ แก้วพรม"
        },
        {
            "id": "t_220",
            "name": "นางสาวกฤติพร โยธาวุธ"
        },
        {
            "id": "t_221",
            "name": "นางสาวศิรินธร บุญธรรม"
        },
        {
            "id": "t_222",
            "name": "นางสาวชรินทร์รัตน์ กุลสิริธนาชล"
        },
        {
            "id": "t_223",
            "name": "นางสาวอภิกษณาน์ พรมกลัดพะเนาว์"
        },
        {
            "id": "t_224",
            "name": "นางสาวอังสุภา วงศ์พรมมา"
        },
        {
            "id": "t_225",
            "name": "นางสาวอิสรีย์ ถึกพวง"
        },
        {
            "id": "t_226",
            "name": "นายพงษ์ศักดิ์ พร้อมสุข"
        },
        {
            "id": "t_227",
            "name": "นายภาสกร รุมรวมสิน"
        },
        {
            "id": "t_228",
            "name": "นายพีระพัฒน์ ผูกจันทร์"
        },
        {
            "id": "t_229",
            "name": "นางสาวเพชรอมร จงหาญ"
        },
        {
            "id": "t_230",
            "name": "นายมโนเชาว์ สุขใจ"
        },
        {
            "id": "t_231",
            "name": "นายชินกร พันธ์วงค์"
        },
        {
            "id": "t_232",
            "name": "นางสาวสุวรีย์ โสวะภาสน์"
        },
        {
            "id": "t_233",
            "name": "นางสาวศศิญา กำลังงาม"
        },
        {
            "id": "t_234",
            "name": "นางสาวเจนจิรา สุพรม"
        },
        {
            "id": "t_235",
            "name": "นายกำพล เพชรผดุง"
        },
        {
            "id": "t_236",
            "name": "นางสริณญา โคตรสำราญ"
        },
        {
            "id": "t_237",
            "name": "นางพนมพร ถนอมพันธ์"
        },
        {
            "id": "t_238",
            "name": "นายศักรนันทน์ สำเภา"
        },
        {
            "id": "t_239",
            "name": "นางสาววรินทร์ภรณ์ สวาทชาติ"
        },
        {
            "id": "t_240",
            "name": "นางสาวปัณณิกา อุ่นแพทย์"
        },
        {
            "id": "t_241",
            "name": "นางสาวปนิตา โพธิ์ทอง"
        },
        {
            "id": "t_242",
            "name": "นางสาวจริยา ศรีกะกุล"
        },
        {
            "id": "t_243",
            "name": "นางสาวประภาเพ็ญ ดิศแพทย์"
        },
        {
            "id": "t_244",
            "name": "นางสาวจีรนันท์ เบ้าเงิน"
        },
        {
            "id": "t_245",
            "name": "นางสาวรุ่งทิพย์ สมสุวรรณ"
        },
        {
            "id": "t_246",
            "name": "นางสาวแสงพล ชลกาญจน์"
        },
        {
            "id": "t_247",
            "name": "นางสาวชุติมณฑน์ พัฒนพันธ์"
        },
        {
            "id": "t_248",
            "name": "นางสาวนุชจรินทร์ อมรสิน"
        },
        {
            "id": "t_249",
            "name": "นางสาวปวีณา ยินดีงาม"
        },
        {
            "id": "t_250",
            "name": "นายอาทิตย์ จินดาศรี"
        },
        {
            "id": "t_251",
            "name": "นายนันทวัฒน์ ไชยผา"
        },
        {
            "id": "t_252",
            "name": "นางสาวเยี่ยมจิตต์ สายงาม"
        },
        {
            "id": "t_253",
            "name": "นายศุภชัย รื่นเริง"
        },
        {
            "id": "t_254",
            "name": "นางสาวพรรณนภา จารุการ"
        },
        {
            "id": "t_255",
            "name": "นายสุดใจ พรมดงมัน"
        },
        {
            "id": "t_256",
            "name": "นายวิมล แว่นแคว้น"
        },
        {
            "id": "t_257",
            "name": "นายณรงชัย โสภาบุญ"
        },
        {
            "id": "t_258",
            "name": "นายบรรเจิด กัญญาพันธ์"
        },
        {
            "id": "t_259",
            "name": "นายอนันต์ ละบาป"
        },
        {
            "id": "t_260",
            "name": "นายคามิน นนทการ"
        },
        {
            "id": "t_261",
            "name": "นายสุนทร นามวงศ์"
        },
        {
            "id": "t_262",
            "name": "นายอุทร นะที"
        },
        {
            "id": "t_263",
            "name": "นายสมคิด แผ่นทอง"
        },
        {
            "id": "t_264",
            "name": "นายพงษา แสวงบุญ"
        },
        {
            "id": "t_265",
            "name": "นายทองทิบ หัวดอน"
        },
        {
            "id": "t_266",
            "name": "นายสุวรรณ ศรีสุราช"
        },
        {
            "id": "t_267",
            "name": "นางรำไพ แว่นแคว้น"
        },
        {
            "id": "t_268",
            "name": "นางอมรา ศรีเมือง"
        },
        {
            "id": "t_269",
            "name": "นางอรทัย บุญยะราช"
        },
        {
            "id": "t_270",
            "name": "นางอุลัยวรรณ์ บุญสมยา"
        },
        {
            "id": "t_271",
            "name": "นางสาวรัตนา ครั่งพิบูลย์"
        },
        {
            "id": "t_272",
            "name": "นางสาวหนูนิตย์ ไมลาศรี"
        },
        {
            "id": "t_273",
            "name": "นางเพ็ชร สุริยะวงค์"
        },
        {
            "id": "_1a6ht22t4",
            "name": "นายเรืองชัย เขียวสด"
        }
    ],
    "subjects_master": [
        {
            "id": "s_1",
            "code": "27-40000-1101",
            "name": "การฟังและการพูดภาษาอังกฤษเบื้องต้น",
            "credits": 3,
            "hours": 4,
            "theoryHours": 2,
            "practiceHours": 2
        },
        {
            "id": "s_2",
            "code": "27-40000-1102",
            "name": "ภาษาอังกฤษเพื่อการสื่อสารและทักษะการเรียนรู้",
            "credits": 3,
            "hours": 3,
            "theoryHours": 3,
            "practiceHours": 0
        },
        {
            "id": "s_3",
            "code": "27-40000-1201",
            "name": "วิทยาศาสตร์เทคโนโลยีประยุกต์",
            "credits": 3,
            "hours": 3,
            "theoryHours": 3,
            "practiceHours": 0
        },
        {
            "id": "s_4",
            "code": "27-40000-1202",
            "name": "คณิตศาสตร์และสถิติในชีวิตประจำวัน",
            "credits": 3,
            "hours": 3,
            "theoryHours": 3,
            "practiceHours": 0
        },
        {
            "id": "s_5",
            "code": "27-40000-1203",
            "name": "วิจัยเพื่องานอาชีพ",
            "credits": 3,
            "hours": 3,
            "theoryHours": 3,
            "practiceHours": 0
        },
        {
            "id": "s_6",
            "code": "27-40000-1301",
            "name": "ทักษะการเรียนรู้และมนุษยสัมพันธ์",
            "credits": 3,
            "hours": 3,
            "theoryHours": 3,
            "practiceHours": 0
        },
        {
            "id": "s_7",
            "code": "27-40000-1302",
            "name": "การจัดการเทคโนโลยีดิจิทัลเพื่ออาชีพ",
            "credits": 3,
            "hours": 9,
            "theoryHours": 0,
            "practiceHours": 9
        },
        {
            "id": "s_8",
            "code": "27-40000-1303",
            "name": "ธุรกิจและการเป็นผู้ประกอบการยุคดิจิทัล",
            "credits": 3,
            "hours": 9,
            "theoryHours": 0,
            "practiceHours": 9
        },
        {
            "id": "s_9",
            "code": "27-40121-2101",
            "name": "การออกแบบและการเขียนแบบด้วยคอมพิวเตอร์",
            "credits": 3,
            "hours": 4,
            "theoryHours": 2,
            "practiceHours": 2
        },
        {
            "id": "s_10",
            "code": "27-40121-2102",
            "name": "การวิเคราะห์ออกแบบอาคารด้วยโปรแกรม",
            "credits": 3,
            "hours": 4,
            "theoryHours": 2,
            "practiceHours": 2
        },
        {
            "id": "s_11",
            "code": "27-40121-2103",
            "name": "การประมาณราคาขั้นสูง",
            "credits": 3,
            "hours": 4,
            "theoryHours": 2,
            "practiceHours": 2
        },
        {
            "id": "s_12",
            "code": "27-40121-2104",
            "name": "วัสดุและการทดสอบเพื่องานโยธา",
            "credits": 3,
            "hours": 4,
            "theoryHours": 2,
            "practiceHours": 2
        },
        {
            "id": "s_13",
            "code": "27-40121-2105",
            "name": "การสำรวจเพื่องานก่อสร้างขั้นสูง",
            "credits": 3,
            "hours": 4,
            "theoryHours": 2,
            "practiceHours": 2
        },
        {
            "id": "s_14",
            "code": "27-40121-2106",
            "name": "การออกแบบโครงสร้างคอนกรีตเสริมเหล็ก",
            "credits": 3,
            "hours": 3,
            "theoryHours": 3,
            "practiceHours": 0
        },
        {
            "id": "s_15",
            "code": "27-40121-2201",
            "name": "การจัดการสิ่งแวดล้อมในงานก่อสร้าง",
            "credits": 3,
            "hours": 3,
            "theoryHours": 3,
            "practiceHours": 0
        },
        {
            "id": "s_16",
            "code": "27-40121-2202",
            "name": "จรรยาบรรณวิชาชีพช่างโยธา",
            "credits": 3,
            "hours": 3,
            "theoryHours": 3,
            "practiceHours": 0
        },
        {
            "id": "s_17",
            "code": "27-40121-2203",
            "name": "กฎหมาย สัญญา และรายการก่อสร้าง",
            "credits": 3,
            "hours": 3,
            "theoryHours": 3,
            "practiceHours": 0
        },
        {
            "id": "s_18",
            "code": "27-40121-2204",
            "name": "เทคโนโลยีงานฐานรากและงานดิน",
            "credits": 3,
            "hours": 3,
            "theoryHours": 3,
            "practiceHours": 0
        },
        {
            "id": "s_19",
            "code": "27-40121-2301",
            "name": "การฝึกปฏิบัติงานด้านเทคโนโลยีโยธา 1",
            "credits": 3,
            "hours": 9,
            "theoryHours": 0,
            "practiceHours": 9
        },
        {
            "id": "s_20",
            "code": "27-40121-2302",
            "name": "การฝึกปฏิบัติงานด้านเทคโนโลยีโยธา 2",
            "credits": 3,
            "hours": 9,
            "theoryHours": 0,
            "practiceHours": 9
        },
        {
            "id": "s_21",
            "code": "27-40121-2401",
            "name": "โครงงานพัฒนาทักษะวิชาชีพ 1",
            "credits": 3,
            "hours": 4,
            "theoryHours": 2,
            "practiceHours": 2
        },
        {
            "id": "s_22",
            "code": "27-40121-2402",
            "name": "โครงงานพัฒนาทักษะวิชาชีพ 2",
            "credits": 3,
            "hours": 9,
            "theoryHours": 0,
            "practiceHours": 9
        },
        {
            "id": "s_23",
            "code": "27-40121-3001",
            "name": "การบริหารโครงการก่อสร้าง",
            "credits": 3,
            "hours": 9,
            "theoryHours": 0,
            "practiceHours": 9
        },
        {
            "id": "s_24",
            "code": "27-40121-3002",
            "name": "การควบคุมงานก่อสร้าง",
            "credits": 3,
            "hours": 9,
            "theoryHours": 0,
            "practiceHours": 9
        },
        {
            "id": "s_25",
            "code": "27-40000-4101",
            "name": "กิจกรรมส่งเสริมคุณธรรม จริยธรรม 1",
            "credits": 0,
            "hours": 2,
            "theoryHours": 0,
            "practiceHours": 2
        },
        {
            "id": "s_26",
            "code": "27-40000-4102",
            "name": "กิจกรรมส่งเสริมคุณธรรม จริยธรรม 2",
            "credits": 0,
            "hours": 2,
            "theoryHours": 0,
            "practiceHours": 2
        },
        {
            "id": "s_27",
            "code": "27-40000-4201",
            "name": "กิจกรรมในสถานประกอบการ 1",
            "credits": 0,
            "hours": 2,
            "theoryHours": 0,
            "practiceHours": 2
        },
        {
            "id": "s_28",
            "code": "27-40000-4202",
            "name": "กิจกรรมในสถานประกอบการ 2",
            "credits": 0,
            "hours": 2,
            "theoryHours": 0,
            "practiceHours": 2
        }
    ],
    "students": [
        {
            "id": "_c1titsu2u",
            "studentId": "69401211001",
            "name": "นายธนพล กำทอง"
        },
        {
            "id": "_on53f34os",
            "studentId": "69401211002",
            "name": "นายกิตติพงษ์ นาคจันทร์"
        },
        {
            "id": "_uelngbf4c",
            "studentId": "69401211003",
            "name": "นายวุฒิธวัช มงคลอุทก"
        },
        {
            "id": "_lznf3begr",
            "studentId": "69401211004",
            "name": "นายนรากรณ์ ขันธวงศ์"
        },
        {
            "id": "_yql6kxv8v",
            "studentId": "69401211005",
            "name": "นายสุรชาติ ชารีแก้ว"
        }
    ],
    "terms": [
        {
            "id": "_da2yctc2x",
            "no": "2",
            "year": "2568",
            "subjects": [
                {
                    "id": "_6ybjgur7n",
                    "subjectId": "s_5",
                    "teacherId": "t_17",
                    "level": "ชั้นปี 1",
                    "time": "17.00-20.00",
                    "studentCount": 5,
                    "hours": 51,
                    "rate": 54,
                    "claimData": {
                        "level": "ชั้นปี 1",
                        "academicYear": "2/2568",
                        "curriculum": "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
                        "department": "เทคโนโลยีโยธา",
                        "teacherName": "นายอิทธิวัฒน์ ไทยแท้",
                        "teacherRole": "อาจารย์ผู้สอน",
                        "subjectCode": "27-40000-1203",
                        "subjectName": "วิจัยเพื่องานอาชีพ",
                        "weeklyHours": 3,
                        "credits": 3,
                        "timeStr": "17.00-20.00",
                        "rate": 54,
                        "percent": 60,
                        "startDate": "2025-11-03",
                        "endDateThai": "2 เดือน มีนาคม พ.ศ. 2569",
                        "weeks": [
                            {
                                "weekNo": 1,
                                "dayNo": 1,
                                "sessionNo": 1,
                                "dateStr": "3 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 1,
                                "sessionNo": 2,
                                "dateStr": "10 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 1,
                                "sessionNo": 3,
                                "dateStr": "17 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 1,
                                "sessionNo": 4,
                                "dateStr": "24 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "ลากิจ"
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 1,
                                "sessionNo": 5,
                                "dateStr": "1 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 1,
                                "sessionNo": 6,
                                "dateStr": "8 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 1,
                                "sessionNo": 7,
                                "dateStr": "15 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 1,
                                "sessionNo": 8,
                                "dateStr": "22 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 1,
                                "sessionNo": 9,
                                "dateStr": "29 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 10,
                                "dayNo": 1,
                                "sessionNo": 10,
                                "dateStr": "5 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 11,
                                "dayNo": 1,
                                "sessionNo": 11,
                                "dateStr": "12 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 12,
                                "dayNo": 1,
                                "sessionNo": 12,
                                "dateStr": "19 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 13,
                                "dayNo": 1,
                                "sessionNo": 13,
                                "dateStr": "26 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 14,
                                "dayNo": 1,
                                "sessionNo": 14,
                                "dateStr": "2 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 15,
                                "dayNo": 1,
                                "sessionNo": 15,
                                "dateStr": "9 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 16,
                                "dayNo": 1,
                                "sessionNo": 16,
                                "dateStr": "16 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 17,
                                "dayNo": 1,
                                "sessionNo": 17,
                                "dateStr": "23 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 18,
                                "dayNo": 1,
                                "sessionNo": 18,
                                "dateStr": "2 มี.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            }
                        ],
                        "students": [
                            {
                                "studentId": "69401211001",
                                "name": "นายธนพล",
                                "surname": "กำทอง"
                            },
                            {
                                "studentId": "69401211002",
                                "name": "นายกิตติพงษ์",
                                "surname": "นาคจันทร์"
                            },
                            {
                                "studentId": "69401211003",
                                "name": "นายวุฒิธวัช",
                                "surname": "มงคลอุทก"
                            },
                            {
                                "studentId": "69401211004",
                                "name": "นายนรากรณ์",
                                "surname": "ขันธวงศ์"
                            },
                            {
                                "studentId": "69401211005",
                                "name": "นายสุรชาติ",
                                "surname": "ชารีแก้ว"
                            }
                        ],
                        "signatures": {
                            "teacher": "นายอิทธิวัฒน์ ไทยแท้",
                            "teacherRole": "อาจารย์ผู้สอน",
                            "curriculumHead": "นายชนะ สุทธิประภา",
                            "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
                            "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                            "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
                            "techHead": "นายสถิระ กาญจันดา",
                            "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
                            "academicDeputy": "นายสุวิชา มั่นยืน",
                            "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
                            "financeHead": "นางมลีทอง จารุพงษ์",
                            "financeHeadRole": "หัวหน้าการเงิน",
                            "resourceDeputy": "นางสาวสายฝน สาระผล",
                            "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
                            "director": "นายธาตรี พิบูลมณฑา",
                            "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี",
                            "programChair": "นายณัฐวรรธน์ เกษกุล"
                        },
                        "teachingDaysPerWeek": 1,
                        "totalWeeks": 18,
                        "teachingDays": [
                            {
                                "dow": "1",
                                "time": "17.00-20.00",
                                "hours": 3
                            }
                        ],
                        "hours": 45
                    },
                    "department": "เทคโนโลยีโยธา",
                    "code": "27-40000-1203",
                    "name": "วิจัยเพื่องานอาชีพ"
                },
                {
                    "id": "_rz7yqppzh",
                    "subjectId": "s_17",
                    "teacherId": "t_164",
                    "level": "ชั้นปี 1",
                    "time": "18.00-21.00",
                    "studentCount": 5,
                    "hours": 48,
                    "rate": 54,
                    "claimData": {
                        "level": "ชั้นปี 1",
                        "academicYear": "2/2568",
                        "curriculum": "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
                        "department": "เทคโนโลยีโยธา",
                        "teacherName": "นายณัฐวรรธน์ เกษกุล",
                        "teacherRole": "อาจารย์ผู้สอน",
                        "subjectCode": "27-40121-2203",
                        "subjectName": "กฎหมาย สัญญา และรายการก่อสร้าง",
                        "weeklyHours": 3,
                        "credits": 3,
                        "timeStr": "18.00-21.00",
                        "rate": 54,
                        "percent": 60,
                        "startDate": "2025-11-06",
                        "endDateThai": "5 เดือน มีนาคม พ.ศ. 2569",
                        "teachingDaysPerWeek": 1,
                        "totalWeeks": 18,
                        "teachingDays": [
                            {
                                "dow": "1",
                                "time": "18.00-21.00",
                                "hours": 3
                            }
                        ],
                        "day1DOW": "1",
                        "day1Time": "18.00-21.00",
                        "day1Hours": 3,
                        "day2DOW": "2",
                        "day2Time": "17.00-20.00",
                        "day2Hours": 3,
                        "summerTableLayout": "side_by_side",
                        "weeks": [
                            {
                                "weekNo": 1,
                                "dayNo": 1,
                                "sessionNo": 1,
                                "dateStr": "6 พ.ย. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 1,
                                "sessionNo": 2,
                                "dateStr": "13 พ.ย. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 1,
                                "sessionNo": 3,
                                "dateStr": "20 พ.ย. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 1,
                                "sessionNo": 4,
                                "dateStr": "27 พ.ย. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "ไปราชการ"
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 1,
                                "sessionNo": 5,
                                "dateStr": "4 ธ.ค. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 1,
                                "sessionNo": 6,
                                "dateStr": "11 ธ.ค. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 1,
                                "sessionNo": 7,
                                "dateStr": "18 ธ.ค. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 1,
                                "sessionNo": 8,
                                "dateStr": "25 ธ.ค. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 1,
                                "sessionNo": 9,
                                "dateStr": "1 ม.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "วันขึ้นปีใหม่"
                            },
                            {
                                "weekNo": 10,
                                "dayNo": 1,
                                "sessionNo": 10,
                                "dateStr": "8 ม.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 11,
                                "dayNo": 1,
                                "sessionNo": 11,
                                "dateStr": "15 ม.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 12,
                                "dayNo": 1,
                                "sessionNo": 12,
                                "dateStr": "22 ม.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 13,
                                "dayNo": 1,
                                "sessionNo": 13,
                                "dateStr": "29 ม.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 14,
                                "dayNo": 1,
                                "sessionNo": 14,
                                "dateStr": "5 ก.พ. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 15,
                                "dayNo": 1,
                                "sessionNo": 15,
                                "dateStr": "12 ก.พ. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 16,
                                "dayNo": 1,
                                "sessionNo": 16,
                                "dateStr": "19 ก.พ. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 17,
                                "dayNo": 1,
                                "sessionNo": 17,
                                "dateStr": "26 ก.พ. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 18,
                                "dayNo": 1,
                                "sessionNo": 18,
                                "dateStr": "5 มี.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            }
                        ],
                        "students": [
                            {
                                "studentId": "69401211001",
                                "name": "นายธนพล",
                                "surname": "กำทอง"
                            },
                            {
                                "studentId": "69401211002",
                                "name": "นายกิตติพงษ์",
                                "surname": "นาคจันทร์"
                            },
                            {
                                "studentId": "69401211003",
                                "name": "นายวุฒิธวัช",
                                "surname": "มงคลอุทก"
                            },
                            {
                                "studentId": "69401211004",
                                "name": "นายนรากรณ์",
                                "surname": "ขันธวงศ์"
                            },
                            {
                                "studentId": "69401211005",
                                "name": "นายสุรชาติ",
                                "surname": "ชารีแก้ว"
                            }
                        ],
                        "signatures": {
                            "teacher": "นายณัฐวรรธน์ เกษกุล",
                            "teacherRole": "อาจารย์ผู้สอน",
                            "programChair": "นายณัฐวรรธน์ เกษกุล",
                            "programChairRole": "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
                            "curriculumHead": "นายชนะ สุทธิประภา",
                            "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
                            "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                            "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
                            "techHead": "นายสถิระ กาญจันดา",
                            "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
                            "academicDeputy": "นายสุวิชา มั่นยืน",
                            "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
                            "financeHead": "นางมลีทอง จารุพงษ์",
                            "financeHeadRole": "หัวหน้าการเงิน",
                            "resourceDeputy": "นางสาวสายฝน สาระผล",
                            "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
                            "director": "นายธาตรี พิบูลมณฑา",
                            "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี"
                        }
                    }
                },
                {
                    "id": "_4ill0wkgz",
                    "subjectId": "s_11",
                    "teacherId": "_1a6ht22t4",
                    "level": "ชั้นปี 1",
                    "time": "13.00-17.00",
                    "studentCount": 5,
                    "hours": 72,
                    "rate": 54,
                    "claimData": {
                        "level": "ชั้นปี 1",
                        "academicYear": "2/2568",
                        "curriculum": "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
                        "department": "เทคโนโลยีโยธา",
                        "teacherName": "นายเรืองชัย เขียวสด",
                        "teacherRole": "อาจารย์ผู้สอน",
                        "subjectCode": "27-40121-2103",
                        "subjectName": "การประมาณราคาขั้นสูง",
                        "weeklyHours": 4,
                        "credits": 3,
                        "timeStr": "13.00-17.00",
                        "rate": 54,
                        "percent": 60,
                        "startDate": "2025-11-08",
                        "endDateThai": "7 เดือน มีนาคม พ.ศ. 2569",
                        "teachingDaysPerWeek": 1,
                        "totalWeeks": 18,
                        "teachingDays": [
                            {
                                "dow": "6",
                                "time": "13.00-17.00",
                                "hours": 4
                            }
                        ],
                        "day1DOW": "6",
                        "day1Time": "13.00-17.00",
                        "day1Hours": 4,
                        "day2DOW": "2",
                        "day2Time": "17.00-20.00",
                        "day2Hours": 3,
                        "summerTableLayout": "side_by_side",
                        "weeks": [
                            {
                                "weekNo": 1,
                                "dayNo": 1,
                                "sessionNo": 1,
                                "dateStr": "8 พ.ย. 68",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 1,
                                "sessionNo": 2,
                                "dateStr": "15 พ.ย. 68",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 1,
                                "sessionNo": 3,
                                "dateStr": "22 พ.ย. 68",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 1,
                                "sessionNo": 4,
                                "dateStr": "29 พ.ย. 68",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 1,
                                "sessionNo": 5,
                                "dateStr": "6 ธ.ค. 68",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 1,
                                "sessionNo": 6,
                                "dateStr": "13 ธ.ค. 68",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 1,
                                "sessionNo": 7,
                                "dateStr": "20 ธ.ค. 68",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 1,
                                "sessionNo": 8,
                                "dateStr": "27 ธ.ค. 68",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 1,
                                "sessionNo": 9,
                                "dateStr": "3 ม.ค. 69",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 10,
                                "dayNo": 1,
                                "sessionNo": 10,
                                "dateStr": "10 ม.ค. 69",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 11,
                                "dayNo": 1,
                                "sessionNo": 11,
                                "dateStr": "17 ม.ค. 69",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 12,
                                "dayNo": 1,
                                "sessionNo": 12,
                                "dateStr": "24 ม.ค. 69",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 13,
                                "dayNo": 1,
                                "sessionNo": 13,
                                "dateStr": "31 ม.ค. 69",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 14,
                                "dayNo": 1,
                                "sessionNo": 14,
                                "dateStr": "7 ก.พ. 69",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 15,
                                "dayNo": 1,
                                "sessionNo": 15,
                                "dateStr": "14 ก.พ. 69",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 16,
                                "dayNo": 1,
                                "sessionNo": 16,
                                "dateStr": "21 ก.พ. 69",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 17,
                                "dayNo": 1,
                                "sessionNo": 17,
                                "dateStr": "28 ก.พ. 69",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 18,
                                "dayNo": 1,
                                "sessionNo": 18,
                                "dateStr": "7 มี.ค. 69",
                                "timeStr": "13.00-17.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            }
                        ],
                        "students": [
                            {
                                "studentId": "69401211001",
                                "name": "นายธนพล",
                                "surname": "กำทอง"
                            },
                            {
                                "studentId": "69401211002",
                                "name": "นายกิตติพงษ์",
                                "surname": "นาคจันทร์"
                            },
                            {
                                "studentId": "69401211003",
                                "name": "นายวุฒิธวัช",
                                "surname": "มงคลอุทก"
                            },
                            {
                                "studentId": "69401211004",
                                "name": "นายนรากรณ์",
                                "surname": "ขันธวงศ์"
                            },
                            {
                                "studentId": "69401211005",
                                "name": "นายสุรชาติ",
                                "surname": "ชารีแก้ว"
                            }
                        ],
                        "signatures": {
                            "teacher": "นายเรืองชัย เขียวสด",
                            "teacherRole": "อาจารย์ผู้สอน",
                            "programChair": "นายณัฐวรรธน์ เกษกุล",
                            "programChairRole": "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
                            "curriculumHead": "นายชนะ สุทธิประภา",
                            "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
                            "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                            "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
                            "techHead": "นายสถิระ กาญจันดา",
                            "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
                            "academicDeputy": "นายสุวิชา มั่นยืน",
                            "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
                            "financeHead": "นางมลีทอง จารุพงษ์",
                            "financeHeadRole": "หัวหน้าการเงิน",
                            "resourceDeputy": "นางสาวสายฝน สาระผล",
                            "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
                            "director": "นายธาตรี พิบูลมณฑา",
                            "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี"
                        },
                        "theoryHours": 2,
                        "practiceHours": 2
                    },
                    "name": "การประมาณราคาขั้นสูง",
                    "code": "27-40121-2103",
                    "credits": 3
                },
                {
                    "id": "_2c04qje77",
                    "subjectId": "s_16",
                    "teacherId": "t_13",
                    "level": "ชั้นปี 1",
                    "time": "17.00-20.00",
                    "studentCount": 5,
                    "hours": 54,
                    "rate": 54,
                    "claimData": {
                        "level": "ชั้นปี 1",
                        "academicYear": "2/2568",
                        "curriculum": "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
                        "department": "เทคโนโลยีโยธา",
                        "teacherName": "นางกนกพร ไชยวิเศษ",
                        "teacherRole": "อาจารย์ผู้สอน",
                        "subjectCode": "27-40121-2202",
                        "subjectName": "จรรยาบรรณวิชาชีพช่างโยธา",
                        "weeklyHours": 3,
                        "credits": 3,
                        "timeStr": "17.00-20.00",
                        "rate": 54,
                        "percent": 60,
                        "startDate": "2025-11-07",
                        "endDateThai": "6 เดือน มีนาคม พ.ศ. 2569",
                        "teachingDaysPerWeek": 1,
                        "totalWeeks": 18,
                        "teachingDays": [
                            {
                                "dow": "1",
                                "time": "17.00-20.00",
                                "hours": 3
                            }
                        ],
                        "day1DOW": "1",
                        "day1Time": "17.00-20.00",
                        "day1Hours": 3,
                        "day2DOW": "2",
                        "day2Time": "17.00-20.00",
                        "day2Hours": 3,
                        "summerTableLayout": "side_by_side",
                        "weeks": [
                            {
                                "weekNo": 1,
                                "dayNo": 1,
                                "sessionNo": 1,
                                "dateStr": "7 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 1,
                                "sessionNo": 2,
                                "dateStr": "14 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 1,
                                "sessionNo": 3,
                                "dateStr": "21 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 1,
                                "sessionNo": 4,
                                "dateStr": "28 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 1,
                                "sessionNo": 5,
                                "dateStr": "5 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 1,
                                "sessionNo": 6,
                                "dateStr": "12 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 1,
                                "sessionNo": 7,
                                "dateStr": "19 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 1,
                                "sessionNo": 8,
                                "dateStr": "26 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 1,
                                "sessionNo": 9,
                                "dateStr": "2 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 10,
                                "dayNo": 1,
                                "sessionNo": 10,
                                "dateStr": "9 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 11,
                                "dayNo": 1,
                                "sessionNo": 11,
                                "dateStr": "16 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 12,
                                "dayNo": 1,
                                "sessionNo": 12,
                                "dateStr": "23 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 13,
                                "dayNo": 1,
                                "sessionNo": 13,
                                "dateStr": "30 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 14,
                                "dayNo": 1,
                                "sessionNo": 14,
                                "dateStr": "6 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 15,
                                "dayNo": 1,
                                "sessionNo": 15,
                                "dateStr": "13 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 16,
                                "dayNo": 1,
                                "sessionNo": 16,
                                "dateStr": "20 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 17,
                                "dayNo": 1,
                                "sessionNo": 17,
                                "dateStr": "27 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 18,
                                "dayNo": 1,
                                "sessionNo": 18,
                                "dateStr": "6 มี.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            }
                        ],
                        "students": [
                            {
                                "studentId": "69401211001",
                                "name": "นายธนพล",
                                "surname": "กำทอง"
                            },
                            {
                                "studentId": "69401211002",
                                "name": "นายกิตติพงษ์",
                                "surname": "นาคจันทร์"
                            },
                            {
                                "studentId": "69401211003",
                                "name": "นายวุฒิธวัช",
                                "surname": "มงคลอุทก"
                            },
                            {
                                "studentId": "69401211004",
                                "name": "นายนรากรณ์",
                                "surname": "ขันธวงศ์"
                            },
                            {
                                "studentId": "69401211005",
                                "name": "นายสุรชาติ",
                                "surname": "ชารีแก้ว"
                            }
                        ],
                        "signatures": {
                            "teacher": "นางกนกพร ไชยวิเศษ",
                            "teacherRole": "อาจารย์ผู้สอน",
                            "programChair": "นายณัฐวรรธน์ เกษกุล",
                            "programChairRole": "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
                            "curriculumHead": "นายชนะ สุทธิประภา",
                            "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
                            "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                            "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
                            "techHead": "นายสถิระ กาญจันดา",
                            "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
                            "academicDeputy": "นายสุวิชา มั่นยืน",
                            "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
                            "financeHead": "นางมลีทอง จารุพงษ์",
                            "financeHeadRole": "หัวหน้าการเงิน",
                            "resourceDeputy": "นางสาวสายฝน สาระผล",
                            "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
                            "director": "นายธาตรี พิบูลมณฑา",
                            "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี"
                        },
                        "hours": 54
                    },
                    "name": "จรรยาบรรณวิชาชีพช่างโยธา",
                    "code": "27-40121-2202",
                    "credits": 3,
                    "includeInRateCalc": true
                },
                {
                    "id": "_yu1tzdasl",
                    "subjectId": "s_6",
                    "teacherId": "t_44",
                    "level": "ชั้นปี 1",
                    "time": "18.00-21.00",
                    "studentCount": 5,
                    "hours": 48,
                    "rate": 54,
                    "claimData": {
                        "level": "ชั้นปี 1",
                        "academicYear": "2/2568",
                        "curriculum": "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
                        "department": "เทคโนโลยีโยธา",
                        "teacherName": "นางมนัสนันท์ ไทยแท้",
                        "teacherRole": "อาจารย์ผู้สอน",
                        "subjectCode": "27-40000-1301",
                        "subjectName": "ทักษะการเรียนรู้และมนุษยสัมพันธ์",
                        "weeklyHours": 3,
                        "credits": 3,
                        "timeStr": "18.00-21.00",
                        "rate": 54,
                        "percent": 60,
                        "startDate": "2025-11-04",
                        "endDateThai": "3 เดือน มีนาคม พ.ศ. 2569",
                        "teachingDaysPerWeek": 1,
                        "totalWeeks": 18,
                        "teachingDays": [
                            {
                                "dow": "2",
                                "time": "18.00-21.00",
                                "hours": 3
                            }
                        ],
                        "day1DOW": "2",
                        "day1Time": "18.00-21.00",
                        "day1Hours": 3,
                        "day2DOW": "2",
                        "day2Time": "17.00-20.00",
                        "day2Hours": 3,
                        "summerTableLayout": "side_by_side",
                        "weeks": [
                            {
                                "weekNo": 1,
                                "dayNo": 1,
                                "sessionNo": 1,
                                "dateStr": "4 พ.ย. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 1,
                                "sessionNo": 2,
                                "dateStr": "11 พ.ย. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 1,
                                "sessionNo": 3,
                                "dateStr": "18 พ.ย. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 1,
                                "sessionNo": 4,
                                "dateStr": "25 พ.ย. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "ลากิจ"
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 1,
                                "sessionNo": 5,
                                "dateStr": "2 ธ.ค. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 1,
                                "sessionNo": 6,
                                "dateStr": "9 ธ.ค. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 1,
                                "sessionNo": 7,
                                "dateStr": "16 ธ.ค. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 1,
                                "sessionNo": 8,
                                "dateStr": "23 ธ.ค. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 1,
                                "sessionNo": 9,
                                "dateStr": "30 ธ.ค. 68",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 10,
                                "dayNo": 1,
                                "sessionNo": 10,
                                "dateStr": "6 ม.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 11,
                                "dayNo": 1,
                                "sessionNo": 11,
                                "dateStr": "13 ม.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 12,
                                "dayNo": 1,
                                "sessionNo": 12,
                                "dateStr": "20 ม.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 13,
                                "dayNo": 1,
                                "sessionNo": 13,
                                "dateStr": "27 ม.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 14,
                                "dayNo": 1,
                                "sessionNo": 14,
                                "dateStr": "3 ก.พ. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 15,
                                "dayNo": 1,
                                "sessionNo": 15,
                                "dateStr": "10 ก.พ. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 16,
                                "dayNo": 1,
                                "sessionNo": 16,
                                "dateStr": "17 ก.พ. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 17,
                                "dayNo": 1,
                                "sessionNo": 17,
                                "dateStr": "24 ก.พ. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 18,
                                "dayNo": 1,
                                "sessionNo": 18,
                                "dateStr": "3 มี.ค. 69",
                                "timeStr": "18.00-21.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "วันมาฆบูชา"
                            }
                        ],
                        "students": [
                            {
                                "studentId": "69401211001",
                                "name": "นายธนพล",
                                "surname": "กำทอง"
                            },
                            {
                                "studentId": "69401211002",
                                "name": "นายกิตติพงษ์",
                                "surname": "นาคจันทร์"
                            },
                            {
                                "studentId": "69401211003",
                                "name": "นายวุฒิธวัช",
                                "surname": "มงคลอุทก"
                            },
                            {
                                "studentId": "69401211004",
                                "name": "นายนรากรณ์",
                                "surname": "ขันธวงศ์"
                            },
                            {
                                "studentId": "69401211005",
                                "name": "นายสุรชาติ",
                                "surname": "ชารีแก้ว"
                            }
                        ],
                        "signatures": {
                            "teacher": "นางมนัสนันท์ ไทยแท้",
                            "teacherRole": "อาจารย์ผู้สอน",
                            "programChair": "นายณัฐวรรธน์ เกษกุล",
                            "programChairRole": "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
                            "curriculumHead": "นายชนะ สุทธิประภา",
                            "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
                            "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                            "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
                            "techHead": "นายสถิระ กาญจันดา",
                            "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
                            "academicDeputy": "นายสุวิชา มั่นยืน",
                            "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
                            "financeHead": "นางมลีทอง จารุพงษ์",
                            "financeHeadRole": "หัวหน้าการเงิน",
                            "resourceDeputy": "นางสาวสายฝน สาระผล",
                            "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
                            "director": "นายธาตรี พิบูลมณฑา",
                            "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี"
                        }
                    }
                },
                {
                    "id": "_fh83tpq18",
                    "subjectId": "s_18",
                    "teacherId": "t_164",
                    "level": "ชั้นปี 1",
                    "time": "9.00-12.00",
                    "studentCount": 5,
                    "hours": 54,
                    "rate": 54,
                    "claimData": {
                        "level": "ชั้นปี 1",
                        "academicYear": "2/2568",
                        "curriculum": "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
                        "department": "เทคโนโลยีโยธา",
                        "teacherName": "นายณัฐวรรธน์ เกษกุล",
                        "teacherRole": "อาจารย์ผู้สอน",
                        "subjectCode": "27-40121-2204",
                        "subjectName": "เทคโนโลยีงานฐานรากและงานดิน",
                        "weeklyHours": 3,
                        "credits": 3,
                        "timeStr": "9.00-12.00",
                        "rate": 54,
                        "percent": 60,
                        "startDate": "2025-11-08",
                        "endDateThai": "7 เดือน มีนาคม พ.ศ. 2569",
                        "teachingDaysPerWeek": 1,
                        "totalWeeks": 18,
                        "teachingDays": [
                            {
                                "dow": "1",
                                "time": "9.00-12.00",
                                "hours": 3
                            }
                        ],
                        "day1DOW": "1",
                        "day1Time": "9.00-12.00",
                        "day1Hours": 3,
                        "day2DOW": "2",
                        "day2Time": "17.00-20.00",
                        "day2Hours": 3,
                        "summerTableLayout": "side_by_side",
                        "weeks": [
                            {
                                "weekNo": 1,
                                "dayNo": 1,
                                "sessionNo": 1,
                                "dateStr": "8 พ.ย. 68",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 1,
                                "sessionNo": 2,
                                "dateStr": "15 พ.ย. 68",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 1,
                                "sessionNo": 3,
                                "dateStr": "22 พ.ย. 68",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 1,
                                "sessionNo": 4,
                                "dateStr": "29 พ.ย. 68",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 1,
                                "sessionNo": 5,
                                "dateStr": "6 ธ.ค. 68",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 1,
                                "sessionNo": 6,
                                "dateStr": "13 ธ.ค. 68",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 1,
                                "sessionNo": 7,
                                "dateStr": "20 ธ.ค. 68",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 1,
                                "sessionNo": 8,
                                "dateStr": "27 ธ.ค. 68",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 1,
                                "sessionNo": 9,
                                "dateStr": "3 ม.ค. 69",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 10,
                                "dayNo": 1,
                                "sessionNo": 10,
                                "dateStr": "10 ม.ค. 69",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 11,
                                "dayNo": 1,
                                "sessionNo": 11,
                                "dateStr": "17 ม.ค. 69",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 12,
                                "dayNo": 1,
                                "sessionNo": 12,
                                "dateStr": "24 ม.ค. 69",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 13,
                                "dayNo": 1,
                                "sessionNo": 13,
                                "dateStr": "31 ม.ค. 69",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 14,
                                "dayNo": 1,
                                "sessionNo": 14,
                                "dateStr": "7 ก.พ. 69",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 15,
                                "dayNo": 1,
                                "sessionNo": 15,
                                "dateStr": "14 ก.พ. 69",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 16,
                                "dayNo": 1,
                                "sessionNo": 16,
                                "dateStr": "21 ก.พ. 69",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 17,
                                "dayNo": 1,
                                "sessionNo": 17,
                                "dateStr": "28 ก.พ. 69",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 18,
                                "dayNo": 1,
                                "sessionNo": 18,
                                "dateStr": "7 มี.ค. 69",
                                "timeStr": "9.00-12.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            }
                        ],
                        "students": [
                            {
                                "studentId": "69401211001",
                                "name": "นายธนพล",
                                "surname": "กำทอง"
                            },
                            {
                                "studentId": "69401211002",
                                "name": "นายกิตติพงษ์",
                                "surname": "นาคจันทร์"
                            },
                            {
                                "studentId": "69401211003",
                                "name": "นายวุฒิธวัช",
                                "surname": "มงคลอุทก"
                            },
                            {
                                "studentId": "69401211004",
                                "name": "นายนรากรณ์",
                                "surname": "ขันธวงศ์"
                            },
                            {
                                "studentId": "69401211005",
                                "name": "นายสุรชาติ",
                                "surname": "ชารีแก้ว"
                            }
                        ],
                        "signatures": {
                            "teacher": "นายณัฐวรรธน์ เกษกุล",
                            "teacherRole": "อาจารย์ผู้สอน",
                            "programChair": "นายณัฐวรรธน์ เกษกุล",
                            "programChairRole": "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
                            "curriculumHead": "นายชนะ สุทธิประภา",
                            "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
                            "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                            "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
                            "techHead": "นายสถิระ กาญจันดา",
                            "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
                            "academicDeputy": "นายสุวิชา มั่นยืน",
                            "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
                            "financeHead": "นางมลีทอง จารุพงษ์",
                            "financeHeadRole": "หัวหน้าการเงิน",
                            "resourceDeputy": "นางสาวสายฝน สาระผล",
                            "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
                            "director": "นายธาตรี พิบูลมณฑา",
                            "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี"
                        }
                    }
                },
                {
                    "id": "_yhkge0fg8",
                    "subjectId": "s_2",
                    "teacherId": "t_45",
                    "level": "ชั้นปี 1",
                    "time": "17.00-20.00",
                    "studentCount": 5,
                    "hours": 48,
                    "rate": 54,
                    "claimData": {
                        "level": "ชั้นปี 1",
                        "academicYear": "2/2568",
                        "curriculum": "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
                        "department": "เทคโนโลยีโยธา",
                        "teacherName": "นางสาวปรานี ศรีมันตะ",
                        "teacherRole": "อาจารย์ผู้สอน",
                        "subjectCode": "27-40000-1102",
                        "subjectName": "ภาษาอังกฤษเพื่อการสื่อสารและทักษะการเรียนรู้",
                        "weeklyHours": 3,
                        "credits": 3,
                        "timeStr": "17.00-20.00",
                        "rate": 54,
                        "percent": 60,
                        "startDate": "2025-11-05",
                        "endDateThai": "4 เดือน มีนาคม พ.ศ. 2569",
                        "teachingDaysPerWeek": 1,
                        "totalWeeks": 18,
                        "teachingDays": [
                            {
                                "dow": "1",
                                "time": "17.00-20.00",
                                "hours": 3
                            }
                        ],
                        "day1DOW": "1",
                        "day1Time": "17.00-20.00",
                        "day1Hours": 3,
                        "day2DOW": "2",
                        "day2Time": "17.00-20.00",
                        "day2Hours": 3,
                        "summerTableLayout": "side_by_side",
                        "weeks": [
                            {
                                "weekNo": 1,
                                "dayNo": 1,
                                "sessionNo": 1,
                                "dateStr": "5 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 1,
                                "sessionNo": 2,
                                "dateStr": "12 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 1,
                                "sessionNo": 3,
                                "dateStr": "19 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 1,
                                "sessionNo": 4,
                                "dateStr": "26 พ.ย. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 1,
                                "sessionNo": 5,
                                "dateStr": "3 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 1,
                                "sessionNo": 6,
                                "dateStr": "10 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "วันรัฐธรรมนูญ"
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 1,
                                "sessionNo": 7,
                                "dateStr": "17 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 1,
                                "sessionNo": 8,
                                "dateStr": "24 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 1,
                                "sessionNo": 9,
                                "dateStr": "31 ธ.ค. 68",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "วันสิ้นปี"
                            },
                            {
                                "weekNo": 10,
                                "dayNo": 1,
                                "sessionNo": 10,
                                "dateStr": "7 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 11,
                                "dayNo": 1,
                                "sessionNo": 11,
                                "dateStr": "14 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 12,
                                "dayNo": 1,
                                "sessionNo": 12,
                                "dateStr": "21 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 13,
                                "dayNo": 1,
                                "sessionNo": 13,
                                "dateStr": "28 ม.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 14,
                                "dayNo": 1,
                                "sessionNo": 14,
                                "dateStr": "4 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 15,
                                "dayNo": 1,
                                "sessionNo": 15,
                                "dateStr": "11 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 16,
                                "dayNo": 1,
                                "sessionNo": 16,
                                "dateStr": "18 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 17,
                                "dayNo": 1,
                                "sessionNo": 17,
                                "dateStr": "25 ก.พ. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 18,
                                "dayNo": 1,
                                "sessionNo": 18,
                                "dateStr": "4 มี.ค. 69",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            }
                        ],
                        "students": [
                            {
                                "studentId": "69401211001",
                                "name": "นายธนพล",
                                "surname": "กำทอง"
                            },
                            {
                                "studentId": "69401211002",
                                "name": "นายกิตติพงษ์",
                                "surname": "นาคจันทร์"
                            },
                            {
                                "studentId": "69401211003",
                                "name": "นายวุฒิธวัช",
                                "surname": "มงคลอุทก"
                            },
                            {
                                "studentId": "69401211004",
                                "name": "นายนรากรณ์",
                                "surname": "ขันธวงศ์"
                            },
                            {
                                "studentId": "69401211005",
                                "name": "นายสุรชาติ",
                                "surname": "ชารีแก้ว"
                            }
                        ],
                        "signatures": {
                            "teacher": "นางสาวปรานี ศรีมันตะ",
                            "teacherRole": "อาจารย์ผู้สอน",
                            "programChair": "นายณัฐวรรธน์ เกษกุล",
                            "programChairRole": "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
                            "curriculumHead": "นายชนะ สุทธิประภา",
                            "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
                            "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                            "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
                            "techHead": "นายสถิระ กาญจันดา",
                            "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
                            "academicDeputy": "นายสุวิชา มั่นยืน",
                            "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
                            "financeHead": "นางมลีทอง จารุพงษ์",
                            "financeHeadRole": "หัวหน้าการเงิน",
                            "resourceDeputy": "นางสาวสายฝน สาระผล",
                            "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
                            "director": "นายธาตรี พิบูลมณฑา",
                            "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี"
                        }
                    }
                }
            ],
            "summaryClaimData": {
                "selectedSubjectIds": [
                    "_6ybjgur7n",
                    "_rz7yqppzh",
                    "_4ill0wkgz",
                    "_2c04qje77",
                    "_yu1tzdasl",
                    "_fh83tpq18",
                    "_yhkge0fg8"
                ],
                "deptHeader": "สาขาวิชาโยธา  วิทยาลัยเทคนิคอุบลราชธานี",
                "docNo": "",
                "docDate": "",
                "docSubject": "ขอเบิกค่าสอนระดับปริญญาตรี",
                "recipient": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี",
                "requesterName": "นายณัฐวรรธน์ เกษกุล",
                "requesterRole": "อาจารย์",
                "department": "เทคโนโลยีโยธา",
                "classLevel": "1",
                "termYearStr": "2/2568",
                "percent": "60",
                "startDateStr": "3 เดือน พฤศจิกายน พ.ศ. 2568",
                "endDateStr": "7 เดือน มีนาคม พ.ศ. 2569",
                "signatures": {
                    "requester": "นายณัฐวรรธน์ เกษกุล",
                    "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                    "verifier": "นายชนะ   สุทธิประภา",
                    "verifierRole": "",
                    "academicDeputy": "นายสุวิชา  มั่นยืน",
                    "resourceDeputy": "นางสาวสายฝน  สาระผล",
                    "director": "นายธาตรี  พิบูลมณฑา"
                }
            },
            "totalTeachingHours": 375,
            "budget": 20250,
            "hourlyRate": 54,
            "excludedRateSubIds": []
        },
        {
            "id": "_chcoahevr",
            "no": "3",
            "year": "2568",
            "subjects": [
                {
                    "id": "_zj9tzz1pu",
                    "subjectId": "s_15",
                    "teacherId": "t_164",
                    "level": "ชั้นปี 1",
                    "time": "17.00-20.00",
                    "studentCount": 5,
                    "hours": 42,
                    "rate": 26,
                    "claimData": {
                        "level": "ชั้นปี 1",
                        "academicYear": "3/2568",
                        "curriculum": "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
                        "department": "เทคโนโลยีโยธา",
                        "teacherName": "นายณัฐวรรธน์ เกษกุล",
                        "teacherRole": "อาจารย์ผู้สอน",
                        "subjectCode": "27-40121-2201",
                        "subjectName": "การจัดการสิ่งแวดล้อมในงานก่อสร้าง",
                        "weeklyHours": 3,
                        "credits": 3,
                        "timeStr": "17.00-20.00",
                        "rate": 26,
                        "percent": 60,
                        "startDate": "2026-03-09",
                        "endDateThai": "5 เดือน พฤษภาคม พ.ศ. 2569",
                        "teachingDaysPerWeek": 2,
                        "totalWeeks": 9,
                        "teachingDays": [
                            {
                                "dow": "1",
                                "time": "17.00-20.00",
                                "hours": 3
                            },
                            {
                                "dow": "2",
                                "time": "17.00-20.00",
                                "hours": 3
                            }
                        ],
                        "day1DOW": "1",
                        "day1Time": "17.00-20.00",
                        "day1Hours": 3,
                        "day2DOW": "2",
                        "day2Time": "17.00-20.00",
                        "day2Hours": 3,
                        "summerTableLayout": "sequential",
                        "weeks": [
                            {
                                "weekNo": 1,
                                "dayNo": 1,
                                "sessionNo": 1,
                                "dateStr": "9 มี.ค. 69",
                                "isoDate": "2026-03-09",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 1,
                                "dayNo": 2,
                                "sessionNo": 2,
                                "dateStr": "10 มี.ค. 69",
                                "isoDate": "2026-03-10",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 1,
                                "sessionNo": 3,
                                "dateStr": "16 มี.ค. 69",
                                "isoDate": "2026-03-16",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 2,
                                "sessionNo": 4,
                                "dateStr": "17 มี.ค. 69",
                                "isoDate": "2026-03-17",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 1,
                                "sessionNo": 5,
                                "dateStr": "23 มี.ค. 69",
                                "isoDate": "2026-03-23",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 2,
                                "sessionNo": 6,
                                "dateStr": "24 มี.ค. 69",
                                "isoDate": "2026-03-24",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 1,
                                "sessionNo": 7,
                                "dateStr": "30 มี.ค. 69",
                                "isoDate": "2026-03-30",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 2,
                                "sessionNo": 8,
                                "dateStr": "31 มี.ค. 69",
                                "isoDate": "2026-03-31",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 1,
                                "sessionNo": 9,
                                "dateStr": "6 เม.ย. 69",
                                "isoDate": "2026-04-06",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "ไปราชการ"
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 2,
                                "sessionNo": 10,
                                "dateStr": "7 เม.ย. 69",
                                "isoDate": "2026-04-07",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 1,
                                "sessionNo": 11,
                                "dateStr": "13 เม.ย. 69",
                                "isoDate": "2026-04-13",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "วันสงกรานต์"
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 2,
                                "sessionNo": 12,
                                "dateStr": "14 เม.ย. 69",
                                "isoDate": "2026-04-14",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "วันสงกรานต์"
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 1,
                                "sessionNo": 13,
                                "dateStr": "20 เม.ย. 69",
                                "isoDate": "2026-04-20",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 2,
                                "sessionNo": 14,
                                "dateStr": "21 เม.ย. 69",
                                "isoDate": "2026-04-21",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 1,
                                "sessionNo": 15,
                                "dateStr": "27 เม.ย. 69",
                                "isoDate": "2026-04-27",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 2,
                                "sessionNo": 16,
                                "dateStr": "28 เม.ย. 69",
                                "isoDate": "2026-04-28",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 1,
                                "sessionNo": 17,
                                "dateStr": "4 พ.ค. 69",
                                "isoDate": "2026-05-04",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "วันฉัตรมงคล"
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 2,
                                "sessionNo": 18,
                                "dateStr": "5 พ.ค. 69",
                                "isoDate": "2026-05-05",
                                "timeStr": "17.00-20.00",
                                "theoryHrs": 3,
                                "practiceHrs": 0,
                                "totalHrs": 3,
                                "isHoliday": false,
                                "holidayReason": ""
                            }
                        ],
                        "students": [
                            {
                                "studentId": "68401211001",
                                "name": "นายวัชรายุทธ",
                                "surname": "นิพระขัน"
                            },
                            {
                                "studentId": "68401211002",
                                "name": "นางสาวกัญญาวีร์",
                                "surname": "ศรีอักษร"
                            },
                            {
                                "studentId": "68401211003",
                                "name": "นางสาวษาวิณีย์",
                                "surname": "วันดี"
                            },
                            {
                                "studentId": "68401211004",
                                "name": "นายบัณฑิต",
                                "surname": "นาทัน"
                            },
                            {
                                "studentId": "68401211005",
                                "name": "นางสาวนันทนา",
                                "surname": "สนธิไชย"
                            }
                        ],
                        "signatures": {
                            "teacherRole": "อาจารย์ผู้สอน",
                            "programChair": "นายณัฐวรรธน์ เกษกุล",
                            "programChairRole": "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
                            "curriculumHead": "นายชนะ สุทธิประภา",
                            "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
                            "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                            "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
                            "techHead": "นายสถิระ กาญจันดา",
                            "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
                            "academicDeputy": "นายสุวิชา มั่นยืน",
                            "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
                            "financeHead": "นางมลีทอง จารุพงษ์",
                            "financeHeadRole": "หัวหน้าการเงิน",
                            "resourceDeputy": "นางสาวสายฝน สาระผล",
                            "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
                            "director": "นายธาตรี พิบูลมณฑา",
                            "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี",
                            "teacher": "นายณัฐวรรธน์ เกษกุล"
                        },
                        "studentCount": 5,
                        "theoryHours": 3,
                        "practiceHours": 0
                    }
                },
                {
                    "id": "_c4vai0lco",
                    "subjectId": "s_10",
                    "teacherId": "t_164",
                    "level": "ชั้นปี 1",
                    "time": "17.00-21.00",
                    "studentCount": 5,
                    "hours": 64,
                    "rate": 20,
                    "claimData": {
                        "level": "ชั้นปี 1",
                        "academicYear": "3/2568",
                        "curriculum": "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
                        "department": "เทคโนโลยีโยธา",
                        "teacherName": "นายณัฐวรรธน์ เกษกุล",
                        "teacherRole": "อาจารย์ผู้สอน",
                        "subjectCode": "27-40121-2102",
                        "subjectName": "การวิเคราะห์ออกแบบอาคารด้วยโปรแกรม",
                        "weeklyHours": 4,
                        "credits": 3,
                        "timeStr": "17.00-21.00",
                        "rate": 20,
                        "percent": 60,
                        "startDate": "2026-03-11",
                        "endDateThai": "7 เดือน พฤษภาคม พ.ศ. 2569",
                        "teachingDaysPerWeek": 2,
                        "totalWeeks": 9,
                        "teachingDays": [
                            {
                                "dow": "3",
                                "time": "17.00-21.00",
                                "hours": 4
                            },
                            {
                                "dow": "4",
                                "time": "17.00-21.00",
                                "hours": 4
                            }
                        ],
                        "day1DOW": "3",
                        "day1Time": "17.00-21.00",
                        "day1Hours": 4,
                        "day2DOW": "4",
                        "day2Time": "17.00-21.00",
                        "day2Hours": 4,
                        "summerTableLayout": "sequential",
                        "weeks": [
                            {
                                "weekNo": 1,
                                "dayNo": 1,
                                "sessionNo": 1,
                                "dateStr": "11 มี.ค. 69",
                                "isoDate": "2026-03-11",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 1,
                                "dayNo": 2,
                                "sessionNo": 2,
                                "dateStr": "12 มี.ค. 69",
                                "isoDate": "2026-03-12",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 1,
                                "sessionNo": 3,
                                "dateStr": "18 มี.ค. 69",
                                "isoDate": "2026-03-18",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 2,
                                "sessionNo": 4,
                                "dateStr": "19 มี.ค. 69",
                                "isoDate": "2026-03-19",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "ไปราชการ"
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 1,
                                "sessionNo": 5,
                                "dateStr": "25 มี.ค. 69",
                                "isoDate": "2026-03-25",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 2,
                                "sessionNo": 6,
                                "dateStr": "26 มี.ค. 69",
                                "isoDate": "2026-03-26",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 1,
                                "sessionNo": 7,
                                "dateStr": "1 เม.ย. 69",
                                "isoDate": "2026-04-01",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 2,
                                "sessionNo": 8,
                                "dateStr": "2 เม.ย. 69",
                                "isoDate": "2026-04-02",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 1,
                                "sessionNo": 9,
                                "dateStr": "8 เม.ย. 69",
                                "isoDate": "2026-04-08",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 2,
                                "sessionNo": 10,
                                "dateStr": "9 เม.ย. 69",
                                "isoDate": "2026-04-09",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 1,
                                "sessionNo": 11,
                                "dateStr": "15 เม.ย. 69",
                                "isoDate": "2026-04-15",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "วันสงกรานต์"
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 2,
                                "sessionNo": 12,
                                "dateStr": "16 เม.ย. 69",
                                "isoDate": "2026-04-16",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 1,
                                "sessionNo": 13,
                                "dateStr": "22 เม.ย. 69",
                                "isoDate": "2026-04-22",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 2,
                                "sessionNo": 14,
                                "dateStr": "23 เม.ย. 69",
                                "isoDate": "2026-04-23",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 1,
                                "sessionNo": 15,
                                "dateStr": "29 เม.ย. 69",
                                "isoDate": "2026-04-29",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 2,
                                "sessionNo": 16,
                                "dateStr": "30 เม.ย. 69",
                                "isoDate": "2026-04-30",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 1,
                                "sessionNo": 17,
                                "dateStr": "6 พ.ค. 69",
                                "isoDate": "2026-05-06",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 2,
                                "sessionNo": 18,
                                "dateStr": "7 พ.ค. 69",
                                "isoDate": "2026-05-07",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            }
                        ],
                        "students": [
                            {
                                "studentId": "68401211001",
                                "name": "นายวัชรายุทธ",
                                "surname": "นิพระขัน"
                            },
                            {
                                "studentId": "68401211002",
                                "name": "นางสาวกัญญาวีร์",
                                "surname": "ศรีอักษร"
                            },
                            {
                                "studentId": "68401211003",
                                "name": "นางสาวษาวิณีย์",
                                "surname": "วันดี"
                            },
                            {
                                "studentId": "68401211004",
                                "name": "นายบัณฑิต",
                                "surname": "นาทัน"
                            },
                            {
                                "studentId": "68401211005",
                                "name": "นางสาวนันทนา",
                                "surname": "สนธิไชย"
                            }
                        ],
                        "signatures": {
                            "teacherRole": "อาจารย์ผู้สอน",
                            "programChair": "นายณัฐวรรธน์ เกษกุล",
                            "programChairRole": "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
                            "curriculumHead": "นายชนะ สุทธิประภา",
                            "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
                            "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                            "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
                            "techHead": "นายสถิระ กาญจันดา",
                            "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
                            "academicDeputy": "นายสุวิชา มั่นยืน",
                            "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
                            "financeHead": "นางมลีทอง จารุพงษ์",
                            "financeHeadRole": "หัวหน้าการเงิน",
                            "resourceDeputy": "นางสาวสายฝน สาระผล",
                            "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
                            "director": "นายธาตรี พิบูลมณฑา",
                            "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี",
                            "teacher": "นายณัฐวรรธน์ เกษกุล"
                        },
                        "theoryHours": 2,
                        "practiceHours": 2,
                        "studentCount": 5
                    },
                    "name": "การวิเคราะห์ออกแบบอาคารด้วยโปรแกรม",
                    "code": "27-40121-2102",
                    "credits": 3
                },
                {
                    "id": "_77nhru9un",
                    "subjectId": "s_21",
                    "teacherId": "t_164",
                    "level": "ชั้นปี 1",
                    "time": "17.00-21.00",
                    "studentCount": 5,
                    "hours": 60,
                    "rate": 20,
                    "claimData": {
                        "level": "ชั้นปี 1",
                        "academicYear": "3/2568",
                        "curriculum": "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
                        "department": "เทคโนโลยีโยธา",
                        "teacherName": "นายณัฐวรรธน์ เกษกุล",
                        "teacherRole": "อาจารย์ผู้สอน",
                        "subjectCode": "27-40121-2401",
                        "subjectName": "โครงงานพัฒนาทักษะวิชาชีพ 1",
                        "weeklyHours": 4,
                        "credits": 3,
                        "timeStr": "17.00-21.00",
                        "rate": 20,
                        "percent": 60,
                        "startDate": "2026-03-13",
                        "endDateThai": "9 เดือน พฤษภาคม พ.ศ. 2569",
                        "teachingDaysPerWeek": 2,
                        "totalWeeks": 9,
                        "teachingDays": [
                            {
                                "dow": "5",
                                "time": "17.00-21.00",
                                "hours": 4
                            },
                            {
                                "dow": "6",
                                "time": "08.00-12.00",
                                "hours": 4
                            }
                        ],
                        "day1DOW": "5",
                        "day1Time": "17.00-21.00",
                        "day1Hours": 4,
                        "day2DOW": "6",
                        "day2Time": "08.00-12.00",
                        "day2Hours": 4,
                        "summerTableLayout": "sequential",
                        "weeks": [
                            {
                                "weekNo": 1,
                                "dayNo": 1,
                                "sessionNo": 1,
                                "dateStr": "13 มี.ค. 69",
                                "isoDate": "2026-03-13",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 1,
                                "dayNo": 2,
                                "sessionNo": 2,
                                "dateStr": "14 มี.ค. 69",
                                "isoDate": "2026-03-14",
                                "timeStr": "08.00-12.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 1,
                                "sessionNo": 3,
                                "dateStr": "20 มี.ค. 69",
                                "isoDate": "2026-03-20",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "ไปราชการ"
                            },
                            {
                                "weekNo": 2,
                                "dayNo": 2,
                                "sessionNo": 4,
                                "dateStr": "21 มี.ค. 69",
                                "isoDate": "2026-03-21",
                                "timeStr": "08.00-12.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "ไปราชการ"
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 1,
                                "sessionNo": 5,
                                "dateStr": "27 มี.ค. 69",
                                "isoDate": "2026-03-27",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 3,
                                "dayNo": 2,
                                "sessionNo": 6,
                                "dateStr": "28 มี.ค. 69",
                                "isoDate": "2026-03-28",
                                "timeStr": "08.00-12.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 1,
                                "sessionNo": 7,
                                "dateStr": "3 เม.ย. 69",
                                "isoDate": "2026-04-03",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 4,
                                "dayNo": 2,
                                "sessionNo": 8,
                                "dateStr": "4 เม.ย. 69",
                                "isoDate": "2026-04-04",
                                "timeStr": "08.00-12.00",
                                "theoryHrs": 0,
                                "practiceHrs": 0,
                                "totalHrs": 0,
                                "isHoliday": true,
                                "holidayReason": "ไปราชการ"
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 1,
                                "sessionNo": 9,
                                "dateStr": "10 เม.ย. 69",
                                "isoDate": "2026-04-10",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 5,
                                "dayNo": 2,
                                "sessionNo": 10,
                                "dateStr": "11 เม.ย. 69",
                                "isoDate": "2026-04-11",
                                "timeStr": "08.00-12.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 1,
                                "sessionNo": 11,
                                "dateStr": "17 เม.ย. 69",
                                "isoDate": "2026-04-17",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 6,
                                "dayNo": 2,
                                "sessionNo": 12,
                                "dateStr": "18 เม.ย. 69",
                                "isoDate": "2026-04-18",
                                "timeStr": "08.00-12.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 1,
                                "sessionNo": 13,
                                "dateStr": "24 เม.ย. 69",
                                "isoDate": "2026-04-24",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 7,
                                "dayNo": 2,
                                "sessionNo": 14,
                                "dateStr": "25 เม.ย. 69",
                                "isoDate": "2026-04-25",
                                "timeStr": "08.00-12.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 1,
                                "sessionNo": 15,
                                "dateStr": "1 พ.ค. 69",
                                "isoDate": "2026-05-01",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 8,
                                "dayNo": 2,
                                "sessionNo": 16,
                                "dateStr": "2 พ.ค. 69",
                                "isoDate": "2026-05-02",
                                "timeStr": "08.00-12.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 1,
                                "sessionNo": 17,
                                "dateStr": "8 พ.ค. 69",
                                "isoDate": "2026-05-08",
                                "timeStr": "17.00-21.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            },
                            {
                                "weekNo": 9,
                                "dayNo": 2,
                                "sessionNo": 18,
                                "dateStr": "9 พ.ค. 69",
                                "isoDate": "2026-05-09",
                                "timeStr": "08.00-12.00",
                                "theoryHrs": 2,
                                "practiceHrs": 2,
                                "totalHrs": 4,
                                "isHoliday": false,
                                "holidayReason": ""
                            }
                        ],
                        "students": [
                            {
                                "studentId": "68401211001",
                                "name": "นายวัชรายุทธ",
                                "surname": "นิพระขัน"
                            },
                            {
                                "studentId": "68401211002",
                                "name": "นางสาวกัญญาวีร์",
                                "surname": "ศรีอักษร"
                            },
                            {
                                "studentId": "68401211003",
                                "name": "นางสาวษาวิณีย์",
                                "surname": "วันดี"
                            },
                            {
                                "studentId": "68401211004",
                                "name": "นายบัณฑิต",
                                "surname": "นาทัน"
                            },
                            {
                                "studentId": "68401211005",
                                "name": "นางสาวนันทนา",
                                "surname": "สนธิไชย"
                            }
                        ],
                        "signatures": {
                            "teacherRole": "อาจารย์ผู้สอน",
                            "programChair": "นายณัฐวรรธน์ เกษกุล",
                            "programChairRole": "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
                            "curriculumHead": "นายชนะ สุทธิประภา",
                            "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
                            "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                            "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
                            "techHead": "นายสถิระ กาญจันดา",
                            "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
                            "academicDeputy": "นายสุวิชา มั่นยืน",
                            "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
                            "financeHead": "นางมลีทอง จารุพงษ์",
                            "financeHeadRole": "หัวหน้าการเงิน",
                            "resourceDeputy": "นางสาวสายฝน สาระผล",
                            "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
                            "director": "นายธาตรี พิบูลมณฑา",
                            "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี",
                            "teacher": "นายณัฐวรรธน์ เกษกุล"
                        },
                        "theoryHours": 2,
                        "practiceHours": 2,
                        "studentCount": 5
                    }
                }
            ],
            "excludedRateSubIds": [],
            "totalTeachingHours": 166,
            "budget": 4350,
            "hourlyRate": 26,
            "summaryClaimData": {
                "selectedSubjectIds": [
                    "_zj9tzz1pu",
                    "_c4vai0lco",
                    "_77nhru9un"
                ],
                "deptHeader": "สาขาวิชาโยธา  วิทยาลัยเทคนิคอุบลราชธานี",
                "docNo": "",
                "docDate": "",
                "docSubject": "ขอเบิกค่าสอนระดับปริญญาตรี",
                "recipient": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี",
                "requesterName": "นายณัฐวรรธน์ เกษกุล",
                "requesterRole": "อาจารย์",
                "department": "เทคโนโลยีโยธา",
                "classLevel": "1",
                "termYearStr": "3/2568",
                "percent": "60",
                "startDateStr": "9 เดือน มีนาคม พ.ศ. 2569",
                "endDateStr": "9 เดือน พฤษภาคม พ.ศ. 2569",
                "signatures": {
                    "requester": "นายณัฐวรรธน์ เกษกุล",
                    "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
                    "verifier": "นายชนะ   สุทธิประภา",
                    "verifierRole": "",
                    "academicDeputy": "นายสุวิชา  มั่นยืน",
                    "resourceDeputy": "นางสาวสายฝน  สาระผล",
                    "director": "นายธาตรี  พิบูลมณฑา"
                }
            },
            "teacherLeaves": [
                {
                    "id": "leave_1788767602138_f1b2b",
                    "teacherName": "นายณัฐวรรธน์ เกษกุล",
                    "type": "ไปราชการ",
                    "startDate": "2026-03-19",
                    "endDate": "2026-03-21",
                    "startDateThai": "19/03/2569",
                    "endDateThai": "21/03/2569",
                    "note": ""
                },
                {
                    "id": "leave_1788767622648_nrm9d",
                    "teacherName": "นายณัฐวรรธน์ เกษกุล",
                    "type": "ไปราชการ",
                    "startDate": "2026-04-04",
                    "endDate": "2026-04-06",
                    "startDateThai": "04/04/2569",
                    "endDateThai": "06/04/2569",
                    "note": ""
                }
            ]
        }
    ],
    "defaultSignatures2To9": {
        "programChair": "นายณัฐวรรธน์ เกษกุล",
        "programChairRole": "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
        "curriculumHead": "นายชนะ สุทธิประภา",
        "curriculumHeadRole": "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
        "deptHead": "นายปริวัฒน์ ยืนยิ่ง",
        "deptHeadRole": "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
        "techHead": "นายสถิระ กาญจันดา",
        "techHeadRole": "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
        "academicDeputy": "นายสุวิชา มั่นยืน",
        "academicDeputyRole": "รองผู้อำนวยการฝ่ายวิชาการ",
        "financeHead": "นางมลีทอง จารุพงษ์",
        "financeHeadRole": "หัวหน้าการเงิน",
        "resourceDeputy": "นางสาวสายฝน สาระผล",
        "resourceDeputyRole": "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
        "director": "นายธาตรี พิบูลมณฑา",
        "directorRole": "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี"
    }
};

// Multi-User Authentication & Storage State
let currentUser = null; // { username, name, role, ... }

function getUserStorageKey(username) {
    if (!username || username === 'civilutc') return 'teachingFeeData';
    return `teachingFeeData_${username}`;
}

function getLocalUsers() {
    try {
        const raw = localStorage.getItem('teaching_fee_local_users');
        if (raw) {
            const list = JSON.parse(raw);
            if (Array.isArray(list) && list.length > 0) return list;
        }
    } catch (e) {}
    const defaults = [
        { username: 'civilutc', password: 'civilutc12345', name: 'แผนกวิชาช่างโยธา', role: 'user', createdAt: '2025-01-01T00:00:00.000Z' },
        { username: 'admin', password: '12345', name: 'ผู้ดูแลระบบ (Admin)', role: 'admin', createdAt: '2025-01-01T00:00:00.000Z' }
    ];
    localStorage.setItem('teaching_fee_local_users', JSON.stringify(defaults));
    return defaults;
}

function saveLocalUsers(users) {
    localStorage.setItem('teaching_fee_local_users', JSON.stringify(users));
}

function getCurrentUser() {
    try {
        const sessionUser = sessionStorage.getItem('teaching_fee_current_user');
        if (sessionUser) return JSON.parse(sessionUser);
    } catch (e) {}
    return null;
}

function setCurrentUser(user) {
    currentUser = user;
    if (user) {
        sessionStorage.setItem('teaching_fee_current_user', JSON.stringify(user));
    } else {
        sessionStorage.removeItem('teaching_fee_current_user');
    }
    // Always clear legacy localStorage persistent remember keys so every new open requires login
    localStorage.removeItem('teaching_fee_remembered_user');
}

function createEmptyUserData(username, name = '') {
    const teachersList = (typeof DEFAULT_DATA !== 'undefined' && DEFAULT_DATA.teachers) 
        ? DEFAULT_DATA.teachers 
        : ((typeof EXTRACTED_DATA !== 'undefined' && EXTRACTED_DATA.teachers) ? EXTRACTED_DATA.teachers : []);

    return {
        teachers: JSON.parse(JSON.stringify(teachersList)),
        subjects_master: [],
        students: [],
        terms: [],
        departmentName: name || username || '',
        lastModified: new Date().toISOString()
    };
}

window.DEFAULT_DATA = DEFAULT_DATA;
let appData = null;
window.appData = null;

function loadUserData(username) {
    const key = getUserStorageKey(username);
    let loaded = null;
    try {
        const raw = localStorage.getItem(key);
        if (raw) loaded = JSON.parse(raw);
    } catch (e) {
        console.warn('Failed to parse local user data for', username, e);
    }

    if (!loaded || ((!username || username === 'civilutc') && (!loaded.terms || loaded.terms.length === 0))) {
        if (!username || username === 'civilutc') {
            loaded = JSON.parse(JSON.stringify(DEFAULT_DATA));
            localStorage.setItem(key, JSON.stringify(loaded));
            localStorage.setItem('teachingFeeData', JSON.stringify(loaded));
        } else {
            loaded = createEmptyUserData(username, currentUser ? currentUser.name : '');
            localStorage.setItem(key, JSON.stringify(loaded));
        }
    } else {
        // Sanitize
        if (!loaded.teachers || loaded.teachers.length === 0) {
            const defTeachers = (typeof DEFAULT_DATA !== 'undefined' && DEFAULT_DATA.teachers) || [];
            loaded.teachers = JSON.parse(JSON.stringify(defTeachers));
        }
        if (!loaded.terms) loaded.terms = [];
        if (!loaded.subjects_master) loaded.subjects_master = [];
        if (!loaded.students) loaded.students = [];

        // For civilutc, sanitize stale or empty summaryClaimData
        if (!username || username === 'civilutc') {
            let needSave = false;
            loaded.terms.forEach(t => {
                if (!t.summaryClaimData) {
                    t.summaryClaimData = {};
                    needSave = true;
                }
                const sc = t.summaryClaimData;
                const isStale = !sc.startDateStr || sc.startDateStr.includes('2 มิถุนายน') || sc.startDateStr.includes('มิถุนายน 2568');
                if (isStale) {
                    const defTerm = (DEFAULT_DATA.terms || []).find(dt => dt.id === t.id);
                    if (defTerm && defTerm.summaryClaimData && defTerm.summaryClaimData.startDateStr) {
                        sc.startDateStr = defTerm.summaryClaimData.startDateStr;
                        sc.endDateStr = defTerm.summaryClaimData.endDateStr;
                        sc.termYearStr = defTerm.summaryClaimData.termYearStr || `${t.no}/${t.year}`;
                        needSave = true;
                    }
                }
                if (!sc.termYearStr || !sc.termYearStr.includes(String(t.no))) {
                    sc.termYearStr = `${t.no}/${t.year}`;
                    needSave = true;
                }
            });
            if (needSave) {
                localStorage.setItem(key, JSON.stringify(loaded));
                localStorage.setItem('teachingFeeData', JSON.stringify(loaded));
            }
        }
    }

    appData = loaded;
    window.appData = appData;
    window.currentUser = currentUser;
    return appData;
}

// Pre-initialize appData for fallback safety
const initialSessionUser = getCurrentUser();
if (initialSessionUser) {
    currentUser = initialSessionUser;
    loadUserData(currentUser.username);
} else {
    // Default preview/fallback loads civilutc data
    loadUserData('civilutc');
}

let currentView = 'semesters'; // 'semesters' | 'subjects' | 'login'
let currentTermId = null;

// Helpers
const generateId = () => '_' + Math.random().toString(36).substr(2, 9);
const saveData = () => {
    if (!appData) return;
    const u = currentUser ? currentUser.username : 'civilutc';
    const key = getUserStorageKey(u);
    appData.lastModified = new Date().toISOString();
    localStorage.setItem(key, JSON.stringify(appData));
    if (u === 'civilutc') {
        localStorage.setItem('teachingFeeData', JSON.stringify(appData));
    }
    if (typeof triggerAutoCloudSync === 'function') triggerAutoCloudSync();
};

const formatMoney = (amount) => {
    if (amount === undefined || amount === null || isNaN(amount)) return '0.00';
    return Number(amount).toLocaleString('en-US', { minimumFractionDigits: 2, maximumFractionDigits: 2 });
};

// Sync and Merge extracted data from data.js
function syncAllExtractedData(forceOverwrite = false) {
    if (typeof EXTRACTED_DATA === 'undefined' || !appData) return;

    const isCivil = !currentUser || currentUser.username === 'civilutc';

    if (forceOverwrite && isCivil) {
        appData.teachers = JSON.parse(JSON.stringify(EXTRACTED_DATA.teachers || []));
        appData.subjects_master = JSON.parse(JSON.stringify(EXTRACTED_DATA.subjects || []));
    } else {
        // Teachers list: initialize only if completely empty
        if (!appData.teachers) appData.teachers = [];
        if (appData.teachers.length === 0 && EXTRACTED_DATA.teachers) {
            appData.teachers = JSON.parse(JSON.stringify(EXTRACTED_DATA.teachers));
        }

        // Subjects master: initialize only if completely empty on civil account initial setup
        if (isCivil) {
            if (!appData.subjects_master) {
                appData.subjects_master = JSON.parse(JSON.stringify(EXTRACTED_DATA.subjects || []));
            }
            // DO NOT re-add deleted subjects or overwrite user credits!
        }
    }

    saveData();
    updateTabCounts();
}

function updateTabCounts() {
    const elT = document.getElementById('count-teachers');
    const elS = document.getElementById('count-subjects');
    const elSt = document.getElementById('count-students');
    if (elT) elT.textContent = appData.teachers.length;
    if (elS) elS.textContent = appData.subjects_master.length;
    if (elSt) elSt.textContent = appData.students.length;
}

// Update Navigation & User Container UI
function updateUserNavUI() {
    const navUserContainer = document.getElementById('nav-user-container');
    const navUsernameText = document.getElementById('nav-username-text');
    const btnAdminNav = document.getElementById('btn-admin-nav');
    
    if (currentUser) {
        if (navUserContainer) navUserContainer.classList.remove('hidden');
        if (navUsernameText) {
            const displayName = currentUser.name ? `${currentUser.username} (${currentUser.name})` : currentUser.username;
            navUsernameText.textContent = displayName;
        }
        if (btnAdminNav) {
            if (currentUser.role === 'admin') {
                btnAdminNav.classList.remove('hidden');
            } else {
                btnAdminNav.classList.add('hidden');
            }
        }
    } else {
        if (navUserContainer) navUserContainer.classList.add('hidden');
        if (btnAdminNav) btnAdminNav.classList.add('hidden');
    }
}

function checkAuthSession() {
    const user = getCurrentUser();
    if (user) {
        currentUser = user;
        loadUserData(currentUser.username);
        updateUserNavUI();
        syncAllExtractedData(false);
        switchView('semesters');
        if (typeof initCloudSync === 'function') {
            initCloudSync();
        }
    } else {
        currentUser = null;
        updateUserNavUI();
        switchView('login');
    }
}

// Initialization
document.addEventListener('DOMContentLoaded', () => {
    function runStep(name, fn) {
        try {
            fn();
        } catch (err) {
            console.error('ERROR in ' + name + ':', err);
            var pre = document.createElement('pre');
            pre.className = 'CRASH_LOG';
            pre.textContent = 'CRASH IN ' + name + ': ' + err.message + '\n' + (err.stack || '');
            document.body ? document.body.appendChild(pre) : document.documentElement.appendChild(pre);
        }
    }

    runStep('initAuthSystem', () => initAuthSystem());
    runStep('initModals', () => initModals());
    runStep('initTabs', () => initTabs());
    runStep('initSettingsCRUD', () => initSettingsCRUD());
    runStep('initTermSubjectAutocomplete', () => initTermSubjectAutocomplete());
    runStep('initEditSubjectModalLogic', () => initEditSubjectModalLogic());
    runStep('initPermanentDarkMode', () => initPermanentDarkMode());
    runStep('initDataImportSystem', () => initDataImportSystem());
    runStep('initSummaryClaimSystem', () => initSummaryClaimSystem());
    runStep('initBatchPrintSystem', () => initBatchPrintSystem());
    
    // View Switchers
    runStep('viewSwitchers', () => {
        const btnBack = document.getElementById('btn-back-semesters');
        if (btnBack) btnBack.addEventListener('click', () => switchView('semesters'));
        
        const btnAddTerm = document.getElementById('btn-confirm-add-term');
        if (btnAddTerm) btnAddTerm.addEventListener('click', handleAddTerm);
        
        const btnAddSub = document.getElementById('btn-add-subject');
        if (btnAddSub) btnAddSub.addEventListener('click', openAddSubjectModal);

        const btnConfSub = document.getElementById('btn-confirm-add-subject');
        if (btnConfSub) btnConfSub.addEventListener('click', handleAddSubject);
        
        const searchSubTerm = document.getElementById('search-subject-term');
        if (searchSubTerm) {
            searchSubTerm.addEventListener('input', renderSubjectsView);
        }
    });

    // Check Auth session
    runStep('checkAuthSession', () => checkAuthSession());
});

// View Navigation
let currentClaimSubjectId = null;

function switchView(viewName, termId = null, subjectId = null) {
    document.querySelectorAll('.view').forEach(el => {
        el.classList.remove('active');
        el.classList.add('hidden');
    });
    const target = document.getElementById(`view-${viewName}`);
    if (target) {
        target.classList.add('active');
        target.classList.remove('hidden');
    }
    currentView = viewName;

    const nav = document.querySelector('nav');
    const mainContainer = document.getElementById('main-app-container');
    const navUserContainer = document.getElementById('nav-user-container');
    const btnAdminNav = document.getElementById('btn-admin-nav');
    const btnCloudSync = document.getElementById('btn-cloud-sync');
    const btnBatchPrint = document.getElementById('btn-batch-print');
    const btnSettings = document.getElementById('btn-settings');
    
    if (viewName === 'login') {
        if (nav) nav.classList.remove('hidden');
        if (mainContainer) {
            mainContainer.className = 'container mx-auto px-4 min-h-[85vh] flex items-center justify-center';
        }
        if (navUserContainer) navUserContainer.classList.add('hidden');
        if (btnAdminNav) btnAdminNav.classList.remove('hidden');
        if (btnCloudSync) btnCloudSync.classList.add('hidden');
        if (btnBatchPrint) btnBatchPrint.classList.add('hidden');
        if (btnSettings) btnSettings.classList.add('hidden');
        return;
    }

    // When logged in (not in login view), show user nav items
    if (navUserContainer && currentUser) navUserContainer.classList.remove('hidden');
    if (btnCloudSync) btnCloudSync.classList.remove('hidden');
    if (btnBatchPrint) btnBatchPrint.classList.remove('hidden');
    if (btnSettings) btnSettings.classList.remove('hidden');
    if (btnAdminNav) btnAdminNav.classList.remove('hidden');
    
    if (viewName === 'semesters') {
        if (nav) nav.classList.remove('hidden');
        if (mainContainer) {
            mainContainer.className = 'container mx-auto px-4 py-8 max-w-6xl flex-1';
        }
        renderSemestersView();
        updateGlobalStats();
    } else if (viewName === 'subjects') {
        if (nav) nav.classList.remove('hidden');
        if (mainContainer) {
            mainContainer.className = 'container mx-auto px-4 py-8 max-w-6xl flex-1';
        }
        currentTermId = termId;
        renderSubjectsView();
    } else if (viewName === 'claim-form') {
        if (nav) nav.classList.add('hidden');
        if (mainContainer) {
            mainContainer.className = 'w-full p-0 m-0 max-w-none flex-1';
        }
        currentTermId = termId;
        currentClaimSubjectId = subjectId;
        loadAndRenderClaimForm(termId, subjectId);
    }
}

// Global Stats
function updateGlobalStats() {
    try {
        const terms = (appData && Array.isArray(appData.terms)) ? appData.terms : [];
        const elTerms = document.getElementById('stat-total-terms');
        if (elTerms) elTerms.textContent = terms.length;
        
        let totalSubs = 0;
        let totalMoney = 0;
        terms.forEach(term => {
            const subs = Array.isArray(term.subjects) ? term.subjects : [];
            totalSubs += subs.length;
            subs.forEach(sub => {
                const effH = typeof getSubjectEffectiveHours === 'function' ? getSubjectEffectiveHours(sub) : (parseFloat(sub.hours) || 0);
                const r = parseFloat(sub.rate) || parseFloat(term.hourlyRate) || 42;
                totalMoney += (effH * r);
            });
        });
        const elSubs = document.getElementById('stat-total-subjects');
        const elMoney = document.getElementById('stat-total-money');
        if (elSubs) elSubs.textContent = totalSubs;
        if (elMoney) elMoney.textContent = formatMoney(totalMoney);
    } catch (e) {
        console.warn('Error updating global stats:', e);
    }
}

// ----------------------------------------------------
// ANNUAL CLAIM DAYS STATS & CHART
// ----------------------------------------------------
let annualDaysChartInstance = null;
let annualChartViewMode = 'term'; // 'term' | 'year' (default to 'term' for detail!)

function getTermClaimStats() {
    const termStats = (appData.terms || []).map(term => {
        const rate = term.hourlyRate || 42;
        let totalHours = 0;
        let totalMoney = 0;

        (term.subjects || []).forEach(sub => {
            const subRate = sub.rate || rate;
            const effHrs = getSubjectEffectiveHours(sub);
            totalHours += effHrs;
            totalMoney += (effHrs * subRate);
        });

        return {
            id: term.id,
            no: String(term.no || '1').trim(),
            year: String(term.year || '2568').trim(),
            label: `ภาคเรียนที่ ${term.no}/${term.year}`,
            shortLabel: `${term.no}/${term.year}`,
            totalHours: totalHours,
            totalMoney: totalMoney,
            subjectsCount: (term.subjects || []).length
        };
    });

    termStats.sort((a, b) => {
        const yDiff = parseInt(a.year) - parseInt(b.year);
        if (yDiff !== 0) return yDiff;
        return parseInt(a.no) - parseInt(b.no);
    });

    return termStats;
}

function getAnnualClaimDaysStats() {
    const yearStats = {};
    
    (appData.terms || []).forEach(term => {
        const y = String(term.year || '2568').trim();
        if (!yearStats[y]) {
            yearStats[y] = {
                year: y,
                totalHours: 0,
                totalMoney: 0,
                termsCount: 0,
                subjectsCount: 0
            };
        }
        yearStats[y].termsCount++;
        (term.subjects || []).forEach(sub => {
            yearStats[y].subjectsCount++;
            const rate = sub.rate || term.hourlyRate || 42;
            const effHrs = getSubjectEffectiveHours(sub);
            yearStats[y].totalHours += effHrs;
            yearStats[y].totalMoney += (effHrs * rate);
        });
    });

    const sortedYears = Object.keys(yearStats).sort((a, b) => parseInt(a) - parseInt(b));
    return sortedYears.map(y => ({
        year: y,
        totalHours: yearStats[y].totalHours,
        totalMoney: yearStats[y].totalMoney,
        termsCount: yearStats[y].termsCount,
        subjectsCount: yearStats[y].subjectsCount
    }));
}

function renderAnnualDaysChart() {
    const container = document.getElementById('annual-chart-container');
    const badgesContainer = document.getElementById('chart-annual-badges');
    const descText = document.getElementById('chart-desc-text');
    if (!container) return;

    const isTermMode = (annualChartViewMode === 'term');
    const termStats = getTermClaimStats();
    const annualStats = getAnnualClaimDaysStats();

    // 1. Toggle Buttons for View Mode (แยกรายเทอม vs รวมรายปี)
    const btnViewTerm = document.getElementById('btn-chart-view-term');
    const btnViewYear = document.getElementById('btn-chart-view-year');
    if (btnViewTerm && btnViewYear) {
        if (isTermMode) {
            btnViewTerm.className = 'px-2.5 py-1 rounded-md font-medium text-amber-300 bg-amber-950/60 border border-amber-500/40 transition cursor-pointer shadow-sm';
            btnViewYear.className = 'px-2.5 py-1 rounded-md font-medium text-gray-400 hover:text-white transition cursor-pointer';
        } else {
            btnViewYear.className = 'px-2.5 py-1 rounded-md font-medium text-purple-300 bg-purple-950/60 border border-purple-500/40 transition cursor-pointer shadow-sm';
            btnViewTerm.className = 'px-2.5 py-1 rounded-md font-medium text-gray-400 hover:text-white transition cursor-pointer';
        }
        btnViewTerm.onclick = () => { annualChartViewMode = 'term'; renderAnnualDaysChart(); };
        btnViewYear.onclick = () => { annualChartViewMode = 'year'; renderAnnualDaysChart(); };
    }

    // Update description text
    if (descText) {
        descText.textContent = isTermMode
            ? 'กราฟแท่งแสดงยอดเงินขอเบิกค่าตอบแทนแยกตามแต่ละภาคเรียน (แนวแกนนอน: เทอม/ปีการศึกษา / แนวแกนตั้ง: จำนวนเงิน บาท)'
            : 'กราฟแท่งแสดงยอดเงินขอเบิกค่าตอบแทนรวมรายปีการศึกษา (แนวแกนนอน: ปีการศึกษา / แนวแกนตั้ง: จำนวนเงิน บาท)';
    }

    // 2. Render Badges (Money Only)
    if (badgesContainer) {
        if (isTermMode) {
            if (termStats.length === 0 || termStats.every(s => s.subjectsCount === 0)) {
                badgesContainer.innerHTML = '<span class="text-xs text-gray-500">ยังไม่มีรายวิชาในระบบ</span>';
            } else {
                badgesContainer.innerHTML = termStats.map(t => {
                    let badgeClass = t.no === '2' ? 'bg-emerald-900/30 border-emerald-500/30 text-emerald-300' : 'bg-blue-900/30 border-blue-500/30 text-blue-300';
                    if (t.no === '3' || t.no.includes('ฤดูร้อน')) badgeClass = 'bg-amber-900/30 border-amber-500/30 text-amber-300';
                    return `
                        <div class="px-2.5 py-1 rounded-lg ${badgeClass} border text-xs flex items-center gap-1.5 shadow-sm">
                            <span class="font-bold text-white">เทอม ${t.shortLabel}:</span>
                            <span class="text-emerald-400 font-semibold">${formatMoney(t.totalMoney)} บาท</span>
                            <span class="text-gray-400 text-[11px]">(${t.subjectsCount} วิชา • ${t.totalHours} ชม.)</span>
                        </div>
                    `;
                }).join('');
            }
        } else {
            if (annualStats.length === 0 || annualStats.every(s => s.subjectsCount === 0)) {
                badgesContainer.innerHTML = '<span class="text-xs text-gray-500">ยังไม่มีรายวิชาในระบบ</span>';
            } else {
                badgesContainer.innerHTML = annualStats.map(s => `
                    <div class="px-2.5 py-1 rounded-lg bg-emerald-900/30 border-emerald-500/30 text-emerald-300 border text-xs flex items-center gap-1.5 shadow-sm">
                        <span class="font-bold text-white">ปี ${s.year}:</span>
                        <span class="text-emerald-400 font-semibold">${formatMoney(s.totalMoney)} บาท</span>
                        <span class="text-gray-400 text-[11px]">(${s.termsCount} เทอม • ${s.subjectsCount} วิชา)</span>
                    </div>
                `).join('');
            }
        }
    }

    // 3. Render Main Chart.js (Always Money)
    if (typeof Chart !== 'undefined') {
        let canvas = document.getElementById('canvas-annual-days');
        if (!canvas) {
            container.innerHTML = '<canvas id="canvas-annual-days"></canvas>';
            canvas = document.getElementById('canvas-annual-days');
        }

        if (annualDaysChartInstance) {
            annualDaysChartInstance.destroy();
            annualDaysChartInstance = null;
        }

        const ctx = canvas.getContext('2d');
        let labels = [];
        let chartData = [];
        let bgColors = [];
        let hoverBgColors = [];
        let borderColors = [];

        if (isTermMode) {
            labels = termStats.map(t => `เทอม ${t.shortLabel}`);
            chartData = termStats.map(t => t.totalMoney);
            
            bgColors = termStats.map(t => {
                if (t.no === '2') return 'rgba(16, 185, 129, 0.75)';
                if (t.no === '3' || t.no.includes('ฤดูร้อน')) return 'rgba(245, 158, 11, 0.75)';
                return 'rgba(59, 130, 246, 0.75)';
            });
            hoverBgColors = termStats.map(t => {
                if (t.no === '2') return 'rgba(52, 211, 153, 0.95)';
                if (t.no === '3' || t.no.includes('ฤดูร้อน')) return 'rgba(251, 191, 36, 0.95)';
                return 'rgba(96, 165, 250, 0.95)';
            });
            borderColors = termStats.map(t => {
                if (t.no === '2') return '#10b981';
                if (t.no === '3' || t.no.includes('ฤดูร้อน')) return '#f59e0b';
                return '#3b82f6';
            });
        } else {
            labels = annualStats.map(s => `ปีการศึกษา ${s.year}`);
            chartData = annualStats.map(s => s.totalMoney);
            bgColors = 'rgba(16, 185, 129, 0.75)';
            hoverBgColors = 'rgba(52, 211, 153, 0.95)';
            borderColors = '#10b981';
        }

        annualDaysChartInstance = new Chart(ctx, {
            type: 'bar',
            data: {
                labels: labels,
                datasets: [{
                    label: 'ยอดเงินขอเบิก (บาท)',
                    data: chartData,
                    backgroundColor: bgColors,
                    hoverBackgroundColor: hoverBgColors,
                    borderColor: borderColors,
                    borderWidth: 2,
                    borderRadius: 8,
                    maxBarThickness: 65
                }]
            },
            options: {
                responsive: true,
                maintainAspectRatio: false,
                plugins: {
                    legend: {
                        display: false
                    },
                    tooltip: {
                        backgroundColor: '#1c2134',
                        titleColor: '#fff',
                        bodyColor: '#6ee7b7',
                        borderColor: '#10b981',
                        borderWidth: 1,
                        padding: 12,
                        callbacks: {
                            label: function(context) {
                                if (isTermMode) {
                                    const t = termStats[context.dataIndex];
                                    return [
                                        `ภาคเรียนที่: ${t.no}/${t.year}`,
                                        `ยอดเงินขอเบิก: ${formatMoney(t.totalMoney)} บาท`,
                                        `จำนวนรายวิชา: ${t.subjectsCount} รายวิชา`,
                                        `จำนวนชั่วโมงสอน: ${t.totalHours} ชม.`
                                    ];
                                } else {
                                    const st = annualStats[context.dataIndex];
                                    return [
                                        `ปีการศึกษา: ${st.year}`,
                                        `ยอดเงินขอเบิก: ${formatMoney(st.totalMoney)} บาท`,
                                        `จำนวนภาคเรียน: ${st.termsCount} ภาคเรียน`,
                                        `จำนวนรายวิชา: ${st.subjectsCount} รายวิชา`,
                                        `จำนวนชั่วโมงสอน: ${st.totalHours} ชม.`
                                    ];
                                }
                            }
                        }
                    }
                },
                scales: {
                    x: {
                        title: {
                            display: true,
                            text: isTermMode ? 'ภาคเรียน (เทอม/ปีการศึกษา)' : 'ปีการศึกษา',
                            color: '#94a3b8',
                            font: { family: 'Sarabun', size: 12, weight: 'bold' }
                        },
                        grid: {
                            color: 'rgba(45, 55, 72, 0.4)'
                        },
                        ticks: {
                            color: '#cbd5e1',
                            font: { family: 'Sarabun', size: 12, weight: 'bold' }
                        }
                    },
                    y: {
                        beginAtZero: true,
                        title: {
                            display: true,
                            text: 'จำนวนเงิน (บาท)',
                            color: '#94a3b8',
                            font: { family: 'Sarabun', size: 12 }
                        },
                        grid: {
                            color: 'rgba(45, 55, 72, 0.5)'
                        },
                        ticks: {
                            color: '#94a3b8',
                            font: { family: 'Sarabun', size: 12 },
                            callback: function(value) { 
                                return value.toLocaleString('en-US') + ' บาท';
                            }
                        }
                    }
                }
            }
        });
    }
}


function renderSemestersView() {
    try {
        renderAnnualDaysChart();
    } catch (e) {
        console.warn('Error rendering annual chart:', e);
    }
    const grid = document.getElementById('semesters-grid');
    grid.innerHTML = '';
    
    appData.terms.forEach(term => {
        const totalSubs = term.subjects.length;
        const totalMoney = term.subjects.reduce((sum, sub) => sum + (sub.hours * sub.rate), 0);
        
        const card = document.createElement('div');
        card.className = 'bg-[#1c2134] border border-[#2d3748] rounded-xl overflow-hidden hover:border-blue-500/50 transition-colors shadow-lg';
        
        card.innerHTML = `
            <div class="p-5 border-b border-[#2d3748]">
                <div class="flex justify-between items-start mb-4">
                    <div class="flex items-center gap-3">
                        <div class="text-orange-400 bg-orange-500/10 p-2 rounded-lg"><i class="fa-solid fa-graduation-cap"></i></div>
                        <div>
                            <p class="text-xs text-gray-400">ประจำปีการศึกษา</p>
                            <div class="border border-blue-500/30 bg-blue-900/20 text-blue-300 text-xs px-2 py-1 rounded mt-1 inline-block">${term.year}</div>
                        </div>
                    </div>
                    <div class="text-right">
                        <h3 class="text-xl font-bold text-white">ภาคเรียนที่ <br> <span class="text-2xl">${term.no}/${term.year}</span></h3>
                    </div>
                </div>
                
                <div class="grid grid-cols-2 gap-4 bg-[#141725] p-3 rounded-lg mb-4">
                    <div>
                        <p class="text-xs text-gray-400">รายวิชาที่สอน</p>
                        <p class="font-bold text-white">${totalSubs} รายวิชา</p>
                    </div>
                    <div>
                        <p class="text-xs text-gray-400">ยอดเบิกรวมเทอมนี้</p>
                        <p class="font-bold text-[#10b981]">${formatMoney(totalMoney)} บาท</p>
                    </div>
                </div>
                
                <button class="btn-enter-term w-full bg-blue-600 hover:bg-blue-500 text-white py-2 rounded-lg flex items-center justify-center gap-2 text-sm transition shadow-lg shadow-blue-500/20">
                    <i class="fa-regular fa-folder-open"></i> เข้าสู่ภาคเรียนนี้ (จัดการรายวิชา)
                </button>
            </div>
            <div class="bg-[#242940] px-4 py-3 flex justify-between items-center gap-2">
                <button class="btn-summary-claim-term bg-orange-500 hover:bg-orange-400 text-gray-900 font-bold px-3 py-1.5 rounded-lg text-xs flex items-center gap-1.5 shadow transition cursor-pointer">
                    <i class="fa-solid fa-file-invoice"></i> ใบเบิกรวม (ตราครุฑ)
                </button>
                <div class="flex items-center gap-1.5">
                    <button class="btn-copy-term text-gray-400 hover:text-blue-400 transition p-1.5 px-2 bg-[#1c2134] hover:bg-blue-900/30 rounded border border-[#2d3748]" title="คัดลอกเทอมนี้ (+1 ปีการศึกษา)">
                        <i class="fa-regular fa-clone"></i>
                    </button>
                    <button class="btn-edit-term text-gray-400 hover:text-orange-400 transition p-1.5 px-2 bg-[#1c2134] hover:bg-orange-900/30 rounded border border-[#2d3748]" title="แก้ไขภาคเรียน / ปีการศึกษา">
                        <i class="fa-solid fa-pen-to-square"></i>
                    </button>
                    <button class="btn-delete-term text-gray-400 hover:text-red-400 transition p-1.5 px-2 bg-[#1c2134] hover:bg-red-900/30 rounded border border-[#2d3748]" title="ลบภาคเรียน">
                        <i class="fa-solid fa-trash-can"></i>
                    </button>
                </div>
            </div>
        `;
        
        card.querySelector('.btn-enter-term').addEventListener('click', () => switchView('subjects', term.id));
        card.querySelector('.btn-summary-claim-term').addEventListener('click', () => openSummaryClaimModal(term.id));
        card.querySelector('.btn-copy-term').addEventListener('click', () => handleCopyTerm(term));
        card.querySelector('.btn-edit-term').addEventListener('click', () => openTermModal(term));
        card.querySelector('.btn-delete-term').addEventListener('click', () => {
            if(confirm(`ต้องการลบภาคเรียนที่ ${term.no}/${term.year} หรือไม่?`)) {
                appData.terms = appData.terms.filter(t => t.id !== term.id);
                saveData();
                renderSemestersView();
                updateGlobalStats();
            }
        });
        grid.appendChild(card);
    });

    // Square Add Semester Card (วางข้างๆ ภาคเรียนที่มีอยู่ ขนาดเท่ากัน)
    const addCard = document.createElement('div');
    addCard.className = 'border-2 border-dashed border-[#2d3748] hover:border-orange-500/70 bg-[#1c2134]/30 hover:bg-[#1c2134]/70 transition-all rounded-xl p-6 flex flex-col items-center justify-center text-center cursor-pointer min-h-[260px] group shadow-lg';
    addCard.innerHTML = `
        <div class="w-16 h-16 rounded-full bg-orange-500/10 text-orange-400 border border-orange-500/30 flex items-center justify-center text-2xl mb-4 group-hover:scale-110 group-hover:bg-orange-500 group-hover:text-gray-900 transition-all shadow-lg shadow-orange-500/10">
            <i class="fa-solid fa-plus"></i>
        </div>
        <h3 class="text-lg font-bold text-white group-hover:text-orange-400 transition-colors">+ เพิ่มเทอมใหม่</h3>
        <p class="text-xs text-gray-400 mt-2">คลิกเพื่อเพิ่มภาคเรียนหรือปีการศึกษาใหม่</p>
    `;
    addCard.addEventListener('click', () => openTermModal(null));
    grid.appendChild(addCard);
}

let currentEditingTermId = null;

function openTermModal(term = null) {
    currentEditingTermId = term ? term.id : null;
    const title = document.getElementById('modal-term-title');
    const btnConfirm = document.getElementById('btn-confirm-add-term');
    
    if (term) {
        if (title) title.innerHTML = '<i class="fa-solid fa-pen-to-square mr-2 text-orange-400"></i> แก้ไขภาคเรียน / ปีการศึกษา';
        if (btnConfirm) btnConfirm.textContent = 'บันทึกการแก้ไข';
        document.getElementById('input-term-no').value = term.no;
        document.getElementById('input-term-year').value = term.year;
    } else {
        if (title) title.innerHTML = '<i class="fa-solid fa-folder-plus mr-2 text-orange-400"></i> เพิ่มภาคเรียนใหม่';
        if (btnConfirm) btnConfirm.textContent = 'บันทึกภาคเรียน';
        document.getElementById('input-term-no').value = '1';
        document.getElementById('input-term-year').value = new Date().getFullYear() + 543;
    }
    openModal('modal-add-term');
}

function handleAddTerm() {
    const no = document.getElementById('input-term-no').value;
    const year = document.getElementById('input-term-year').value;
    
    if(!year) return alert('กรุณากรอกปีการศึกษา');
    
    if (currentEditingTermId) {
        // Edit existing term
        const term = appData.terms.find(t => t.id === currentEditingTermId);
        if (term) {
            term.no = no;
            term.year = year;
        }
    } else {
        // Add new term
        appData.terms.push({
            id: generateId(),
            no,
            year,
            subjects: []
        });
    }
    
    saveData();
    renderSemestersView();
    updateGlobalStats();
    closeModal('modal-add-term');
}

// คัดลอกเทอม (+1 ปีการศึกษา พร้อมคัดลอกรายวิชาทั้งหมดในเทอม)
function handleCopyTerm(term) {
    const nextYear = (parseInt(term.year) || 2568) + 1;
    const confirmMsg = `ต้องการคัดลอกภาคเรียนที่ ${term.no}/${term.year} เป็นภาคเรียนที่ ${term.no}/${nextYear}\nพร้อมคัดลอกรายละเอียดรายวิชาทั้งหมด (${term.subjects.length} วิชา) ใช่หรือไม่?`;
    
    if (confirm(confirmMsg)) {
        const newTerm = {
            id: generateId(),
            no: term.no,
            year: nextYear.toString(),
            subjects: term.subjects.map(sub => ({
                ...sub,
                id: generateId()
            }))
        };
        appData.terms.push(newTerm);
        saveData();
        renderSemestersView();
        updateGlobalStats();
    }
}


// ----------------------------------------------------
// TERM HOURLY RATE CALCULATOR (คำนวณอัตราการเบิก บาท/ชม.)
// ----------------------------------------------------
function getSubjectTeachingDateRange(sub) {
    if (sub.claimData && Array.isArray(sub.claimData.weeks) && sub.claimData.weeks.length > 0) {
        const weeks = sub.claimData.weeks;
        const first = weeks[0]?.dateStr;
        const last = weeks[weeks.length - 1]?.dateStr;
        if (first && last) {
            return `${first} - ${last}`;
        }
    }
    if (sub.claimData && sub.claimData.startDate) {
        const s = typeof formatThaiBEDate === 'function' ? formatThaiBEDate(sub.claimData.startDate) : sub.claimData.startDate;
        const e = sub.claimData.endDateThai ? sub.claimData.endDateThai.replace(/พ\.ศ\.\s*/, '').trim() : '';
        if (s && e) return `${s} - ${e}`;
    }
    return '2 มิ.ย. 68 - 29 ก.ย. 68';
}

function getSubjectEffectiveHours(sub) {
    if (sub.claimData) {
        if (sub.claimData.customTotalHours !== undefined && sub.claimData.customTotalHours !== null && sub.claimData.customTotalHours !== '') {
            const val = parseFloat(sub.claimData.customTotalHours);
            if (!isNaN(val)) return val;
        }
        if (sub.claimData.weeks && sub.claimData.weeks.length > 0) {
            const sum = sub.claimData.weeks.reduce((acc, w) => acc + (w.isHoliday ? 0 : (parseFloat(w.totalHrs) || 0)), 0);
            if (sum > 0) return sum;
        }
    }
    return parseFloat(sub.hours) || 0;
}

function isSubjectIncludedInRateCalc(term, sub) {
    if (!term || !sub) return true;
    if (sub.includeInRateCalc === false) return false;
    if (term.excludedRateSubIds && Array.isArray(term.excludedRateSubIds) && term.excludedRateSubIds.includes(sub.id)) {
        return false;
    }
    return true;
}

function calculateTermTotalHours(term) {
    if (!term || !term.subjects) return 0;
    return term.subjects
        .filter(s => isSubjectIncludedInRateCalc(term, s))
        .reduce((sum, s) => sum + getSubjectEffectiveHours(s), 0);
}

function initTermRateCalculator(term) {
    const budgetInput = document.getElementById('term-calc-budget');
    const hoursInput = document.getElementById('term-calc-hours');
    const rateInput = document.getElementById('term-calc-rate');
    const hoursDesc = document.getElementById('term-calc-hours-desc');
    const formulaDisplay = document.getElementById('term-calc-formula-display');
    const btnApplyAll = document.getElementById('btn-apply-rate-to-all');
    const btnSyncHours = document.getElementById('btn-sync-term-hours');
    const autoSaved = document.getElementById('term-calc-auto-saved');

    if (!budgetInput || !hoursInput || !rateInput) return;

    if (!Array.isArray(term.excludedRateSubIds)) {
        term.excludedRateSubIds = [];
    }

    // คำนวณชั่วโมงสอนรวมอัตโนมัติจากวิชาที่ถูกเลือกในเทอม
    const autoHours = calculateTermTotalHours(term);
    term.totalTeachingHours = autoHours;

    budgetInput.value = (term.budget !== undefined && term.budget !== null && term.budget > 0) ? term.budget : '';
    hoursInput.value = autoHours > 0 ? autoHours : '';

    const panelSelector = document.getElementById('container-calc-subjects-selector');
    const checkboxList = document.getElementById('calc-subjects-checkbox-list');
    const btnToggleSelector = document.getElementById('btn-toggle-calc-subjects');
    const btnCloseSelector = document.getElementById('btn-close-calc-subjects');
    const btnSelectAll = document.getElementById('btn-calc-select-all');
    const btnDeselectAll = document.getElementById('btn-calc-deselect-all');
    const countBadge = document.getElementById('calc-selected-count');

    function updateSelectorUI() {
        const subs = term.subjects || [];
        const includedSubs = subs.filter(s => isSubjectIncludedInRateCalc(term, s));
        if (countBadge) {
            countBadge.textContent = `${includedSubs.length}/${subs.length} วิชา`;
        }
        if (hoursDesc) {
            hoursDesc.textContent = `ดึงจาก ${includedSubs.length} จาก ${subs.length} วิชา (รวม ${term.totalTeachingHours || 0} ชม.)`;
        }

        if (checkboxList) {
            checkboxList.innerHTML = '';
            if (subs.length === 0) {
                checkboxList.innerHTML = '<div class="p-3 text-center text-xs text-gray-500 col-span-full">ยังไม่มีรายวิชาในภาคเรียนนี้</div>';
                return;
            }

            subs.forEach(s => {
                const masterSub = appData.subjects_master.find(m => m.id === s.subjectId) || { code: '-', name: 'ไม่พบข้อมูลวิชา' };
                const effHrs = getSubjectEffectiveHours(s);
                const isChecked = isSubjectIncludedInRateCalc(term, s);

                const label = document.createElement('label');
                label.className = `flex items-center gap-2.5 p-2.5 rounded-lg border text-xs cursor-pointer transition select-none ${
                    isChecked 
                        ? 'bg-[#141725] border-blue-500/40 text-white shadow-sm' 
                        : 'bg-[#0f121d] border-[#2d3748] text-gray-500 opacity-60'
                }`;

                label.innerHTML = `
                    <input type="checkbox" class="chk-calc-sub accent-blue-500 rounded w-4 h-4 cursor-pointer" ${isChecked ? 'checked' : ''}>
                    <div class="flex-1 min-w-0">
                        <div class="flex items-center justify-between gap-1 mb-0.5">
                            <span class="font-mono text-[11px] ${isChecked ? 'text-blue-400 font-semibold' : 'text-gray-500'}"># ${masterSub.code}</span>
                            <span class="font-bold text-[11px] ${isChecked ? 'text-emerald-400' : 'text-gray-500'}">${effHrs} ชม.</span>
                        </div>
                        <p class="truncate text-xs ${isChecked ? 'text-gray-200 font-medium' : 'text-gray-500'}">${masterSub.name}</p>
                    </div>
                `;

                const chk = label.querySelector('.chk-calc-sub');
                chk.addEventListener('change', () => {
                    const checked = chk.checked;
                    s.includeInRateCalc = checked;
                    if (!term.excludedRateSubIds) term.excludedRateSubIds = [];
                    if (checked) {
                        term.excludedRateSubIds = term.excludedRateSubIds.filter(id => id !== s.id);
                    } else {
                        if (!term.excludedRateSubIds.includes(s.id)) {
                            term.excludedRateSubIds.push(s.id);
                        }
                    }
                    saveData();
                    const newAuto = calculateTermTotalHours(term);
                    hoursInput.value = newAuto;
                    term.totalTeachingHours = newAuto;
                    doRecalculate(false);
                    updateSelectorUI();

                    // Re-render subject cards without closing panel
                    const wasOpen = panelSelector && !panelSelector.classList.contains('hidden');
                    renderSubjectsView();
                    if (wasOpen && panelSelector) panelSelector.classList.remove('hidden');
                });

                checkboxList.appendChild(label);
            });
        }
    }

    if (btnToggleSelector && panelSelector) {
        btnToggleSelector.onclick = () => {
            panelSelector.classList.toggle('hidden');
        };
    }
    if (btnCloseSelector && panelSelector) {
        btnCloseSelector.onclick = () => {
            panelSelector.classList.add('hidden');
        };
    }
    if (btnSelectAll) {
        btnSelectAll.onclick = () => {
            term.excludedRateSubIds = [];
            (term.subjects || []).forEach(s => { s.includeInRateCalc = true; });
            saveData();
            const newAuto = calculateTermTotalHours(term);
            hoursInput.value = newAuto;
            term.totalTeachingHours = newAuto;
            doRecalculate(false);
            updateSelectorUI();
            const wasOpen = panelSelector && !panelSelector.classList.contains('hidden');
            renderSubjectsView();
            if (wasOpen && panelSelector) panelSelector.classList.remove('hidden');
        };
    }
    if (btnDeselectAll) {
        btnDeselectAll.onclick = () => {
            term.excludedRateSubIds = (term.subjects || []).map(s => s.id);
            (term.subjects || []).forEach(s => { s.includeInRateCalc = false; });
            saveData();
            const newAuto = calculateTermTotalHours(term);
            hoursInput.value = newAuto;
            term.totalTeachingHours = newAuto;
            doRecalculate(false);
            updateSelectorUI();
            const wasOpen = panelSelector && !panelSelector.classList.contains('hidden');
            renderSubjectsView();
            if (wasOpen && panelSelector) panelSelector.classList.remove('hidden');
        };
    }

    updateSelectorUI();

    // คำนวณอัตราเบิกอัตโนมัติ (งบอุดหนุน ÷ ชม. รวม)
    if (term.budget > 0 && autoHours > 0) {
        const calcRate = Math.floor(term.budget / autoHours);
        term.hourlyRate = calcRate;
        rateInput.value = calcRate;
        if (formulaDisplay) formulaDisplay.textContent = `${formatMoney(term.budget)} ÷ ${autoHours} ชม. = ${calcRate} บาท/ชม.`;
    } else if (term.hourlyRate) {
        rateInput.value = term.hourlyRate;
        if (term.budget && autoHours) {
            if (formulaDisplay) formulaDisplay.textContent = `${formatMoney(term.budget)} ÷ ${autoHours} ชม. = ${term.hourlyRate} บาท/ชม.`;
        }
    } else {
        rateInput.value = '';
        if (formulaDisplay) formulaDisplay.textContent = 'สูตร: งบอุดหนุน ÷ ชม. รวม (ตัดเศษทิ้ง)';
    }

    function doRecalculate(fromUserRate = false) {
        const b = parseFloat(budgetInput.value) || 0;
        const h = parseFloat(hoursInput.value) || 0;
        term.budget = b;
        term.totalTeachingHours = h;

        if (!fromUserRate) {
            if (b > 0 && h > 0) {
                // คำนวณโดยนำงบอุดหนุนหารจำนวน ชม. ที่อาจารย์สอนรวม ได้เป็นเท่าไหร่ตัดเศษทิ้ง (Math.floor)
                const calcRate = Math.floor(b / h);
                term.hourlyRate = calcRate;
                rateInput.value = calcRate;
                if (formulaDisplay) formulaDisplay.textContent = `${formatMoney(b)} ÷ ${h} ชม. = ${calcRate} บาท/ชม.`;
            } else {
                if (formulaDisplay) formulaDisplay.textContent = 'สูตร: งบอุดหนุน ÷ ชม. รวม (ตัดเศษทิ้ง)';
            }
        } else {
            term.hourlyRate = parseFloat(rateInput.value) || 0;
            if (formulaDisplay) formulaDisplay.textContent = `กำหนดอัตราเอง: ${term.hourlyRate} บาท/ชม.`;
        }

        saveData();

        // อัปเดตยอดเงินรวมของเทอม
        const defaultR = term.hourlyRate || 42;
        const totalMoney = term.subjects.reduce((sum, sub) => sum + (getSubjectEffectiveHours(sub) * (sub.rate || defaultR)), 0);
        const statMoney = document.getElementById('term-stat-money');
        if (statMoney) statMoney.textContent = formatMoney(totalMoney);

        if (autoSaved) {
            autoSaved.classList.remove('hidden');
            setTimeout(() => autoSaved.classList.add('hidden'), 1500);
        }
    }

    budgetInput.oninput = () => doRecalculate(false);
    hoursInput.oninput = () => doRecalculate(false);
    rateInput.oninput = () => doRecalculate(true);

    if (btnSyncHours) {
        btnSyncHours.onclick = () => {
            const reAutoHours = calculateTermTotalHours(term);
            hoursInput.value = reAutoHours;
            term.totalTeachingHours = reAutoHours;
            doRecalculate(false);
        };
    }

    if (btnApplyAll) {
        btnApplyAll.onclick = () => {
            const r = parseFloat(rateInput.value) || 0;
            if (r <= 0) {
                alert('กรุณากรอกงบอุดหนุนเพื่อคำนวณอัตราเบิกก่อน');
                return;
            }
            if (confirm(`ต้องการนำอัตรา ${r} บาท/ชม. ไปใช้กับทุกรายวิชาในภาคเรียนนี้ (${term.subjects.length} วิชา) หรือไม่?`)) {
                term.hourlyRate = r;
                term.subjects.forEach(sub => {
                    sub.rate = r;
                    if (sub.claimData) {
                        sub.claimData.rate = r;
                    }
                });
                saveData();
                renderSubjectsView();
            }
        };
    }
}

// ====================================================
// TEACHER LEAVES & OFFICIAL TRAVEL MANAGEMENT
// ====================================================

function normalizeTeacherName(name) {
    if (!name) return '';
    return name.replace(/^(นาย|นางสาว|นาง|ว่าที่\s*ร\.ต\.|ผศ\.|รศ\.|ดร\.|อาจารย์)\s*/i, '')
               .replace(/\s+/g, ' ')
               .trim()
               .toLowerCase();
}

function isTeacherMatching(teacherA, teacherB) {
    if (!teacherA || !teacherB) return false;
    const cleanA = teacherA.replace(/\s+/g, ' ').trim().toLowerCase();
    const cleanB = teacherB.replace(/\s+/g, ' ').trim().toLowerCase();
    if (cleanA === cleanB) return true;
    const normA = normalizeTeacherName(teacherA);
    const normB = normalizeTeacherName(teacherB);
    if (!normA || !normB) return false;
    return normA === normB || normA.includes(normB) || normB.includes(normA);
}

function getTeacherLeaveForSession(claim, isoDate, term = null) {
    if (!isoDate) return null;
    const targetTerm = term || (currentTermId ? appData.terms.find(t => t.id === currentTermId) : null);
    if (!targetTerm || !targetTerm.teacherLeaves || !Array.isArray(targetTerm.teacherLeaves)) return null;
    
    const tName = claim.teacherName || '';
    if (!tName) return null;

    return targetTerm.teacherLeaves.find(leave => {
        if (!isTeacherMatching(leave.teacherName, tName)) return false;
        return isoDate >= leave.startDate && isoDate <= leave.endDate;
    }) || null;
}

function getSessionIsoDate(w) {
    if (!w) return null;
    if (w.isoDate) return w.isoDate;
    if (w.dateStr) {
        const d = parseThaiDateShort(w.dateStr);
        if (d && !isNaN(d.getTime())) {
            const y = d.getFullYear();
            const m = String(d.getMonth() + 1).padStart(2, '0');
            const dt = String(d.getDate()).padStart(2, '0');
            const iso = `${y}-${m}-${dt}`;
            w.isoDate = iso;
            return iso;
        }
    }
    return null;
}

function getLeaveImpactSummary(term, leave) {
    if (!term || !term.subjects || term.subjects.length === 0) {
        return '<span class="text-gray-500">ไม่มีผลกระทบ</span>';
    }
    
    const impacts = [];
    term.subjects.forEach(sub => {
        const teacher = appData.teachers.find(t => t.id === sub.teacherId);
        const tName = sub.claimData?.teacherName || teacher?.name || '';
        if (!isTeacherMatching(leave.teacherName, tName)) return;

        const masterSub = appData.subjects_master.find(m => m.id === sub.subjectId) || { name: sub.name || 'รายวิชา' };
        
        let count = 0;
        const matchedDates = [];
        if (sub.claimData && sub.claimData.weeks) {
            sub.claimData.weeks.forEach(w => {
                const iso = getSessionIsoDate(w);
                if (iso && iso >= leave.startDate && iso <= leave.endDate) {
                    count++;
                    matchedDates.push(w.dateStr || formatThaiBEDate(iso));
                }
            });
        }
        if (count > 0) {
            impacts.push(`${masterSub.name} (${count} วัน: ${matchedDates.join(', ')})`);
        }
    });

    if (impacts.length === 0) {
        return '<span class="text-gray-500">ไม่มีวันสอนตรงกับช่วงนี้</span>';
    }
    return impacts.map(imp => `<span class="inline-block bg-amber-950/40 text-amber-300 border border-amber-500/30 px-2 py-0.5 rounded text-[11px] font-medium leading-tight my-0.5">${imp}</span>`).join('<br>');
}

function syncTermTeacherLeaves(term) {
    if (!term || !term.subjects) return;
    if (!term.teacherLeaves) term.teacherLeaves = [];
    const leaves = term.teacherLeaves;

    term.subjects.forEach(sub => {
        const teacher = appData.teachers.find(t => t.id === sub.teacherId);
        const tName = sub.claimData?.teacherName || teacher?.name || '';
        if (!tName) return;

        const matchingLeaves = leaves.filter(l => isTeacherMatching(l.teacherName, tName));

        if (!sub.claimData || !sub.claimData.weeks || sub.claimData.weeks.length === 0) {
            return;
        }

        sub.claimData.weeks.forEach((w, sIdx) => {
            const iso = getSessionIsoDate(w);
            let matchedLeave = null;
            if (iso && matchingLeaves.length > 0) {
                matchedLeave = matchingLeaves.find(l => iso >= l.startDate && iso <= l.endDate);
            }

            if (matchedLeave) {
                const leaveReason = matchedLeave.type || 'ไปราชการ';
                w.isHoliday = true;
                w.holidayReason = leaveReason;
                w.theoryHrs = 0;
                w.practiceHrs = 0;
                w.totalHrs = 0;
            } else if (w.isHoliday && (w.holidayReason === 'ไปราชการ' || w.holidayReason === 'ลากิจ' || w.holidayReason === 'ลาป่วย' || w.holidayReason === 'ลาพักผ่อน' || (w.holidayReason && w.holidayReason.startsWith('ลา')))) {
                // Was marked by a leave that was deleted or no longer covers this date
                let dateObj = null;
                if (w.isoDate) {
                    const p = w.isoDate.split('-');
                    if (p.length === 3) dateObj = new Date(parseInt(p[0]), parseInt(p[1]) - 1, parseInt(p[2]), 12, 0, 0);
                }
                const pubHoliday = dateObj ? getThaiHoliday(dateObj) : null;
                if (pubHoliday) {
                    w.isHoliday = true;
                    w.holidayReason = shortenHolidayName(pubHoliday.name);
                    w.theoryHrs = 0;
                    w.practiceHrs = 0;
                    w.totalHrs = 0;
                } else {
                    w.isHoliday = false;
                    w.holidayReason = '';
                    
                    const mSub = appData.subjects_master.find(m => m.id === sub.subjectId) || {};
                    const thHours = (sub.claimData.theoryHours !== undefined) ? sub.claimData.theoryHours : (mSub.theoryHours !== undefined ? mSub.theoryHours : 3);
                    const prHours = (sub.claimData.practiceHours !== undefined) ? sub.claimData.practiceHours : (mSub.practiceHours !== undefined ? mSub.practiceHours : 0);
                    const n = sub.claimData.teachingDaysPerWeek || 1;
                    const dayIdx = sIdx % n;
                    const dayConf = (sub.claimData.teachingDays && sub.claimData.teachingDays[dayIdx]) || {};
                    const dayHrs = parseInt(dayConf.hours) || parseInt(sub.claimData.weeklyHours) || (thHours + prHours) || 3;

                    if (n === 1) {
                        w.theoryHrs = thHours;
                        w.practiceHrs = prHours;
                        w.totalHrs = thHours + prHours;
                    } else {
                        w.totalHrs = dayHrs;
                        if (thHours + prHours === dayHrs) {
                            w.theoryHrs = thHours;
                            w.practiceHrs = prHours;
                        } else {
                            if (dayIdx === 0) {
                                w.theoryHrs = Math.min(dayHrs, thHours);
                                w.practiceHrs = dayHrs - w.theoryHrs;
                            } else {
                                w.practiceHrs = Math.min(dayHrs, prHours);
                                w.theoryHrs = dayHrs - w.practiceHrs;
                            }
                        }
                    }
                }
            }
        });

        sub.hours = getSubjectEffectiveHours(sub);
    });

    term.totalTeachingHours = calculateTermTotalHours(term);
    saveData();
}

let leaveCalMonth = 5;
let leaveCalYearBE = 2568;
let activeLeaveCalTarget = null;
let leaveCalendarInitialized = false;

function initLeaveCalendarPopup() {
    if (leaveCalendarInitialized) return;
    leaveCalendarInitialized = true;

    const popup = document.getElementById('leave-calendar-popup');
    const monthSelect = document.getElementById('leave-cal-month-select');
    const yearSelect = document.getElementById('leave-cal-year-select');
    const btnPrev = document.getElementById('leave-cal-prev-month');
    const btnNext = document.getElementById('leave-cal-next-month');
    const btnToday = document.getElementById('leave-cal-btn-today');

    if (!popup || !monthSelect || !yearSelect) return;

    monthSelect.innerHTML = THAI_MONTHS_FULL.map((m, idx) => `<option value="${idx}">${m}</option>`).join('');
    let yrOptions = '';
    for (let y = 2565; y <= 2575; y++) yrOptions += `<option value="${y}">${y}</option>`;
    yearSelect.innerHTML = yrOptions;

    monthSelect.addEventListener('change', () => {
        leaveCalMonth = parseInt(monthSelect.value);
        renderLeaveCalendarGrid();
    });

    yearSelect.addEventListener('change', () => {
        leaveCalYearBE = parseInt(yearSelect.value);
        renderLeaveCalendarGrid();
    });

    if (btnPrev) {
        btnPrev.addEventListener('click', (e) => {
            e.stopPropagation();
            leaveCalMonth--;
            if (leaveCalMonth < 0) {
                leaveCalMonth = 11;
                leaveCalYearBE--;
            }
            renderLeaveCalendarGrid();
        });
    }

    if (btnNext) {
        btnNext.addEventListener('click', (e) => {
            e.stopPropagation();
            leaveCalMonth++;
            if (leaveCalMonth > 11) {
                leaveCalMonth = 0;
                leaveCalYearBE++;
            }
            renderLeaveCalendarGrid();
        });
    }

    if (btnToday) {
        btnToday.addEventListener('click', (e) => {
            e.stopPropagation();
            const now = new Date();
            const todayIso = `${now.getFullYear()}-${String(now.getMonth()+1).padStart(2,'0')}-${String(now.getDate()).padStart(2,'0')}`;
            if (activeLeaveCalTarget) {
                activeLeaveCalTarget.thInput.value = formatThaiBEDate(todayIso);
                activeLeaveCalTarget.isoInput.value = todayIso;
                if (activeLeaveCalTarget.isStart) {
                    const endTh = document.getElementById('leave-input-end-date-th');
                    const endIso = document.getElementById('leave-input-end-date-iso');
                    if (endTh && !endTh.value) {
                        endTh.value = formatThaiBEDate(todayIso);
                        if (endIso) endIso.value = todayIso;
                    }
                }
            }
            popup.classList.add('hidden');
        });
    }

    document.addEventListener('click', (e) => {
        const btnStart = document.getElementById('btn-leave-start-cal');
        const btnEnd = document.getElementById('btn-leave-end-cal');
        if (popup && !popup.contains(e.target) && e.target !== btnStart && !btnStart?.contains(e.target) && e.target !== btnEnd && !btnEnd?.contains(e.target)) {
            popup.classList.add('hidden');
        }
    });
}

function renderLeaveCalendarGrid() {
    const popup = document.getElementById('leave-calendar-popup');
    const monthSelect = document.getElementById('leave-cal-month-select');
    const yearSelect = document.getElementById('leave-cal-year-select');
    const daysGrid = document.getElementById('leave-cal-days-grid');
    const holidayDetail = document.getElementById('leave-cal-holiday-detail');
    if (!daysGrid) return;

    daysGrid.innerHTML = '';
    const yearCE = leaveCalYearBE - 543;
    const firstDay = new Date(yearCE, leaveCalMonth, 1).getDay();
    const daysInMonth = new Date(yearCE, leaveCalMonth + 1, 0).getDate();

    if (monthSelect) monthSelect.value = leaveCalMonth;
    if (yearSelect) yearSelect.value = leaveCalYearBE;
    if (holidayDetail) holidayDetail.textContent = '';

    const currentIso = activeLeaveCalTarget?.isoInput ? activeLeaveCalTarget.isoInput.value : '';
    const now = new Date();
    const todayIso = `${now.getFullYear()}-${String(now.getMonth()+1).padStart(2,'0')}-${String(now.getDate()).padStart(2,'0')}`;

    for (let i = 0; i < firstDay; i++) {
        const blank = document.createElement('div');
        blank.className = 'h-8';
        daysGrid.appendChild(blank);
    }

    for (let day = 1; day <= daysInMonth; day++) {
        const dateCE = new Date(yearCE, leaveCalMonth, day);
        const dateIso = `${yearCE}-${String(leaveCalMonth + 1).padStart(2, '0')}-${String(day).padStart(2, '0')}`;
        const holiday = getThaiHoliday(dateCE);
        const isSelected = dateIso === currentIso;
        const isToday = dateIso === todayIso;

        const btn = document.createElement('button');
        btn.type = 'button';
        btn.className = `cal-day-btn text-xs ${isSelected ? 'selected' : ''} ${isToday ? 'today' : ''} ${holiday ? 'holiday' : ''}`;
        btn.textContent = day;

        if (holiday) {
            btn.title = holiday.name;
            btn.addEventListener('mouseenter', () => {
                if (holidayDetail) holidayDetail.textContent = `📌 ${holiday.name}`;
            });
            btn.addEventListener('mouseleave', () => {
                if (holidayDetail) holidayDetail.textContent = '';
            });
        }

        btn.addEventListener('click', () => {
            if (activeLeaveCalTarget) {
                activeLeaveCalTarget.thInput.value = formatThaiBEDate(dateIso);
                activeLeaveCalTarget.isoInput.value = dateIso;
                if (activeLeaveCalTarget.isStart) {
                    const endTh = document.getElementById('leave-input-end-date-th');
                    const endIso = document.getElementById('leave-input-end-date-iso');
                    if (endTh && !endTh.value) {
                        endTh.value = formatThaiBEDate(dateIso);
                        if (endIso) endIso.value = dateIso;
                    }
                }
            }
            popup.classList.add('hidden');
        });

        daysGrid.appendChild(btn);
    }
}

function openLeaveCalendar(anchorBtn, thInput, isoInput, isStart) {
    initLeaveCalendarPopup();
    const popup = document.getElementById('leave-calendar-popup');
    if (!popup) return;

    activeLeaveCalTarget = { thInput, isoInput, isStart };
    
    const rect = anchorBtn.getBoundingClientRect();
    const popupHeight = 315;
    if (rect.bottom + popupHeight > window.innerHeight && rect.top - popupHeight > 10) {
        popup.style.top = `${rect.top - popupHeight - 4}px`;
    } else {
        popup.style.top = `${Math.max(10, rect.bottom + 6)}px`;
    }
    popup.style.left = `${Math.max(10, Math.min(rect.left - 100, window.innerWidth - 330))}px`;
    popup.classList.remove('hidden');

    let curIso = isoInput.value || parseThaiBEToISO(thInput.value);
    if (!curIso) {
        const now = new Date();
        curIso = `${now.getFullYear()}-${String(now.getMonth()+1).padStart(2,'0')}-${String(now.getDate()).padStart(2,'0')}`;
    }
    const d = new Date(curIso);
    if (!isNaN(d.getTime())) {
        leaveCalMonth = d.getMonth();
        leaveCalYearBE = d.getFullYear() + 543;
    }
    renderLeaveCalendarGrid();
}

function resetTeacherLeaveForm() {
    const editingIdInput = document.getElementById('leave-editing-id');
    const teacherNameInput = document.getElementById('leave-input-teacher-name');
    const typeSelect = document.getElementById('leave-input-type');
    const startThInput = document.getElementById('leave-input-start-date-th');
    const startIsoInput = document.getElementById('leave-input-start-date-iso');
    const endThInput = document.getElementById('leave-input-end-date-th');
    const endIsoInput = document.getElementById('leave-input-end-date-iso');
    const noteInput = document.getElementById('leave-input-note');
    const btnAdd = document.getElementById('btn-add-teacher-leave');
    const btnAddLabel = document.getElementById('btn-add-leave-label');
    const btnAddIcon = document.getElementById('btn-add-leave-icon');
    const editIndicator = document.getElementById('leave-editing-indicator');
    const btnCancelEdit = document.getElementById('btn-cancel-edit-leave');
    const modeText = document.getElementById('leave-form-mode-text');
    const formIcon = document.getElementById('leave-form-icon');

    if (editingIdInput) editingIdInput.value = '';
    if (teacherNameInput) teacherNameInput.value = '';
    if (typeSelect) typeSelect.value = 'ไปราชการ';
    if (startThInput) startThInput.value = '';
    if (startIsoInput) startIsoInput.value = '';
    if (endThInput) endThInput.value = '';
    if (endIsoInput) endIsoInput.value = '';
    if (noteInput) noteInput.value = '';
    if (btnAddLabel) btnAddLabel.textContent = 'เพิ่มรายการ';
    if (btnAddIcon) btnAddIcon.className = 'fa-solid fa-plus';
    if (btnAdd) {
        btnAdd.className = 'flex-1 bg-amber-600 hover:bg-amber-500 text-white font-medium p-2 rounded-lg text-xs transition flex items-center justify-center gap-1.5 shadow-md shadow-amber-600/20 cursor-pointer';
    }
    if (editIndicator) editIndicator.classList.add('hidden');
    if (btnCancelEdit) btnCancelEdit.classList.add('hidden');
    if (modeText) modeText.textContent = 'เพิ่มรายการวันลา / ไปราชการใหม่';
    if (formIcon) formIcon.className = 'fa-solid fa-plus-circle';
}

function initTeacherLeavesUI(term) {
    const teacherNameInput = document.getElementById('leave-input-teacher-name');
    const datalist = document.getElementById('leave-teacher-datalist');
    const typeSelect = document.getElementById('leave-input-type');
    const startThInput = document.getElementById('leave-input-start-date-th');
    const startIsoInput = document.getElementById('leave-input-start-date-iso');
    const endThInput = document.getElementById('leave-input-end-date-th');
    const endIsoInput = document.getElementById('leave-input-end-date-iso');
    const noteInput = document.getElementById('leave-input-note');
    const btnAdd = document.getElementById('btn-add-teacher-leave');
    const btnStartCal = document.getElementById('btn-leave-start-cal');
    const btnEndCal = document.getElementById('btn-leave-end-cal');
    const btnToggle = document.getElementById('btn-toggle-teacher-leaves');
    const bodyContainer = document.getElementById('container-teacher-leaves-body');
    const iconToggle = document.getElementById('icon-toggle-leaves');
    const editingIdInput = document.getElementById('leave-editing-id');
    const btnCancelEdit = document.getElementById('btn-cancel-edit-leave');

    if (!term || !teacherNameInput) return;

    // 1. Populate teacher datalist
    if (datalist) {
        datalist.innerHTML = '';
        const termTeachers = new Set();
        (term.subjects || []).forEach(s => {
            const t = appData.teachers.find(te => te.id === s.teacherId);
            const name = s.claimData?.teacherName || t?.name;
            if (name) termTeachers.add(name.trim());
        });

        const sortedTeachers = [...appData.teachers].sort((a, b) => {
            const aIn = termTeachers.has(a.name.trim());
            const bIn = termTeachers.has(b.name.trim());
            if (aIn && !bIn) return -1;
            if (!aIn && bIn) return 1;
            return a.name.localeCompare(b.name, 'th');
        });

        sortedTeachers.forEach(t => {
            const opt = document.createElement('option');
            opt.value = t.name;
            if (termTeachers.has(t.name.trim())) {
                opt.label = '(ผู้สอนในภาคเรียนนี้)';
            }
            datalist.appendChild(opt);
        });
    }

    // 2. Calendar triggers
    if (btnStartCal) {
        btnStartCal.onclick = (e) => {
            e.stopPropagation();
            openLeaveCalendar(btnStartCal, startThInput, startIsoInput, true);
        };
    }

    if (btnEndCal) {
        btnEndCal.onclick = (e) => {
            e.stopPropagation();
            openLeaveCalendar(btnEndCal, endThInput, endIsoInput, false);
        };
    }

    // 3. Auto-masking for manual typing (e.g. 24/05/2569)
    const attachMask = (inpTh, inpIso) => {
        if (!inpTh) return;
        inpTh.oninput = (e) => {
            let val = inpTh.value.replace(/[^\d/]/g, '');
            if (e.inputType !== 'deleteContentBackward') {
                if (val.length === 2 && !val.includes('/')) val += '/';
                else if (val.length === 5 && val.split('/').length === 2) val += '/';
            }
            inpTh.value = val;
            if (val.length === 10) {
                const iso = parseThaiBEToISO(val);
                if (iso && inpIso) inpIso.value = iso;
            }
        };
        inpTh.onblur = () => {
            const val = inpTh.value.trim();
            if (val) {
                const iso = parseThaiBEToISO(val);
                if (iso) {
                    inpTh.value = formatThaiBEDate(iso);
                    if (inpIso) inpIso.value = iso;
                }
            }
        };
    };
    attachMask(startThInput, startIsoInput);
    attachMask(endThInput, endIsoInput);

    // 4. Toggle Card Collapse
    if (btnToggle && bodyContainer) {
        btnToggle.onclick = () => {
            bodyContainer.classList.toggle('hidden');
            if (iconToggle) {
                iconToggle.classList.toggle('rotate-180');
            }
        };
    }

    // 5. Cancel Edit Button
    if (btnCancelEdit) {
        btnCancelEdit.onclick = () => {
            resetTeacherLeaveForm();
        };
    }

    // 6. Add / Save Leave Button
    if (btnAdd) {
        btnAdd.onclick = () => {
            const teacherName = (teacherNameInput.value || '').trim();
            if (!teacherName) {
                alert('กรุณาระบุหรือเลือกชื่ออาจารย์ผู้สอน');
                teacherNameInput.focus();
                return;
            }

            const leaveType = typeSelect ? typeSelect.value : 'ไปราชการ';
            let startIso = startIsoInput ? startIsoInput.value : '';
            if (!startIso && startThInput) {
                startIso = parseThaiBEToISO(startThInput.value);
            }
            if (!startIso) {
                alert('กรุณากรอกวันที่เริ่มต้นในรูปแบบ วว/ดด/ปปปป เช่น 24/05/2569 หรือเลือกจากปฏิทิน');
                if (startThInput) startThInput.focus();
                return;
            }

            let endIso = endIsoInput ? endIsoInput.value : '';
            if (!endIso && endThInput && endThInput.value.trim()) {
                endIso = parseThaiBEToISO(endThInput.value);
            }
            if (!endIso) {
                // If end date left blank, default to same as start date (1-day leave)
                endIso = startIso;
            }

            if (endIso < startIso) {
                alert('วันที่สิ้นสุดต้องไม่น้อยกว่าวันที่เริ่มต้น');
                if (endThInput) endThInput.focus();
                return;
            }

            const note = (noteInput ? noteInput.value : '').trim();
            const editingId = editingIdInput ? editingIdInput.value : '';

            if (editingId) {
                // Update existing record
                const targetLeave = (term.teacherLeaves || []).find(l => l.id === editingId);
                if (targetLeave) {
                    targetLeave.teacherName = teacherName;
                    targetLeave.type = leaveType;
                    targetLeave.startDate = startIso;
                    targetLeave.endDate = endIso;
                    targetLeave.startDateThai = formatThaiBEDate(startIso);
                    targetLeave.endDateThai = formatThaiBEDate(endIso);
                    targetLeave.note = note;
                }
            } else {
                // Add new record
                const newLeave = {
                    id: 'leave_' + Date.now() + '_' + Math.random().toString(36).substr(2, 5),
                    teacherName: teacherName,
                    type: leaveType,
                    startDate: startIso,
                    endDate: endIso,
                    startDateThai: formatThaiBEDate(startIso),
                    endDateThai: formatThaiBEDate(endIso),
                    note: note
                };

                if (!term.teacherLeaves) term.teacherLeaves = [];
                term.teacherLeaves.push(newLeave);
            }

            // Sync to all subjects taught by this teacher in current term
            syncTermTeacherLeaves(term);

            // Reset form
            resetTeacherLeaveForm();

            renderSubjectsView();
        };
    }
}

function renderTeacherLeavesTable(term) {
    const tbody = document.getElementById('term-teacher-leaves-table-body');
    const countBadge = document.getElementById('term-leaves-count-badge');
    if (!tbody || !term) return;

    const leaves = term.teacherLeaves || [];
    if (countBadge) {
        countBadge.textContent = `${leaves.length} รายการ`;
    }

    if (leaves.length === 0) {
        tbody.innerHTML = `
            <tr>
                <td colspan="7" class="text-center py-6 text-gray-500 text-xs">
                    <i class="fa-solid fa-calendar-check text-base text-gray-600 mb-1 block"></i>
                    ยังไม่มีรายการบันทึกวันลาหรือไปราชการในภาคเรียนนี้
                </td>
            </tr>
        `;
        return;
    }

    tbody.innerHTML = '';
    leaves.forEach((leave, idx) => {
        const tr = document.createElement('tr');
        tr.className = 'hover:bg-[#20263c] transition-colors';

        // Badge color for leave type
        let badgeClass = 'bg-blue-500/20 text-blue-300 border-blue-500/30';
        if (leave.type === 'ลากิจ') badgeClass = 'bg-amber-500/20 text-amber-300 border-amber-500/30';
        else if (leave.type === 'ลาป่วย') badgeClass = 'bg-red-500/20 text-red-300 border-red-500/30';
        else if (leave.type === 'ลาพักผ่อน') badgeClass = 'bg-emerald-500/20 text-emerald-300 border-emerald-500/30';

        const dateRangeText = (leave.startDateThai === leave.endDateThai)
            ? `${leave.startDateThai} <span class="text-gray-500 font-normal">(1 วัน)</span>`
            : `${leave.startDateThai} - ${leave.endDateThai}`;

        const impactHtml = getLeaveImpactSummary(term, leave);

        tr.innerHTML = `
            <td class="px-3 py-2 text-center font-mono text-gray-400">${idx + 1}</td>
            <td class="px-3 py-2 font-medium text-white">
                <div class="flex items-center gap-1.5">
                    <i class="fa-solid fa-chalkboard-user text-amber-400/80 text-[11px]"></i>
                    <span>${leave.teacherName}</span>
                </div>
            </td>
            <td class="px-3 py-2 text-center">
                <span class="px-2 py-0.5 rounded-full text-[11px] font-semibold border ${badgeClass}">
                    ${leave.type}
                </span>
            </td>
            <td class="px-3 py-2 text-center font-mono text-amber-200">
                ${dateRangeText}
            </td>
            <td class="px-3 py-2 text-gray-400 max-w-xs truncate" title="${leave.note || '-'}">
                ${leave.note || '-'}
            </td>
            <td class="px-3 py-2 text-center text-xs">
                ${impactHtml}
            </td>
            <td class="px-3 py-2 text-center">
                <div class="flex items-center justify-center gap-1">
                    <button type="button" class="btn-edit-leave text-amber-400 hover:text-amber-300 p-1.5 rounded hover:bg-amber-950/40 transition cursor-pointer" title="แก้ไขรายการนี้">
                        <i class="fa-solid fa-pen-to-square"></i>
                    </button>
                    <button type="button" class="btn-delete-leave text-red-400 hover:text-red-300 p-1.5 rounded hover:bg-red-950/40 transition cursor-pointer" title="ลบรายการนี้">
                        <i class="fa-solid fa-trash-can"></i>
                    </button>
                </div>
            </td>
        `;

        const btnEdit = tr.querySelector('.btn-edit-leave');
        if (btnEdit) {
            btnEdit.onclick = () => {
                const editingIdInput = document.getElementById('leave-editing-id');
                const teacherNameInput = document.getElementById('leave-input-teacher-name');
                const typeSelect = document.getElementById('leave-input-type');
                const startThInput = document.getElementById('leave-input-start-date-th');
                const startIsoInput = document.getElementById('leave-input-start-date-iso');
                const endThInput = document.getElementById('leave-input-end-date-th');
                const endIsoInput = document.getElementById('leave-input-end-date-iso');
                const noteInput = document.getElementById('leave-input-note');
                const btnAdd = document.getElementById('btn-add-teacher-leave');
                const btnAddLabel = document.getElementById('btn-add-leave-label');
                const btnAddIcon = document.getElementById('btn-add-leave-icon');
                const editIndicator = document.getElementById('leave-editing-indicator');
                const btnCancelEdit = document.getElementById('btn-cancel-edit-leave');
                const modeText = document.getElementById('leave-form-mode-text');
                const formIcon = document.getElementById('leave-form-icon');
                const bodyContainer = document.getElementById('container-teacher-leaves-body');
                const iconToggle = document.getElementById('icon-toggle-leaves');

                if (bodyContainer && bodyContainer.classList.contains('hidden')) {
                    bodyContainer.classList.remove('hidden');
                    if (iconToggle) iconToggle.classList.remove('rotate-180');
                }

                if (editingIdInput) editingIdInput.value = leave.id;
                if (teacherNameInput) teacherNameInput.value = leave.teacherName;
                if (typeSelect) typeSelect.value = leave.type;
                if (startThInput) startThInput.value = leave.startDateThai || formatThaiBEDate(leave.startDate);
                if (startIsoInput) startIsoInput.value = leave.startDate;
                if (endThInput) endThInput.value = leave.endDateThai || formatThaiBEDate(leave.endDate);
                if (endIsoInput) endIsoInput.value = leave.endDate;
                if (noteInput) noteInput.value = leave.note || '';

                if (btnAddLabel) btnAddLabel.textContent = 'บันทึกแก้ไข';
                if (btnAddIcon) btnAddIcon.className = 'fa-solid fa-check';
                if (btnAdd) {
                    btnAdd.className = 'flex-1 bg-emerald-600 hover:bg-emerald-500 text-white font-medium p-2 rounded-lg text-xs transition flex items-center justify-center gap-1.5 shadow-md shadow-emerald-600/20 cursor-pointer';
                }
                if (editIndicator) editIndicator.classList.remove('hidden');
                if (btnCancelEdit) btnCancelEdit.classList.remove('hidden');
                if (modeText) modeText.textContent = `แก้ไขรายการ: ${leave.teacherName} (${leave.type})`;
                if (formIcon) formIcon.className = 'fa-solid fa-pen-to-square';

                const card = document.getElementById('term-teacher-leaves-card');
                if (card) {
                    card.scrollIntoView({ behavior: 'smooth', block: 'center' });
                }
                if (teacherNameInput) teacherNameInput.focus();
            };
        }

        const btnDel = tr.querySelector('.btn-delete-leave');
        if (btnDel) {
            btnDel.onclick = () => {
                if (confirm(`ต้องการลบรายการ ${leave.type} ของ "${leave.teacherName}" (${leave.startDateThai}) หรือไม่?\nระบบจะคืนชั่วโมงสอนให้กับวิชาของอาจารย์ท่านนี้โดยอัตโนมัติ`)) {
                    const editingIdInput = document.getElementById('leave-editing-id');
                    if (editingIdInput && editingIdInput.value === leave.id) {
                        resetTeacherLeaveForm();
                    }
                    term.teacherLeaves = term.teacherLeaves.filter(l => l.id !== leave.id);
                    syncTermTeacherLeaves(term);
                    renderSubjectsView();
                }
            };
        }

        tbody.appendChild(tr);
    });
}

// ----------------------------------------------------
// SUBJECTS VIEW (Inside Term)
// ----------------------------------------------------
function renderSubjectsView() {
    const term = appData.terms.find(t => t.id === currentTermId);
    if(!term) return switchView('semesters');
    
    document.getElementById('current-term-label').textContent = `ภาคเรียนที่ ${term.no}/${term.year}`;
    
    // Ensure all subjects have claimData and synced hours
    term.subjects.forEach(sub => {
        if (!sub.claimData) {
            const masterSub = appData.subjects_master.find(s => s.id === sub.subjectId) || {};
            const teacher = appData.teachers.find(t => t.id === sub.teacherId) || {};
            sub.claimData = createInitialSubjectClaimData(term, masterSub, teacher);
        }
        sub.hours = getSubjectEffectiveHours(sub);
    });

    // เริ่มต้นระบบคำนวณอัตราเบิกของเทอม
    initTermRateCalculator(term);

    // เริ่มต้นและแสดงผลระบบบันทึกวันลา / ไปราชการของอาจารย์
    initTeacherLeavesUI(term);
    renderTeacherLeavesTable(term);

    const defaultRate = term.hourlyRate || 42;
    const totalSubs = term.subjects.length;
    const totalMoney = term.subjects.reduce((sum, sub) => sum + (getSubjectEffectiveHours(sub) * (sub.rate || defaultRate)), 0);
    
    document.getElementById('term-stat-subjects').textContent = totalSubs;
    document.getElementById('term-stat-money').textContent = formatMoney(totalMoney);
    
    const grid = document.getElementById('subjects-grid');
    grid.innerHTML = '';
    
    const searchInput = document.getElementById('search-subject-term');
    const query = searchInput ? (searchInput.value || '').toLowerCase().trim() : '';

    const filteredSubjects = term.subjects.filter(sub => {
        if (!query) return true;
        const masterSub = appData.subjects_master.find(s => s.id === sub.subjectId) || {code:'', name:''};
        return masterSub.name.toLowerCase().includes(query) || masterSub.code.toLowerCase().includes(query);
    });

    filteredSubjects.forEach(sub => {
        const masterSub = appData.subjects_master.find(s => s.id === sub.subjectId) || {code:'-', name:'ไม่พบข้อมูลวิชา'};
        const teacher = appData.teachers.find(t => t.id === sub.teacherId) || {name: sub.claimData?.teacherName || 'ยังไม่ระบุอาจารย์ผู้สอน'};
        const currentRate = sub.rate || term.hourlyRate || 42;
        const effHours = getSubjectEffectiveHours(sub);
        sub.hours = effHours;
        const money = effHours * currentRate;
        
        const card = document.createElement('div');
        card.className = 'bg-[#1c2134] border border-[#2d3748] rounded-xl overflow-hidden hover:border-blue-500/50 transition-colors shadow-lg flex flex-col';
        
        card.innerHTML = `
            <div class="p-5 border-b border-[#2d3748] flex-1">
                <div class="flex justify-between items-center mb-3">
                    <div class="flex items-center gap-1.5 flex-wrap">
                        <span class="bg-blue-900/30 text-blue-400 border border-blue-500/30 text-xs px-2 py-1 rounded-full font-mono">
                            # ${masterSub.code}
                        </span>
                        ${!isSubjectIncludedInRateCalc(term, sub) ? `
                        <span class="bg-amber-950/40 text-amber-400 border border-amber-500/30 text-[10px] px-2 py-0.5 rounded-full flex items-center gap-1" title="วิชานี้ไม่ถูกนำมาคิด ชม. ในการคำนวณอัตราเบิก">
                            <i class="fa-solid fa-ban text-[9px]"></i> ไม่คิด ชม. ในอัตราเบิก
                        </span>` : ''}
                    </div>
                    <div class="flex items-center gap-2">
                        <span class="text-xs text-gray-500">ภาคเรียน ${term.no}/${term.year}</span>
                        <button class="btn-quick-edit-subject text-xs text-amber-400 hover:text-amber-300 bg-amber-950/40 hover:bg-amber-900/50 border border-amber-500/30 px-2 py-0.5 rounded-md flex items-center gap-1 transition cursor-pointer" title="แก้ไขรายวิชานี้">
                            <i class="fa-solid fa-pen-to-square"></i> แก้ไข
                        </button>
                    </div>
                </div>
                
                <h3 class="text-lg font-bold text-white mb-4 line-clamp-2">${masterSub.name}</h3>
                
                <div class="grid grid-cols-2 gap-y-3 gap-x-2 text-sm mb-4 bg-[#141725] p-3 rounded-lg">
                    <div class="flex items-center gap-2"><i class="fa-solid fa-layer-group w-4 text-gray-400"></i><span class="text-gray-300">${sub.level}</span></div>
                    <div class="flex items-center gap-2"><i class="fa-regular fa-clock w-4 text-gray-400"></i><span class="text-gray-300">${sub.time}</span></div>
                    <div class="flex items-center gap-2" title="ช่วงวันที่สอน"><i class="fa-regular fa-calendar-days w-4 text-blue-400"></i><span class="text-gray-300 text-xs">${getSubjectTeachingDateRange(sub)}</span></div>
                    <div class="flex items-center gap-2"><i class="fa-solid fa-chalkboard-user w-4 text-gray-400"></i><span class="text-gray-300">${effHours} ชม. (${currentRate} บ./ชม.)</span></div>
                </div>
                
                <div class="flex justify-between items-center border-t border-[#2d3748] pt-3">
                    <span class="text-gray-400 text-sm">ยอดเงินเบิก (บาท)</span>
                    <span class="text-xl font-bold text-[#10b981]">${formatMoney(money)}</span>
                </div>
                <div class="text-xs text-gray-500 text-right mt-1">ผู้สอน: ${teacher.name}</div>
            </div>
            
            <div class="bg-[#242940] p-3 flex flex-wrap items-center gap-2">
                <button class="btn-fill-claim flex-1 min-w-[85px] bg-blue-600 hover:bg-blue-500 text-white py-1.5 px-2 rounded-lg text-xs font-medium flex items-center justify-center gap-1.5 transition shadow-sm cursor-pointer">
                    <i class="fa-solid fa-file-signature"></i> กรอกใบเบิก
                </button>
                <button class="btn-edit-subject flex-1 min-w-[85px] bg-amber-600 hover:bg-amber-500 text-white py-1.5 px-2 rounded-lg text-xs font-medium flex items-center justify-center gap-1.5 transition shadow-sm cursor-pointer">
                    <i class="fa-solid fa-pen-to-square"></i> แก้ไขวิชา
                </button>
                <button class="btn-print-claim-direct flex-1 min-w-[85px] bg-[#10b981] hover:bg-[#059669] text-white py-1.5 px-2 rounded-lg text-xs font-medium flex items-center justify-center gap-1.5 transition shadow-sm cursor-pointer">
                    <i class="fa-solid fa-print"></i> พิมพ์ใบเบิก
                </button>
                <div class="flex items-center gap-1">
                    <button class="btn-copy-subject bg-[#1c2134] hover:bg-blue-500/20 text-gray-400 hover:text-blue-400 p-2 rounded-lg border border-[#2d3748] transition cursor-pointer" title="คัดลอกรายวิชานี้">
                        <i class="fa-regular fa-clone"></i>
                    </button>
                    <button class="btn-delete-subject bg-[#1c2134] hover:bg-red-500/20 text-gray-400 hover:text-red-500 p-2 rounded-lg border border-[#2d3748] transition cursor-pointer" title="ลบรายวิชา">
                        <i class="fa-solid fa-trash-can"></i>
                    </button>
                </div>
            </div>
        `;
        
        const handleEdit = () => openEditSubjectModal(sub);
        card.querySelector('.btn-edit-subject').addEventListener('click', handleEdit);
        const quickEditBtn = card.querySelector('.btn-quick-edit-subject');
        if (quickEditBtn) quickEditBtn.addEventListener('click', handleEdit);

        card.querySelector('.btn-fill-claim').addEventListener('click', () => {
            switchView('claim-form', term.id, sub.id);
        });

        card.querySelector('.btn-print-claim-direct').addEventListener('click', () => {
            switchView('claim-form', term.id, sub.id);
            setTimeout(() => window.print(), 350);
        });

        card.querySelector('.btn-copy-subject').addEventListener('click', () => {
            const newSub = JSON.parse(JSON.stringify(sub));
            newSub.id = generateId();
            term.subjects.push(newSub);
            saveData();
            renderSubjectsView();
        });

        card.querySelector('.btn-delete-subject').addEventListener('click', () => {
            if(confirm(`ต้องการลบวิชา ${masterSub.name} ออกจากเทอมนี้หรือไม่?`)) {
                term.subjects = term.subjects.filter(s => s.id !== sub.id);
                saveData();
                renderSubjectsView();
            }
        });
        
        grid.appendChild(card);
    });

    // Square Add Subject Card (วางข้างๆ รายวิชา ขนาดเท่ากัน ตามรูปเพิ่มรายวิชา.png)
    const addSubCard = document.createElement('div');
    addSubCard.className = 'border-2 border-dashed border-[#2d3748] hover:border-blue-500/70 bg-[#1c2134]/30 hover:bg-[#1c2134]/70 transition-all rounded-xl p-6 flex flex-col items-center justify-center text-center cursor-pointer min-h-[260px] group shadow-lg';
    addSubCard.innerHTML = `
        <div class="w-16 h-16 rounded-full bg-blue-500/10 text-blue-400 border border-blue-500/30 flex items-center justify-center text-2xl mb-4 group-hover:scale-110 group-hover:bg-blue-600 group-hover:text-white transition-all shadow-lg shadow-blue-500/10">
            <i class="fa-solid fa-plus"></i>
        </div>
        <h3 class="text-lg font-bold text-white group-hover:text-blue-400 transition-colors">+ เพิ่มรายวิชาในเทอมนี้</h3>
        <p class="text-xs text-gray-400 mt-2">คลิกเพื่อเพิ่มรายวิชาใหม่ในภาคเรียนที่ ${term.no}/${term.year}</p>
    `;
    addSubCard.addEventListener('click', openAddSubjectModal);
    grid.appendChild(addSubCard);
}

// ----------------------------------------------------
// AUTOCOMPLETE CONTROLLERS FOR ADDING SUBJECT TO TERM
// ----------------------------------------------------
function initTermSubjectAutocomplete() {
    const inputSub = document.getElementById('input-search-sub');
    const dropSub = document.getElementById('dropdown-sub-list');
    const selectedSubId = document.getElementById('selected-sub-id');
    const subBadge = document.getElementById('sub-selected-badge');
    const subBadgeText = document.getElementById('sub-selected-text');
    const btnClearSub = document.getElementById('btn-clear-sub');

    if (!inputSub || !dropSub) return;

    // Render Subject Dropdown
    function renderSubDropdown(query = '') {
        const q = query.toLowerCase().trim();
        const matches = appData.subjects_master.filter(s => {
            if (!q) return true;
            const sName = s.name.toLowerCase();
            const sCode = s.code.toLowerCase();
            if (sCode.includes(q) || sName.includes(q)) return true;
            const words = q.split(/\s+/).filter(Boolean);
            if (words.length > 0 && words.every(w => sCode.includes(w) || sName.includes(w))) return true;
            const qClean = q.replace(/[\sและ]/g, '');
            const nClean = sName.replace(/[\sและ]/g, '');
            if (qClean.includes('ทดสอบ') && qClean.includes('วัสดุ') && nClean.includes('วัสดุ') && nClean.includes('ทดสอบ')) return true;
            return false;
        });

        dropSub.innerHTML = '';
        if (matches.length === 0) {
            dropSub.innerHTML = '<div class="p-3 text-center text-xs text-gray-500">ไม่พบรายวิชาที่ค้นหา</div>';
        } else {
            matches.forEach(s => {
                const item = document.createElement('div');
                item.className = 'p-2.5 hover:bg-blue-600/20 hover:text-blue-200 rounded-lg cursor-pointer transition text-sm flex justify-between items-center border-b border-[#2d3748]/50 last:border-0';
                item.innerHTML = `
                    <div>
                        <div class="font-medium text-white">[${s.code}] ${s.name}</div>
                        <div class="text-xs text-gray-400">หน่วยกิต: ${s.credits || 3} | ท${s.theoryHours !== undefined ? s.theoryHours : 3}-ป${s.practiceHours !== undefined ? s.practiceHours : 0}-รวม${s.hours || 3} ชม./สัปดาห์</div>
                    </div>
                    <span class="text-xs bg-blue-500/20 text-blue-300 px-2 py-0.5 rounded ml-2 whitespace-nowrap">เลือก</span>
                `;
                item.addEventListener('click', (e) => {
                    e.stopPropagation();
                    selectSubject(s);
                });
                dropSub.appendChild(item);
            });
        }
        dropSub.classList.remove('hidden');
    }

    function selectSubject(s) {
        selectedSubId.value = s.id;
        inputSub.value = `[${s.code}] ${s.name}`;
        subBadgeText.textContent = `[${s.code}] ${s.name} (${s.credits || 3} นก. / ${s.hours || 3} ชม.)`;
        subBadge.classList.remove('hidden');
        btnClearSub.classList.remove('hidden');
        dropSub.classList.add('hidden');
    }

    // Subject Input Events
    inputSub.addEventListener('focus', () => renderSubDropdown(inputSub.value));
    inputSub.addEventListener('input', () => {
        selectedSubId.value = '';
        subBadge.classList.add('hidden');
        if (inputSub.value) btnClearSub.classList.remove('hidden');
        else btnClearSub.classList.add('hidden');
        renderSubDropdown(inputSub.value);
    });
    btnClearSub.addEventListener('click', (e) => {
        e.stopPropagation();
        inputSub.value = '';
        selectedSubId.value = '';
        subBadge.classList.add('hidden');
        btnClearSub.classList.add('hidden');
        dropSub.classList.add('hidden');
    });

    // Close on click outside
    document.addEventListener('click', (e) => {
        if (!e.target.closest('#input-search-sub') && !e.target.closest('#dropdown-sub-list')) {
            dropSub.classList.add('hidden');
        }
    });
}

function openAddSubjectModal() {
    // Reset Subject Autocomplete
    const inputSub = document.getElementById('input-search-sub');
    const selectedSubId = document.getElementById('selected-sub-id');
    const subBadge = document.getElementById('sub-selected-badge');
    const btnClearSub = document.getElementById('btn-clear-sub');
    const dropSub = document.getElementById('dropdown-sub-list');
    if (inputSub) inputSub.value = '';
    if (selectedSubId) selectedSubId.value = '';
    if (subBadge) subBadge.classList.add('hidden');
    if (btnClearSub) btnClearSub.classList.add('hidden');
    if (dropSub) dropSub.classList.add('hidden');

    openModal('modal-add-subject-term');
}

function handleAddSubject() {
    let subjectId = document.getElementById('selected-sub-id').value;

    // If user typed without clicking item, try matching
    if (!subjectId) {
        const text = (document.getElementById('input-search-sub').value || '').toLowerCase().trim();
        if (text) {
            const match = appData.subjects_master.find(s => {
                const sName = s.name.toLowerCase();
                const sCode = s.code.toLowerCase();
                if (sName.includes(text) || sCode.includes(text) || `[${sCode}] ${sName}`.includes(text)) return true;
                const words = text.split(/\s+/).filter(Boolean);
                if (words.length > 0 && words.every(w => sCode.includes(w) || sName.includes(w))) return true;
                const tClean = text.replace(/[\sและ]/g, '');
                const nClean = sName.replace(/[\sและ]/g, '');
                if (tClean.includes('ทดสอบ') && tClean.includes('วัสดุ') && nClean.includes('วัสดุ') && nClean.includes('ทดสอบ')) return true;
                return false;
            });
            if (match) subjectId = match.id;
        }
    }

    if (!subjectId) return alert('กรุณาพิมพ์ค้นหาและคลิกเลือก "รายวิชา" จากรายการที่แนะนำ');

    const term = appData.terms.find(t => t.id === currentTermId);
    if (!term) return;

    const masterSub = appData.subjects_master.find(s => s.id === subjectId) || {};
    
    // Check if sibling in term has level / time
    const sibling = term.subjects.length > 0 ? term.subjects[term.subjects.length - 1] : null;
    const level = (sibling && sibling.level) ? sibling.level : 'ชั้นปี 1';
    const time = (sibling && sibling.time) ? sibling.time : '17.00-20.00';
    const rate = (term && term.hourlyRate) ? term.hourlyRate : 42;
    const studentCount = appData.students ? appData.students.length : 6;

    // Build complete claimData with 18-week schedule and actual non-holiday hours
    const claimData = createInitialSubjectClaimData(term, masterSub, null);
    const actualTeachingHours = claimData.weeks.reduce((acc, w) => acc + (w.isHoliday ? 0 : (parseFloat(w.totalHrs) || 0)), 0);

    const newSubject = {
        id: generateId(),
        subjectId,
        teacherId: '',
        level,
        time,
        studentCount,
        hours: actualTeachingHours,
        rate,
        claimData
    };

    term.subjects.push(newSubject);

    // Auto-update rate calculator for term
    const newTotalHours = calculateTermTotalHours(term);
    term.totalTeachingHours = newTotalHours;
    if (term.budget > 0 && newTotalHours > 0) {
        const newRate = Math.floor(term.budget / newTotalHours);
        term.hourlyRate = newRate;
        term.subjects.forEach(s => {
            if (!s.rateCustomized && (!s.claimData || !s.claimData.rateCustomized)) {
                s.rate = newRate;
                if (s.claimData) s.claimData.rate = newRate;
            }
        });
    }

    saveData();
    closeModal('modal-add-subject-term');
    
    // Clear search modal input
    const inpSearch = document.getElementById('input-search-sub');
    if (inpSearch) inpSearch.value = '';
    const selId = document.getElementById('selected-sub-id');
    if (selId) selId.value = '';
    const badge = document.getElementById('sub-selected-badge');
    if (badge) badge.classList.add('hidden');

    // ให้อยู่หน้าเพิ่มรายวิชาหน้าหลักนี้ก่อนตามคำขอ
    renderSubjectsView();
    updateGlobalStats();
}

// ----------------------------------------------------
// EDIT SUBJECT IN TERM MODAL CONTROLLERS
// ----------------------------------------------------
function openEditSubjectModal(sub) {
    const term = appData.terms.find(t => t.id === currentTermId);
    if (!term || !sub) return;

    const masterSub = appData.subjects_master.find(s => s.id === sub.subjectId) || {
        code: sub.code || '',
        name: sub.name || ''
    };
    const teacher = appData.teachers.find(t => t.id === sub.teacherId) || {
        name: sub.claimData?.teacherName || ''
    };

    const editingIdEl = document.getElementById('edit-term-sub-editing-id');
    const termLabelEl = document.getElementById('edit-term-sub-term-label');
    const searchInput = document.getElementById('edit-term-sub-search');
    const clearBtn = document.getElementById('btn-edit-clear-sub');
    const dropList = document.getElementById('edit-term-dropdown-sub-list');
    const masterIdInput = document.getElementById('edit-term-sub-master-id');
    const codeInput = document.getElementById('edit-term-sub-code');
    const nameInput = document.getElementById('edit-term-sub-name');
    const teacherNameInput = document.getElementById('edit-term-sub-teacher-name');
    const teacherIdInput = document.getElementById('edit-term-sub-teacher-id');
    const levelInput = document.getElementById('edit-term-sub-level');
    const timeInput = document.getElementById('edit-term-sub-time');
    const hoursInput = document.getElementById('edit-term-sub-hours');
    const rateInput = document.getElementById('edit-term-sub-rate');
    const studentsInput = document.getElementById('edit-term-sub-students');
    const moneyPreview = document.getElementById('edit-term-sub-total-money');

    if (editingIdEl) editingIdEl.value = sub.id;
    if (termLabelEl) termLabelEl.textContent = `ภาคเรียนที่ ${term.no}/${term.year}`;
    if (searchInput) searchInput.value = '';
    if (clearBtn) clearBtn.classList.add('hidden');
    if (dropList) dropList.classList.add('hidden');

    if (masterIdInput) masterIdInput.value = sub.subjectId || '';
    if (codeInput) codeInput.value = sub.code || masterSub.code || '';
    if (nameInput) nameInput.value = sub.name || masterSub.name || '';
    if (teacherNameInput) teacherNameInput.value = teacher.name || '';
    if (teacherIdInput) teacherIdInput.value = sub.teacherId || '';
    if (levelInput) levelInput.value = sub.level || 'ชั้นปี 1';
    if (timeInput) timeInput.value = sub.time || '17.00-20.00';
    if (hoursInput) hoursInput.value = sub.hours || 54;
    if (rateInput) rateInput.value = sub.rate || term.hourlyRate || 42;
    if (studentsInput) studentsInput.value = sub.studentCount || (appData.students ? appData.students.length : 6);
    const creditsInput = document.getElementById('edit-term-sub-credits');
    if (creditsInput) creditsInput.value = sub.credits !== undefined ? sub.credits : (masterSub.credits !== undefined ? masterSub.credits : (sub.claimData?.credits || 3));

    const updateMoney = () => {
        const h = parseFloat(hoursInput?.value) || 0;
        const r = parseFloat(rateInput?.value) || 0;
        if (moneyPreview) moneyPreview.textContent = `${formatMoney(h * r)} บาท`;
    };
    updateMoney();

    const btnGoto = document.getElementById('btn-edit-goto-claim');
    if (btnGoto) {
        btnGoto.onclick = () => {
            closeModal('modal-edit-subject-term');
            switchView('claim-form', term.id, sub.id);
        };
    }

    openModal('modal-edit-subject-term');
}

function saveEditSubjectModal() {
    const term = appData.terms.find(t => t.id === currentTermId);
    if (!term) return;

    const subId = document.getElementById('edit-term-sub-editing-id').value;
    const sub = term.subjects.find(s => s.id === subId);
    if (!sub) return;

    const newCode = (document.getElementById('edit-term-sub-code').value || '').trim();
    const newName = (document.getElementById('edit-term-sub-name').value || '').trim();
    const masterId = document.getElementById('edit-term-sub-master-id').value;
    const teacherId = document.getElementById('edit-term-sub-teacher-id').value;
    const teacherName = (document.getElementById('edit-term-sub-teacher-name').value || '').trim();
    const level = (document.getElementById('edit-term-sub-level').value || '').trim() || 'ชั้นปี 1';
    const time = (document.getElementById('edit-term-sub-time').value || '').trim() || '17.00-20.00';
    const hours = parseFloat(document.getElementById('edit-term-sub-hours').value) || sub.hours || 54;
    const rate = parseFloat(document.getElementById('edit-term-sub-rate').value) || sub.rate || 42;
    const studentCount = parseInt(document.getElementById('edit-term-sub-students').value, 10) || sub.studentCount || 6;
    const creditsInput = document.getElementById('edit-term-sub-credits');
    const credits = creditsInput ? (parseInt(creditsInput.value, 10) || 3) : (sub.credits || 3);

    if (!newCode && !newName) {
        alert('กรุณาระบุรหัสวิชาหรือชื่อรายวิชา');
        return;
    }

    if (masterId) {
        sub.subjectId = masterId;
    }
    
    let masterSub = appData.subjects_master.find(s => s.id === sub.subjectId);
    if (masterSub) {
        if (newCode) masterSub.code = newCode;
        if (newName) masterSub.name = newName;
        masterSub.credits = credits;
    }

    sub.code = newCode;
    sub.name = newName;
    sub.credits = credits;
    if (teacherId) sub.teacherId = teacherId;
    sub.level = level;
    sub.time = time;
    sub.hours = hours;
    sub.rate = rate;
    sub.studentCount = studentCount;

    // ซิงค์ไปยัง claimData หากมีสร้างไว้แล้ว
    if (sub.claimData) {
        if (newCode) sub.claimData.subjectCode = newCode;
        if (newName) sub.claimData.subjectName = newName;
        sub.claimData.credits = credits;
        if (teacherName) {
            sub.claimData.teacherName = teacherName;
            if (sub.claimData.signatures) sub.claimData.signatures.teacher = teacherName;
        }
        sub.claimData.level = level;
        sub.claimData.timeStr = time;
        sub.claimData.hours = hours;
        sub.claimData.rate = rate;
    }

    syncTermTeacherLeaves(term);
    saveData();
    closeModal('modal-edit-subject-term');
    renderSubjectsView();
}

function initEditSubjectModalLogic() {
    const searchInput = document.getElementById('edit-term-sub-search');
    const dropList = document.getElementById('edit-term-dropdown-sub-list');
    const masterIdInput = document.getElementById('edit-term-sub-master-id');
    const codeInput = document.getElementById('edit-term-sub-code');
    const nameInput = document.getElementById('edit-term-sub-name');
    const clearBtn = document.getElementById('btn-edit-clear-sub');
    const teacherNameInput = document.getElementById('edit-term-sub-teacher-name');
    const teacherIdInput = document.getElementById('edit-term-sub-teacher-id');
    const hoursInput = document.getElementById('edit-term-sub-hours');
    const rateInput = document.getElementById('edit-term-sub-rate');
    const moneyPreview = document.getElementById('edit-term-sub-total-money');
    const saveBtn = document.getElementById('btn-save-edit-subject');

    if (!searchInput || !dropList) return;

    const updateMoney = () => {
        const h = parseFloat(hoursInput?.value) || 0;
        const r = parseFloat(rateInput?.value) || 0;
        if (moneyPreview) moneyPreview.textContent = `${formatMoney(h * r)} บาท`;
    };

    if (hoursInput) hoursInput.addEventListener('input', updateMoney);
    if (rateInput) rateInput.addEventListener('input', updateMoney);

    function renderSubDropdown(query = '') {
        const q = query.toLowerCase().trim();
        const matches = appData.subjects_master.filter(s => {
            if (!q) return true;
            const sName = s.name.toLowerCase();
            const sCode = s.code.toLowerCase();
            if (sCode.includes(q) || sName.includes(q)) return true;
            const words = q.split(/\s+/).filter(Boolean);
            if (words.length > 0 && words.every(w => sCode.includes(w) || sName.includes(w))) return true;
            const qClean = q.replace(/[\sและ]/g, '');
            const nClean = sName.replace(/[\sและ]/g, '');
            if (qClean.includes('ทดสอบ') && qClean.includes('วัสดุ') && nClean.includes('วัสดุ') && nClean.includes('ทดสอบ')) return true;
            return false;
        });

        dropList.innerHTML = '';
        if (matches.length === 0) {
            dropList.innerHTML = '<div class="p-3 text-center text-xs text-gray-500">ไม่พบรายวิชาที่ค้นหา</div>';
        } else {
            matches.forEach(s => {
                const item = document.createElement('div');
                item.className = 'p-2.5 hover:bg-blue-600/20 hover:text-blue-200 rounded-lg cursor-pointer transition text-xs flex justify-between items-center border-b border-[#2d3748]/50 last:border-0';
                item.innerHTML = `
                    <div>
                        <div class="font-medium text-white">[${s.code}] ${s.name}</div>
                        <div class="text-[11px] text-gray-400">หน่วยกิต: ${s.credits || 3} | ${s.hours || 3} ชม./สัปดาห์</div>
                    </div>
                    <span class="text-[10px] bg-blue-500/20 text-blue-300 px-2 py-0.5 rounded ml-2 whitespace-nowrap">เลือก</span>
                `;
                item.addEventListener('click', (e) => {
                    e.stopPropagation();
                    masterIdInput.value = s.id;
                    codeInput.value = s.code;
                    nameInput.value = s.name;
                    searchInput.value = `[${s.code}] ${s.name}`;
                    const editTermCred = document.getElementById('edit-term-sub-credits');
                    if (editTermCred && s.credits !== undefined) {
                        editTermCred.value = s.credits;
                    }
                    if (s.hours) {
                        const term = appData.terms.find(t => t.id === currentTermId);
                        const tempClaim = createInitialSubjectClaimData(term, s);
                        const realHours = tempClaim.weeks.reduce((acc, w) => acc + (w.isHoliday ? 0 : (parseFloat(w.totalHrs) || 0)), 0);
                        hoursInput.value = realHours;
                        updateMoney();
                    }
                    if (clearBtn) clearBtn.classList.remove('hidden');
                    dropList.classList.add('hidden');
                });
                dropList.appendChild(item);
            });
        }
        dropList.classList.remove('hidden');
    }

    searchInput.addEventListener('focus', () => renderSubDropdown(searchInput.value));
    searchInput.addEventListener('input', () => {
        if (searchInput.value) {
            if (clearBtn) clearBtn.classList.remove('hidden');
        } else {
            if (clearBtn) clearBtn.classList.add('hidden');
        }
        renderSubDropdown(searchInput.value);
    });

    if (clearBtn) {
        clearBtn.addEventListener('click', (e) => {
            e.stopPropagation();
            searchInput.value = '';
            clearBtn.classList.add('hidden');
            dropList.classList.add('hidden');
        });
    }

    // Autocomplete สำหรับชื่ออาจารย์ผู้สอนในหน้าแก้ไข
    if (teacherNameInput) {
        createAutocompleteDropdown(teacherNameInput, {
            getItems: (query) => {
                const sorted = filterAndSortSuggestions(appData.teachers || [], query, t => ({
                    primary: t.name,
                    secondary: ''
                }));
                return sorted.map(t => ({
                    title: t.name,
                    subtitle: 'อาจารย์ผู้สอน',
                    value: t.name,
                    raw: t
                }));
            },
            onSelect: (item) => {
                teacherNameInput.value = item.value;
                if (teacherIdInput && item.raw) teacherIdInput.value = item.raw.id || '';
            }
        });
    }

    document.addEventListener('click', (e) => {
        if (!e.target.closest('#edit-term-sub-search') && !e.target.closest('#edit-term-dropdown-sub-list')) {
            dropList.classList.add('hidden');
        }
    });

    if (saveBtn) {
        saveBtn.addEventListener('click', saveEditSubjectModal);
    }
}


// ----------------------------------------------------
// SETTINGS / MODALS
// ----------------------------------------------------
function initModals() {
    const btnSettings = document.getElementById('btn-settings');
    if (btnSettings) {
        btnSettings.addEventListener('click', () => {
            selectedTeacherSettingsIds.clear();
            selectedSubjectSettingsIds.clear();
            selectedStudentSettingsIds.clear();
            renderSettingsLists();
            openModal('modal-settings');
        });
    }
    
    // Close modal on click of any .close-modal button
    document.querySelectorAll('.close-modal').forEach(btn => {
        btn.addEventListener('click', (e) => {
            const modal = e.target.closest('.modal');
            if (modal) {
                modal.classList.remove('active');
                modal.classList.add('hidden');
            }
        });
    });

    // Close modal on backdrop click
    document.querySelectorAll('.modal').forEach(modal => {
        modal.addEventListener('click', (e) => {
            if (e.target === modal) {
                modal.classList.remove('active');
                modal.classList.add('hidden');
            }
        });
    });

    // Close modal on Escape key
    document.addEventListener('keydown', (e) => {
        if (e.key === 'Escape') {
            const activeModal = document.querySelector('.modal.active:not(#modal-summary-claim)');
            if (activeModal) {
                activeModal.classList.remove('active');
                activeModal.classList.add('hidden');
            }
        }
    });
}

function openModal(id) {
    const el = document.getElementById(id);
    if (el) {
        el.classList.add('active');
        el.classList.remove('hidden');
    }
}

function closeModal(id) {
    const el = document.getElementById(id);
    if (el) {
        el.classList.remove('active');
        el.classList.add('hidden');
    }
}

// -------------------------------------------------------------------------
// AUTHENTICATION & MULTI-USER MANAGEMENT SYSTEM
// -------------------------------------------------------------------------
function initAuthSystem() {
    // 1. Tab Switchers in Login View
    const tabLogin = document.getElementById('tab-btn-login');
    const tabReg = document.getElementById('tab-btn-register');
    const formLogin = document.getElementById('form-login');
    const formReg = document.getElementById('form-register');
    const btnSwitchToLogin = document.getElementById('btn-switch-to-login');

    if (tabLogin && tabReg && formLogin && formReg) {
        tabLogin.onclick = () => {
            tabLogin.className = 'flex-1 py-3 text-center font-medium text-blue-400 border-b-2 border-blue-500 transition cursor-pointer flex items-center justify-center gap-2';
            tabReg.className = 'flex-1 py-3 text-center font-medium text-gray-400 hover:text-white transition cursor-pointer flex items-center justify-center gap-2';
            formLogin.classList.remove('hidden');
            formReg.classList.add('hidden');
        };

        tabReg.onclick = () => {
            tabReg.className = 'flex-1 py-3 text-center font-medium text-blue-400 border-b-2 border-blue-500 transition cursor-pointer flex items-center justify-center gap-2';
            tabLogin.className = 'flex-1 py-3 text-center font-medium text-gray-400 hover:text-white transition cursor-pointer flex items-center justify-center gap-2';
            formReg.classList.remove('hidden');
            formLogin.classList.add('hidden');
        };

        if (btnSwitchToLogin) {
            btnSwitchToLogin.onclick = () => tabLogin.click();
        }
    }

    // 2. Toggle Login Password Visibility
    const btnTogglePwd = document.getElementById('btn-toggle-login-pwd');
    const loginPwdInput = document.getElementById('login-password');
    if (btnTogglePwd && loginPwdInput) {
        btnTogglePwd.onclick = () => {
            if (loginPwdInput.type === 'password') {
                loginPwdInput.type = 'text';
                btnTogglePwd.innerHTML = '<i class="fa-solid fa-eye-slash"></i> ซ่อนรหัส';
            } else {
                loginPwdInput.type = 'password';
                btnTogglePwd.innerHTML = '<i class="fa-regular fa-eye"></i> แสดงรหัส';
            }
        };
    }

    const loginUserInput = document.getElementById('login-username');

    // 4. Submit Login
    const btnLoginSubmit = document.getElementById('btn-login-submit');
    if (btnLoginSubmit) {
        btnLoginSubmit.onclick = handleLogin;
    }
    if (loginUserInput) {
        loginUserInput.addEventListener('keypress', (e) => {
            if (e.key === 'Enter') handleLogin();
        });
    }
    if (loginPwdInput) {
        loginPwdInput.addEventListener('keypress', (e) => {
            if (e.key === 'Enter') handleLogin();
        });
    }

    // 5. Submit Register
    const btnRegSubmit = document.getElementById('btn-register-submit');
    if (btnRegSubmit) {
        btnRegSubmit.onclick = handleRegister;
    }
    const regConfirmPwdInput = document.getElementById('reg-confirm-password');
    if (regConfirmPwdInput) {
        regConfirmPwdInput.addEventListener('keypress', (e) => {
            if (e.key === 'Enter') handleRegister();
        });
    }

    // 6. Admin System Navigation & Password Authentication
    const btnAdminNav = document.getElementById('btn-admin-nav');
    if (btnAdminNav) {
        btnAdminNav.onclick = () => {
            // Open password prompt modal to verify admin
            const userInput = document.getElementById('admin-auth-username');
            const pwdInput = document.getElementById('admin-auth-password');
            const errBox = document.getElementById('admin-auth-error');
            if (userInput) userInput.value = '';
            if (pwdInput) pwdInput.value = '';
            if (errBox) errBox.classList.add('hidden');
            openModal('modal-admin-auth');
            setTimeout(() => {
                if (userInput) userInput.focus();
            }, 100);
        };
    }

    const btnToggleAdminPwd = document.getElementById('btn-toggle-admin-pwd');
    const adminAuthPwdInput = document.getElementById('admin-auth-password');
    if (btnToggleAdminPwd && adminAuthPwdInput) {
        btnToggleAdminPwd.onclick = () => {
            if (adminAuthPwdInput.type === 'password') {
                adminAuthPwdInput.type = 'text';
                btnToggleAdminPwd.innerHTML = '<i class="fa-solid fa-eye-slash"></i> ซ่อนรหัส';
            } else {
                adminAuthPwdInput.type = 'password';
                btnToggleAdminPwd.innerHTML = '<i class="fa-regular fa-eye"></i> แสดงรหัส';
            }
        };
    }

    const btnAdminAuthSubmit = document.getElementById('btn-admin-auth-submit');
    if (btnAdminAuthSubmit) {
        btnAdminAuthSubmit.onclick = handleAdminAuthSubmit;
    }

    const adminAuthUserInput = document.getElementById('admin-auth-username');
    if (adminAuthUserInput) {
        adminAuthUserInput.addEventListener('keypress', (e) => {
            if (e.key === 'Enter') handleAdminAuthSubmit();
        });
    }
    if (adminAuthPwdInput) {
        adminAuthPwdInput.addEventListener('keypress', (e) => {
            if (e.key === 'Enter') handleAdminAuthSubmit();
        });
    }

    const adminSearchInput = document.getElementById('admin-search-users');
    if (adminSearchInput) {
        adminSearchInput.addEventListener('input', () => {
            loadAndRenderAdminUsers(adminSearchInput.value);
        });
    }

    const btnAdminRefresh = document.getElementById('btn-admin-refresh-users');
    if (btnAdminRefresh) {
        btnAdminRefresh.onclick = () => {
            loadAndRenderAdminUsers(adminSearchInput ? adminSearchInput.value : '');
        };
    }

    // 7. Logout Button
    const btnLogout = document.getElementById('btn-logout');
    if (btnLogout) {
        btnLogout.onclick = () => {
            if (confirm('คุณต้องการออกจากระบบใช่หรือไม่?')) {
                handleLogout();
            }
        };
    }
}

async function handleAdminAuthSubmit() {
    const uInput = document.getElementById('admin-auth-username');
    const pInput = document.getElementById('admin-auth-password');
    const errBox = document.getElementById('admin-auth-error');
    const errText = document.getElementById('admin-auth-error-text');

    const username = uInput ? uInput.value.trim().toLowerCase() : '';
    const password = pInput ? pInput.value : '';

    if (!username || !password) {
        if (errBox && errText) {
            errText.textContent = 'กรุณากรอกชื่อผู้ใช้และรหัสผ่าน admin';
            errBox.classList.remove('hidden');
        } else {
            alert('กรุณากรอกชื่อผู้ใช้และรหัสผ่าน admin');
        }
        return;
    }

    // Check credentials (admin / 12345)
    let isAdminValid = false;

    // Check against configured/online users or default
    let users = [];
    if (window.location.protocol.startsWith('http')) {
        try {
            const res = await fetch('/api/auth/users');
            if (res.ok) {
                const json = await res.json();
                if (json.success && Array.isArray(json.users)) {
                    users = json.users;
                    saveLocalUsers(users);
                }
            }
        } catch (e) {}
    }
    if (users.length === 0) {
        users = getLocalUsers();
    }

    const adminUser = users.find(u => u.username.toLowerCase() === 'admin');
    if (adminUser) {
        if (username === 'admin' && password === adminUser.password) {
            isAdminValid = true;
        }
    } else {
        if (username === 'admin' && password === '12345') {
            isAdminValid = true;
        }
    }

    if (!isAdminValid) {
        if (errBox && errText) {
            errText.textContent = 'ชื่อผู้ใช้หรือรหัสผ่าน admin ไม่ถูกต้อง!';
            errBox.classList.remove('hidden');
        } else {
            alert('ชื่อผู้ใช้หรือรหัสผ่าน admin ไม่ถูกต้อง!');
        }
        return;
    }

    // Admin verified! Close auth prompt and open admin panel
    closeModal('modal-admin-auth');
    if (errBox) errBox.classList.add('hidden');
    openModal('modal-admin-panel');
    loadAndRenderAdminUsers(document.getElementById('admin-search-users')?.value || '');
}

async function handleLogin() {
    const uInput = document.getElementById('login-username');
    const pInput = document.getElementById('login-password');
    if (!uInput || !pInput) return;

    const username = uInput.value.trim();
    const password = pInput.value;
    if (!username || !password) {
        alert('กรุณากรอกชื่อผู้ใช้งานและรหัสผ่าน');
        return;
    }

    // Try online users first if available
    let user = null;
    if (window.location.protocol.startsWith('http')) {
        try {
            const res = await fetch('/api/auth/users');
            if (res.ok) {
                const json = await res.json();
                if (json.success && Array.isArray(json.users)) {
                    saveLocalUsers(json.users);
                    user = json.users.find(u => u.username.toLowerCase() === username.toLowerCase());
                }
            }
        } catch (e) {
            console.warn('Could not fetch online users, falling back to local:', e);
        }
    }

    if (!user) {
        const localList = getLocalUsers();
        user = localList.find(u => u.username.toLowerCase() === username.toLowerCase());
    }

    if (!user) {
        alert('ไม่พบชื่อผู้ใช้งานนี้ในระบบ หรือพิมพ์ชื่อผู้ใช้ผิด');
        return;
    }

    if (user.password !== password) {
        alert('รหัสผ่านไม่ถูกต้อง กรุณาลองใหม่อีกครั้ง');
        return;
    }

    if (user.status === 'suspended') {
        alert('บัญชีผู้ใช้งานของคุณถูกระงับการเข้าใช้งานชั่วคราว\nกรุณาติดต่อผู้ดูแลระบบ (Admin)');
        return;
    }

    // Login successful - save to session only (must log in again after browser closes)
    setCurrentUser(user);
    loadUserData(user.username);
    updateUserNavUI();
    switchView('semesters');

    if (window.location.protocol.startsWith('http')) {
        doCloudSync(false);
    }
}

async function handleRegister() {
    const uInput = document.getElementById('reg-username');
    const dInput = document.getElementById('reg-dept-name');
    const pInput = document.getElementById('reg-password');
    const cpInput = document.getElementById('reg-confirm-password');

    if (!uInput || !pInput || !cpInput) return;
    const username = uInput.value.trim();
    const deptName = dInput ? dInput.value.trim() : '';
    const password = pInput.value;
    const confirmPassword = cpInput.value;

    if (!username || username.length < 3) {
        alert('กรุณาระบุชื่อผู้ใช้งานอย่างน้อย 3 ตัวอักษร (ภาษาอังกฤษหรือตัวเลข)');
        return;
    }
    if (!/^[a-zA-Z0-9_-]+$/.test(username)) {
        alert('ชื่อผู้ใช้งานต้องเป็นตัวอักษรภาษาอังกฤษ ตัวเลข หรือขีด (-) เท่านั้น');
        return;
    }
    if (['admin', 'civilutc', 'api', 'sync'].includes(username.toLowerCase())) {
        alert('ชื่อผู้ใช้งานนี้ถูกสงวนไว้ ไม่สามารถสมัครได้');
        return;
    }
    if (!password || password.length < 4) {
        alert('กรุณากำหนดรหัสผ่านอย่างน้อย 4 ตัวอักษร');
        return;
    }
    if (password !== confirmPassword) {
        alert('รหัสผ่านและการยืนยันรหัสผ่านไม่ตรงกัน');
        return;
    }

    // Check existing
    const localUsers = getLocalUsers();
    const existsLocal = localUsers.some(u => u.username.toLowerCase() === username.toLowerCase());
    if (existsLocal) {
        alert('ชื่อผู้ใช้งานนี้มีอยู่ในระบบแล้ว กรุณาใช้ชื่ออื่น');
        return;
    }

    const newUser = {
        username: username,
        password: password,
        name: deptName || username,
        role: 'user',
        createdAt: new Date().toISOString()
    };

    // Try online registration
    if (window.location.protocol.startsWith('http')) {
        try {
            const res = await fetch('/api/auth/users', {
                method: 'POST',
                headers: { 'Content-Type': 'application/json' },
                body: JSON.stringify(newUser)
            });
            const json = await res.json();
            if (!res.ok || !json.success) {
                if (json.message && json.message.includes('มีผู้ใช้นี้อยู่แล้ว')) {
                    alert('ชื่อผู้ใช้งานนี้มีอยู่ในระบบแล้ว กรุณาใช้ชื่ออื่น');
                    return;
                }
            }
        } catch (e) {
            console.warn('Online registration request failed, continuing locally:', e);
        }
    }

    // Save locally
    localUsers.push(newUser);
    saveLocalUsers(localUsers);

    // Initialize clean user data: empty subjects, empty students, empty terms, but 163 teachers
    const newUserData = createEmptyUserData(newUser.username, newUser.name);
    localStorage.setItem(getUserStorageKey(newUser.username), JSON.stringify(newUserData));

    // Auto login
    setCurrentUser(newUser);
    loadUserData(newUser.username);
    updateUserNavUI();
    switchView('semesters');

    // Push new clean data online if possible
    if (window.location.protocol.startsWith('http')) {
        doCloudPush(false);
    }

    alert(`ยินดีต้อนรับคุณ "${newUser.name}"!\nสมัครสมาชิกสำเร็จ เข้าสู่ระบบเรียบร้อยแล้ว\n(รายชื่ออาจารย์ทั้งหมดพร้อมใช้งาน คุณสามารถเพิ่มรายวิชาของแผนกได้ทันที)`);
}

function handleLogout() {
    currentUser = null;
    sessionStorage.removeItem('teaching_fee_current_user');
    localStorage.removeItem('teaching_fee_remembered_user');
    updateUserNavUI();
    switchView('login');
}

async function loadAndRenderAdminUsers(filterText = '') {
    const tbody = document.getElementById('admin-users-tbody');
    if (!tbody) return;

    tbody.innerHTML = `<tr><td colspan="6" class="text-center py-6 text-gray-400"><i class="fa-solid fa-spinner fa-spin text-blue-400 mr-2"></i> กำลังโหลดข้อมูลบัญชีผู้ใช้...</td></tr>`;

    let users = [];
    if (window.location.protocol.startsWith('http')) {
        try {
            const res = await fetch('/api/auth/users');
            if (res.ok) {
                const json = await res.json();
                if (json.success && Array.isArray(json.users)) {
                    users = json.users;
                    saveLocalUsers(users);
                }
            }
        } catch (e) {
            console.warn('Admin user list fetch failed:', e);
        }
    }

    if (users.length === 0) {
        users = getLocalUsers();
    }

    const filtered = users.filter(u => {
        if (!filterText) return true;
        const q = filterText.toLowerCase();
        return (u.username && u.username.toLowerCase().includes(q)) ||
               (u.name && u.name.toLowerCase().includes(q)) ||
               (u.password && u.password.toLowerCase().includes(q));
    });

    if (filtered.length === 0) {
        tbody.innerHTML = `<tr><td colspan="6" class="text-center py-6 text-gray-500">ไม่พบบัญชีผู้ใช้ที่ตรงกับคำค้นหา</td></tr>`;
        return;
    }

    tbody.innerHTML = filtered.map((u, idx) => {
        const isCivil = u.username === 'civilutc';
        const isAdmin = u.username === 'admin';
        const isSuspended = u.status === 'suspended';
        const createdStr = u.createdAt ? new Date(u.createdAt).toLocaleDateString('th-TH') : '-';
        
        return `
            <tr class="hover:bg-[#1f2639] transition ${isSuspended ? 'bg-red-950/20 opacity-80' : ''}">
                <td class="py-3 px-3 text-gray-400">${idx + 1}</td>
                <td class="py-3 px-3">
                    <div class="font-bold text-white flex items-center gap-1.5">
                        ${isAdmin ? '<i class="fa-solid fa-crown text-amber-400"></i>' : '<i class="fa-solid fa-user text-blue-400"></i>'}
                        <span>${escapeHtml(u.username)}</span>
                        ${isCivil ? '<span class="text-[10px] bg-blue-500/20 text-blue-300 px-1.5 py-0.5 rounded border border-blue-500/30">โยธา</span>' : ''}
                        ${isAdmin ? '<span class="text-[10px] bg-amber-500/20 text-amber-300 px-1.5 py-0.5 rounded border border-amber-500/30">Admin</span>' : ''}
                    </div>
                </td>
                <td class="py-3 px-3">
                    <div class="flex items-center gap-2">
                        <span class="font-mono text-xs font-semibold px-2 py-0.5 rounded bg-[#101322] border border-amber-500/30 text-amber-300 select-all">
                            ${escapeHtml(u.password || '')}
                        </span>
                        <button type="button" onclick="navigator.clipboard.writeText('${escapeHtml(u.password || '')}'); alert('คัดลอกรหัสผ่าน ${escapeHtml(u.password || '')} แล้ว!');" class="text-gray-400 hover:text-white p-1 rounded hover:bg-[#2d3748] transition cursor-pointer" title="คัดลอกรหัสผ่าน">
                            <i class="fa-regular fa-copy"></i>
                        </button>
                    </div>
                </td>
                <td class="py-3 px-3 text-gray-300">
                    <div>${escapeHtml(u.name || '-')}</div>
                </td>
                <td class="py-3 px-3 text-center">
                    ${isSuspended 
                        ? '<span class="px-2 py-0.5 rounded-full text-[10px] font-bold bg-red-500/20 text-red-300 border border-red-500/30"><i class="fa-solid fa-ban mr-1"></i>ถูกระงับ</span>'
                        : '<span class="px-2 py-0.5 rounded-full text-[10px] font-bold bg-emerald-500/20 text-emerald-300 border border-emerald-500/30"><i class="fa-solid fa-check mr-1"></i>ปกติ</span>'
                    }
                </td>
                <td class="py-3 px-3 text-gray-400 text-[11px]">${createdStr}</td>
                <td class="py-3 px-3 text-center">
                    <div class="flex items-center justify-center flex-wrap gap-1">
                        <button type="button" onclick="adminSwitchToUser('${escapeHtml(u.username)}')" class="bg-blue-600/20 hover:bg-blue-600/40 text-blue-300 border border-blue-500/30 px-2 py-1 rounded text-xs transition cursor-pointer flex items-center gap-1" title="สลับไปดูข้อมูลของบัญชีนี้">
                            <i class="fa-solid fa-eye text-[11px]"></i> ดูข้อมูล
                        </button>
                        ${!isAdmin ? `
                            <button type="button" onclick="adminResetUserData('${escapeHtml(u.username)}')" class="bg-amber-600/20 hover:bg-amber-600/40 text-amber-300 border border-amber-500/30 px-2 py-1 rounded text-xs transition cursor-pointer flex items-center gap-1" title="ลบข้อมูลทั้งหมดที่กรอกไว้ (เทอม/รายวิชา/นักศึกษา) แต่เก็บบัญชีไว้">
                                <i class="fa-solid fa-eraser text-[11px]"></i> ลบข้อมูลที่กรอก
                            </button>
                            <button type="button" onclick="adminToggleSuspendUser('${escapeHtml(u.username)}', ${isSuspended ? 'true' : 'false'})" class="${isSuspended ? 'bg-emerald-600/20 hover:bg-emerald-600/40 text-emerald-300 border-emerald-500/30' : 'bg-rose-600/20 hover:bg-rose-600/40 text-rose-300 border-rose-500/30'} border px-2 py-1 rounded text-xs transition cursor-pointer flex items-center gap-1" title="${isSuspended ? 'ยกเลิกระงับการใช้งาน' : 'ระงับการเข้าสู่ระบบ'}">
                                <i class="fa-solid ${isSuspended ? 'fa-unlock' : 'fa-ban'} text-[11px]"></i> ${isSuspended ? 'ปลดระงับ' : 'ระงับสิทธิ์'}
                            </button>
                        ` : ''}
                        ${(!isAdmin && !isCivil) ? `
                            <button type="button" onclick="adminDeleteUser('${escapeHtml(u.username)}')" class="bg-red-600/20 hover:bg-red-600/40 text-red-300 border border-red-500/30 px-2 py-1 rounded text-xs transition cursor-pointer flex items-center gap-1" title="ลบบัญชีผู้ใช้นี้ออกจากระบบอย่างถาวร">
                                <i class="fa-solid fa-trash-can text-[11px]"></i> ลบบัญชี
                            </button>
                        ` : ''}
                    </div>
                </td>
            </tr>
        `;
    }).join('');
}

window.adminSwitchToUser = function(username) {
    const users = getLocalUsers();
    const targetUser = users.find(u => u.username === username);
    if (!targetUser) return alert('ไม่พบข้อมูลบัญชีผู้ใช้');
    
    if (confirm(`คุณต้องการสลับไปใช้งานในมุมมองของบัญชี "${username}" ใช่หรือไม่?`)) {
        setCurrentUser(targetUser);
        loadUserData(username);
        updateUserNavUI();
        closeModal('modal-admin-panel');
        switchView('semesters');
        if (window.location.protocol.startsWith('http')) {
            doCloudSync(false);
        }
    }
};

window.adminResetUserData = async function(username) {
    if (username === 'admin') return alert('บัญชี admin ไม่มีข้อมูลการเบิกจ่าย');
    
    if (!confirm(`คุณต้องการ "ลบข้อมูลที่กรอกทั้งหมด" ของบัญชี "${username}" ใช่หรือไม่?\n(ข้อมูลภาคเรียน, รายวิชาที่เพิ่ม, ข้อมูลนักศึกษา และใบเบิกทั้งหมดจะถูกรีเซ็ตเป็นค่าเริ่มต้นว่างเปล่า แต่บัญชีและรหัสผ่านจะยังอยู่)`)) {
        return;
    }

    // 1. Reset Cloud Data
    if (window.location.protocol.startsWith('http')) {
        try {
            await fetch('/api/auth/users', {
                method: 'PUT',
                headers: { 'Content-Type': 'application/json' },
                body: JSON.stringify({ username: username, action: 'reset_data' })
            });
        } catch (e) {
            console.warn('Online reset user data failed:', e);
        }
    }

    // 2. Reset Local Data
    const users = getLocalUsers();
    const targetUser = users.find(u => u.username === username);
    const emptyData = createEmptyUserData(username, targetUser ? targetUser.name : username);
    const key = getUserStorageKey(username);
    localStorage.setItem(key, JSON.stringify(emptyData));
    if (username === 'civilutc') {
        localStorage.setItem('teachingFeeData', JSON.stringify(emptyData));
    }

    // If currently operating under this user, reload
    if (currentUser && currentUser.username === username) {
        loadUserData(username);
        if (currentView === 'semesters') renderSemestersView();
    }

    alert(`ล้างข้อมูลที่กรอกทั้งหมดของ "${username}" เรียบร้อยแล้ว!`);
};

window.adminToggleSuspendUser = async function(username, currentlySuspended) {
    if (username === 'admin') return alert('ไม่สามารถระงับบัญชี admin ได้');
    const newStatus = currentlySuspended ? 'active' : 'suspended';
    const actionText = currentlySuspended ? 'ยกเลิกระงับการใช้งาน' : 'ระงับการเข้าใช้งาน';

    if (!confirm(`คุณต้องการ "${actionText}" บัญชี "${username}" ใช่หรือไม่?`)) {
        return;
    }

    // 1. Online update
    if (window.location.protocol.startsWith('http')) {
        try {
            await fetch('/api/auth/users', {
                method: 'PUT',
                headers: { 'Content-Type': 'application/json' },
                body: JSON.stringify({ username: username, status: newStatus })
            });
        } catch (e) {
            console.warn('Online toggle user status failed:', e);
        }
    }

    // 2. Local update
    let users = getLocalUsers();
    const user = users.find(u => u.username === username);
    if (user) {
        user.status = newStatus;
        saveLocalUsers(users);
    }

    loadAndRenderAdminUsers(document.getElementById('admin-search-users')?.value || '');
    alert(`ดำเนินการ "${actionText}" บัญชี "${username}" เรียบร้อยแล้ว!`);
};

window.adminDeleteUser = async function(username) {
    if (username === 'admin' || username === 'civilutc') {
        alert('ไม่สามารถลบบัญชีหลักของระบบได้');
        return;
    }
    if (!confirm(`คุณแน่ใจหรือไม่ว่าต้องการลบบัญชี "${username}"? ข้อมูลและบัญชีทั้งหมดจะถูกลบถาวร`)) {
        return;
    }

    if (window.location.protocol.startsWith('http')) {
        try {
            await fetch(`/api/auth/users?username=${encodeURIComponent(username)}`, {
                method: 'DELETE'
            });
        } catch (e) {
            console.warn('Online user deletion failed:', e);
        }
    }

    let users = getLocalUsers().filter(u => u.username !== username);
    saveLocalUsers(users);
    localStorage.removeItem(getUserStorageKey(username));

    loadAndRenderAdminUsers(document.getElementById('admin-search-users')?.value || '');
    alert(`ลบบัญชี "${username}" เรียบร้อยแล้ว`);
};

function initTabs() {
    document.querySelectorAll('.tab-btn').forEach(btn => {
        btn.addEventListener('click', (e) => {
            const targetBtn = e.target.closest('.tab-btn');
            if (!targetBtn) return;
            // Remove active from all btns
            document.querySelectorAll('.tab-btn').forEach(b => {
                b.classList.remove('active', 'text-blue-400', 'border-blue-500', 'border-b-2');
                b.classList.add('text-gray-400');
            });
            // Add active to clicked
            targetBtn.classList.add('active', 'text-blue-400', 'border-blue-500', 'border-b-2');
            targetBtn.classList.remove('text-gray-400');
            
            // Hide all contents
            document.querySelectorAll('.tab-content').forEach(c => c.classList.add('hidden'));
            // Show target
            const tabId = targetBtn.getAttribute('data-tab');
            const targetContent = document.getElementById(tabId);
            if (targetContent) targetContent.classList.remove('hidden');
        });
    });
}

// Settings CRUD
let currentEditingItem = null;
let currentEditingType = null; // 'teacher', 'subject', 'student'

function initSettingsCRUD() {
    // Add New Buttons
    document.getElementById('btn-open-add-teacher').addEventListener('click', () => openEditModal('teacher', null));
    document.getElementById('btn-open-add-subject').addEventListener('click', () => openEditModal('subject', null));
    document.getElementById('btn-open-add-student').addEventListener('click', () => openEditModal('student', null));
    
    // Search Inputs
    document.getElementById('search-teacher').addEventListener('input', renderSettingsLists);
    document.getElementById('search-subject').addEventListener('input', renderSettingsLists);
    document.getElementById('search-student').addEventListener('input', renderSettingsLists);
    
    // Confirm Edit / Add button
    document.getElementById('btn-confirm-edit').addEventListener('click', () => {
        const isNew = !currentEditingItem;
        
        if (currentEditingType === 'teacher') {
            const name = document.getElementById('edit-teacher-name').value;
            if(!name) return;
            if (isNew) appData.teachers.push({ id: generateId(), name });
            else currentEditingItem.name = name;
            
        } else if (currentEditingType === 'subject') {
            const code = document.getElementById('edit-sub-code').value.trim();
            const name = document.getElementById('edit-sub-name').value.trim();
            const credits = parseInt(document.getElementById('edit-sub-credits').value) || 3;
            const theoryHours = parseFloat(document.getElementById('edit-sub-theory').value) || 0;
            const practiceHours = parseFloat(document.getElementById('edit-sub-practice').value) || 0;
            const selfHours = parseFloat(document.getElementById('edit-sub-self').value) || 0;
            const hours = parseFloat(document.getElementById('edit-sub-hours').value) || (theoryHours + practiceHours);
            if(!code || !name) {
                alert('กรุณากรอกรหัสวิชาและชื่อรายวิชา');
                return;
            }
            if (isNew) {
                appData.subjects_master.push({ 
                    id: generateId(), 
                    code, 
                    name, 
                    credits, 
                    theoryHours, 
                    practiceHours, 
                    selfHours, 
                    hours 
                });
            } else {
                currentEditingItem.code = code;
                currentEditingItem.name = name;
                currentEditingItem.credits = credits;
                currentEditingItem.theoryHours = theoryHours;
                currentEditingItem.practiceHours = practiceHours;
                currentEditingItem.selfHours = selfHours;
                currentEditingItem.hours = hours;
            }
            
        } else if (currentEditingType === 'student') {
            const studentId = document.getElementById('edit-stu-id').value;
            const name = document.getElementById('edit-stu-name').value;
            if(!studentId || !name) return;
            if (isNew) appData.students.push({ id: generateId(), studentId, name });
            else {
                currentEditingItem.studentId = studentId;
                currentEditingItem.name = name;
            }
        }
        
        saveData();
        renderSettingsLists();
        closeModal('modal-edit-item');
    });

    // Sync all files button
    const btnSync = document.getElementById('btn-sync-all-files');
    if (btnSync) {
        btnSync.addEventListener('click', () => {
            if (confirm('ยืนยันโหลดข้อมูลทั้งหมดจากไฟล์ใหม่หรือไม่?\n(ระบบจะนำเข้าข้อมูลอาจารย์ทั้งหมด 273 ท่าน และรายวิชา ป.ตรี ทั้งหมด 28 วิชาเข้ามาในระบบ)')) {
                syncAllExtractedData(true);
                renderSettingsLists();
                alert(`โหลดข้อมูลสำเร็จเรียบร้อย!\n- รายชื่ออาจารย์: ${appData.teachers.length} ท่าน\n- รายวิชา Master: ${appData.subjects_master.length} วิชา`);
            }
        });
    }
}

function openEditModal(type, item) {
    currentEditingType = type;
    currentEditingItem = item;
    const isNew = !item;
    
    const title = document.getElementById('edit-modal-title');
    const body = document.getElementById('edit-modal-body');
    
    if (type === 'teacher') {
        title.innerHTML = `<i class="fa-solid fa-chalkboard-user mr-2 text-blue-400"></i> ${isNew ? 'เพิ่มชื่ออาจารย์ใหม่' : 'แก้ไขชื่ออาจารย์'}`;
        body.innerHTML = `
            <div>
                <label class="block text-sm text-gray-400 mb-1">ชื่อ-สกุล</label>
                <input type="text" id="edit-teacher-name" class="w-full p-2 rounded-lg text-sm border-blue-500/50" value="${isNew ? '' : item.name}" placeholder="เช่น นายสมชาย ใจดี">
            </div>
        `;
    } else if (type === 'subject') {
        const creditsVal = isNew ? 3 : (item.credits !== undefined ? item.credits : 3);
        const theoryVal = isNew ? 2 : (item.theoryHours !== undefined ? item.theoryHours : 2);
        const practiceVal = isNew ? 2 : (item.practiceHours !== undefined ? item.practiceHours : 0);
        const defaultSelf = Math.max(0, creditsVal * 3 - theoryVal - practiceVal);
        const selfVal = isNew ? 5 : (item.selfHours !== undefined ? item.selfHours : defaultSelf);
        const hoursVal = isNew ? (theoryVal + practiceVal) : (item.hours !== undefined ? item.hours : (theoryVal + practiceVal));

        title.innerHTML = `<i class="fa-solid fa-book mr-2 text-orange-400"></i> ${isNew ? 'เพิ่มรายวิชาใหม่' : 'แก้ไขรายวิชา'}`;
        body.innerHTML = `
            <div class="space-y-3">
                <div>
                    <label class="block text-xs font-semibold text-gray-300 mb-1">รหัสวิชา</label>
                    <input type="text" id="edit-sub-code" class="w-full p-2.5 rounded-lg text-sm bg-[#0f121d] border border-[#2d3748] focus:border-blue-500 text-white" value="${isNew ? '' : (item.code || '')}" placeholder="เช่น 27-40000-1101">
                </div>
                
                <div>
                    <label class="block text-xs font-semibold text-gray-300 mb-1">ชื่อรายวิชา</label>
                    <input type="text" id="edit-sub-name" class="w-full p-2.5 rounded-lg text-sm bg-[#0f121d] border border-[#2d3748] focus:border-blue-500 text-white" value="${isNew ? '' : (item.name || '')}" placeholder="เช่น การฟังและการพูดภาษาอังกฤษเบื้องต้น">
                </div>
                
                <div class="bg-[#141725] p-3.5 rounded-xl border border-[#2d3748] space-y-2.5">
                    <div class="text-xs font-bold text-orange-400 flex items-center justify-between">
                        <span class="flex items-center gap-1.5"><i class="fa-solid fa-calculator"></i> โครงสร้างหน่วยกิต และชั่วโมงสอน (ท-ป-ศ)</span>
                        <span class="text-[11px] text-gray-400 font-normal">เช่น 3(2-2-5) หรือ 3(3-0-6)</span>
                    </div>
                    
                    <div class="grid grid-cols-4 gap-2">
                        <div>
                            <label class="block text-[11px] text-gray-400 mb-1 text-center font-medium">หน่วยกิต (นก.)</label>
                            <input type="number" id="edit-sub-credits" class="w-full p-2 rounded-lg text-sm bg-[#0f121d] border border-[#2d3748] focus:border-blue-500 text-white text-center font-bold" value="${creditsVal}" min="0" max="20" step="1">
                        </div>
                        <div>
                            <label class="block text-[11px] text-blue-400 mb-1 text-center font-medium">ทฤษฎี (ท)</label>
                            <input type="number" id="edit-sub-theory" class="w-full p-2 rounded-lg text-sm bg-[#0f121d] border border-blue-500/40 focus:border-blue-500 text-blue-300 text-center font-bold" value="${theoryVal}" min="0" max="20" step="1">
                        </div>
                        <div>
                            <label class="block text-[11px] text-emerald-400 mb-1 text-center font-medium">ปฏิบัติ (ป)</label>
                            <input type="number" id="edit-sub-practice" class="w-full p-2 rounded-lg text-sm bg-[#0f121d] border border-emerald-500/40 focus:border-emerald-500 text-emerald-300 text-center font-bold" value="${practiceVal}" min="0" max="20" step="1">
                        </div>
                        <div>
                            <label class="block text-[11px] text-purple-400 mb-1 text-center font-medium">ค้นคว้า (ศ)</label>
                            <input type="number" id="edit-sub-self" class="w-full p-2 rounded-lg text-sm bg-[#0f121d] border border-purple-500/40 focus:border-purple-500 text-purple-300 text-center font-bold" value="${selfVal}" min="0" max="20" step="1">
                        </div>
                    </div>

                    <div class="pt-1">
                        <label class="block text-[11px] text-gray-400 mb-1 font-medium">
                            ชั่วโมงสอนรวม/สัปดาห์ (ท + ป คำนวณอัตโนมัติ)
                        </label>
                        <div class="relative">
                            <input type="number" id="edit-sub-hours" class="w-full p-2.5 rounded-lg text-sm bg-[#0a0d18] border border-blue-500/60 text-blue-300 text-center font-bold text-base" value="${hoursVal}" min="0" max="40" step="1">
                            <span class="absolute right-3 top-3 text-xs text-gray-400">ชั่วโมง/สัปดาห์</span>
                        </div>
                    </div>
                </div>
            </div>
        `;

        setTimeout(() => {
            const inTh = document.getElementById('edit-sub-theory');
            const inPr = document.getElementById('edit-sub-practice');
            const inCr = document.getElementById('edit-sub-credits');
            const inSelf = document.getElementById('edit-sub-self');
            const inHrs = document.getElementById('edit-sub-hours');
            let selfManual = false;
            if (inSelf) inSelf.addEventListener('input', () => { selfManual = true; });

            const recalc = () => {
                const th = parseFloat(inTh?.value) || 0;
                const pr = parseFloat(inPr?.value) || 0;
                const cr = parseFloat(inCr?.value) || 0;
                if (inHrs) inHrs.value = th + pr;
                if (inSelf && !selfManual) {
                    inSelf.value = Math.max(0, (cr * 3) - th - pr);
                }
            };
            if (inTh) inTh.addEventListener('input', recalc);
            if (inPr) inPr.addEventListener('input', recalc);
            if (inCr) inCr.addEventListener('input', recalc);
        }, 50);
    } else if (type === 'student') {
        title.innerHTML = `<i class="fa-solid fa-user mr-2 text-green-400"></i> ${isNew ? 'เพิ่มนักศึกษาใหม่' : 'แก้ไขรายชื่อนักศึกษา'}`;
        body.innerHTML = `
            <div>
                <label class="block text-sm text-gray-400 mb-1">รหัส นศ.</label>
                <input type="text" id="edit-stu-id" class="w-full p-2 rounded-lg text-sm mb-2" value="${isNew ? '' : item.studentId}" placeholder="เช่น 65301...">
                
                <label class="block text-sm text-gray-400 mb-1">ชื่อ-สกุล นักศึกษา</label>
                <input type="text" id="edit-stu-name" class="w-full p-2 rounded-lg text-sm" value="${isNew ? '' : item.name}" placeholder="เช่น นางสาวสมศรี...">
            </div>
        `;
    }
    
    // ตั้งเวลาให้โฟกัสที่ช่องแรกอัตโนมัติ
    setTimeout(() => {
        const firstInput = body.querySelector('input');
        if(firstInput) firstInput.focus();
    }, 100);
    
    openModal('modal-edit-item');
}

let selectedTeacherSettingsIds = new Set();
let selectedSubjectSettingsIds = new Set();
let selectedStudentSettingsIds = new Set();
let settingsBatchEventsInitialized = false;

function initSettingsBatchEvents() {
    if (settingsBatchEventsInitialized) return;
    settingsBatchEventsInitialized = true;

    // Teachers Batch Delete
    const chkAllTeachers = document.getElementById('chk-all-teachers');
    const btnDelTeachers = document.getElementById('btn-delete-selected-teachers');
    if (chkAllTeachers) {
        chkAllTeachers.addEventListener('change', () => {
            const qTeacher = (document.getElementById('search-teacher')?.value || '').toLowerCase();
            const filtered = (appData.teachers || []).filter(t => (t.name || '').toLowerCase().includes(qTeacher));
            if (chkAllTeachers.checked) {
                filtered.forEach(t => selectedTeacherSettingsIds.add(t.id));
            } else {
                filtered.forEach(t => selectedTeacherSettingsIds.delete(t.id));
            }
            renderSettingsLists();
        });
    }
    if (btnDelTeachers) {
        btnDelTeachers.addEventListener('click', () => {
            const count = selectedTeacherSettingsIds.size;
            if (count === 0) return;
            if (confirm(`ยืนยันการลบอาจารย์ที่เลือกทั้งหมด ${count} ท่านหรือไม่?`)) {
                appData.teachers = (appData.teachers || []).filter(t => !selectedTeacherSettingsIds.has(t.id));
                selectedTeacherSettingsIds.clear();
                saveData();
                renderSettingsLists();
                if (typeof triggerAutoCloudSync === 'function') triggerAutoCloudSync();
            }
        });
    }

    // Subjects Batch Delete
    const chkAllSubjects = document.getElementById('chk-all-subjects');
    const btnDelSubjects = document.getElementById('btn-delete-selected-subjects');
    if (chkAllSubjects) {
        chkAllSubjects.addEventListener('change', () => {
            const qSubject = (document.getElementById('search-subject')?.value || '').toLowerCase();
            const filtered = (appData.subjects_master || []).filter(s => 
                (s.name || '').toLowerCase().includes(qSubject) || (s.code || '').toLowerCase().includes(qSubject)
            );
            if (chkAllSubjects.checked) {
                filtered.forEach(s => selectedSubjectSettingsIds.add(s.id));
            } else {
                filtered.forEach(s => selectedSubjectSettingsIds.delete(s.id));
            }
            renderSettingsLists();
        });
    }
    if (btnDelSubjects) {
        btnDelSubjects.addEventListener('click', () => {
            const count = selectedSubjectSettingsIds.size;
            if (count === 0) return;
            if (confirm(`ยืนยันการลบรายวิชา Master ที่เลือกทั้งหมด ${count} วิชาหรือไม่?`)) {
                appData.subjects_master = (appData.subjects_master || []).filter(s => !selectedSubjectSettingsIds.has(s.id));
                selectedSubjectSettingsIds.clear();
                saveData();
                renderSettingsLists();
                if (typeof triggerAutoCloudSync === 'function') triggerAutoCloudSync();
            }
        });
    }

    // Students Batch Delete
    const chkAllStudents = document.getElementById('chk-all-students');
    const btnDelStudents = document.getElementById('btn-delete-selected-students');
    if (chkAllStudents) {
        chkAllStudents.addEventListener('change', () => {
            const qStudent = (document.getElementById('search-student')?.value || '').toLowerCase();
            const filtered = (appData.students || []).filter(st => 
                (st.name || '').toLowerCase().includes(qStudent) || (st.studentId || '').toLowerCase().includes(qStudent)
            );
            if (chkAllStudents.checked) {
                filtered.forEach(st => selectedStudentSettingsIds.add(st.id));
            } else {
                filtered.forEach(st => selectedStudentSettingsIds.delete(st.id));
            }
            renderSettingsLists();
        });
    }
    if (btnDelStudents) {
        btnDelStudents.addEventListener('click', () => {
            const count = selectedStudentSettingsIds.size;
            if (count === 0) return;
            if (confirm(`ยืนยันการลบรายชื่อนักศึกษาที่เลือกทั้งหมด ${count} คนหรือไม่?`)) {
                appData.students = (appData.students || []).filter(st => !selectedStudentSettingsIds.has(st.id));
                selectedStudentSettingsIds.clear();
                saveData();
                renderSettingsLists();
                if (typeof triggerAutoCloudSync === 'function') triggerAutoCloudSync();
            }
        });
    }
}

function renderSettingsLists() {
    updateTabCounts();
    initSettingsBatchEvents();
    const qTeacher = (document.getElementById('search-teacher').value || '').toLowerCase();
    const qSubject = (document.getElementById('search-subject').value || '').toLowerCase();
    const qStudent = (document.getElementById('search-student').value || '').toLowerCase();

    const createListItem = (id, text, isSelected, onToggle, onDelete, onEdit) => {
        const li = document.createElement('li');
        li.className = `flex justify-between items-center p-2 rounded-lg border transition cursor-pointer select-none ${
            isSelected ? 'bg-blue-950/40 border-blue-500/50 text-white' : 'bg-[#141725] border-[#2d3748] hover:border-[#3f4b61] text-gray-200'
        }`;
        li.innerHTML = `
            <div class="flex items-center gap-2.5 flex-1 min-w-0 pr-2">
                <input type="checkbox" class="w-4 h-4 rounded text-blue-600 bg-[#0f121d] border-gray-600 cursor-pointer pointer-events-none" ${isSelected ? 'checked' : ''}>
                <div class="flex-1 min-w-0">${text}</div>
            </div>
            <div class="flex items-center gap-1.5 ml-2 shrink-0">
                <button type="button" class="btn-edit bg-blue-900/30 text-blue-400 hover:text-blue-300 hover:bg-blue-900/50 p-1.5 rounded transition cursor-pointer" title="แก้ไข"><i class="fa-solid fa-pen-to-square"></i></button>
                <button type="button" class="btn-delete bg-red-900/30 text-gray-400 hover:text-red-400 hover:bg-red-900/50 p-1.5 rounded transition cursor-pointer" title="ลบ"><i class="fa-solid fa-trash-can"></i></button>
            </div>
        `;
        li.addEventListener('click', (e) => {
            if (e.target.closest('.btn-edit') || e.target.closest('.btn-delete')) return;
            onToggle();
        });
        li.querySelector('.btn-delete').addEventListener('click', (e) => {
            e.stopPropagation();
            onDelete();
        });
        li.querySelector('.btn-edit').addEventListener('click', (e) => {
            e.stopPropagation();
            onEdit();
        });
        return li;
    };

    // 1. Teachers
    const lt = document.getElementById('list-teachers');
    lt.innerHTML = '';
    const filteredTeachers = (appData.teachers || []).filter(t => (t.name || '').toLowerCase().includes(qTeacher));
    filteredTeachers.forEach(t => {
        const isSelected = selectedTeacherSettingsIds.has(t.id);
        const text = `<span class="text-sm font-medium">${t.name}</span>`;
        lt.appendChild(createListItem(
            t.id,
            text,
            isSelected,
            () => {
                if (selectedTeacherSettingsIds.has(t.id)) selectedTeacherSettingsIds.delete(t.id);
                else selectedTeacherSettingsIds.add(t.id);
                renderSettingsLists();
            },
            () => {
                if (confirm(`ยืนยันการลบอาจารย์ "${t.name}"?`)) {
                    appData.teachers = appData.teachers.filter(x => x.id !== t.id);
                    selectedTeacherSettingsIds.delete(t.id);
                    saveData();
                    renderSettingsLists();
                    if (typeof triggerAutoCloudSync === 'function') triggerAutoCloudSync();
                }
            },
            () => openEditModal('teacher', t)
        ));
    });
    if (filteredTeachers.length === 0) lt.innerHTML = '<li class="text-center text-gray-500 text-sm py-4">ไม่พบข้อมูลอาจารย์</li>';

    // 2. Subjects
    const ls = document.getElementById('list-subjects');
    ls.innerHTML = '';
    const filteredSubjects = (appData.subjects_master || []).filter(s => 
        (s.name || '').toLowerCase().includes(qSubject) || (s.code || '').toLowerCase().includes(qSubject)
    );
    filteredSubjects.forEach(s => {
        const isSelected = selectedSubjectSettingsIds.has(s.id);
        const th = s.theoryHours !== undefined ? s.theoryHours : 0;
        const pr = s.practiceHours !== undefined ? s.practiceHours : 0;
        const se = s.selfHours !== undefined ? s.selfHours : Math.max(0, (s.credits || 3) * 3 - th - pr);
        const hrs = s.hours || (th + pr);
        
        let text = `<div class="flex flex-col sm:flex-row sm:items-center justify-between gap-1.5 flex-1 pr-2">
            <div>
                <strong class="text-blue-300 font-mono text-xs font-semibold">[${s.code}]</strong>
                <span class="text-sm ml-1 text-white font-medium">${s.name}</span>
            </div>
            <div class="flex items-center gap-1.5 flex-shrink-0">
                <span class="text-[11px] bg-blue-950/60 text-blue-300 px-2 py-0.5 rounded border border-blue-500/30 font-bold whitespace-nowrap">
                    ${s.credits !== undefined ? s.credits : 3} นก.
                </span>
                <span class="text-[11px] bg-orange-950/60 text-orange-300 px-2 py-0.5 rounded border border-orange-500/30 font-medium whitespace-nowrap">
                    ท-ป-ศ: ${th}-${pr}-${se}
                </span>
                <span class="text-[11px] bg-emerald-950/60 text-emerald-300 px-2 py-0.5 rounded border border-emerald-500/30 font-medium whitespace-nowrap">
                    สอน ${hrs} ชม.
                </span>
            </div>
        </div>`;
        ls.appendChild(createListItem(
            s.id,
            text,
            isSelected,
            () => {
                if (selectedSubjectSettingsIds.has(s.id)) selectedSubjectSettingsIds.delete(s.id);
                else selectedSubjectSettingsIds.add(s.id);
                renderSettingsLists();
            },
            () => {
                if (confirm(`ยืนยันการลบรายวิชา "[${s.code}] ${s.name}"?`)) {
                    appData.subjects_master = appData.subjects_master.filter(x => x.id !== s.id);
                    selectedSubjectSettingsIds.delete(s.id);
                    saveData();
                    renderSettingsLists();
                    if (typeof triggerAutoCloudSync === 'function') triggerAutoCloudSync();
                }
            },
            () => openEditModal('subject', s)
        ));
    });
    if (filteredSubjects.length === 0) ls.innerHTML = '<li class="text-center text-gray-500 text-sm py-4">ไม่พบข้อมูลรายวิชา</li>';

    // 3. Students
    const lstu = document.getElementById('list-students');
    lstu.innerHTML = '';
    const filteredStudents = (appData.students || []).filter(st => 
        (st.name || '').toLowerCase().includes(qStudent) || (st.studentId || '').toLowerCase().includes(qStudent)
    );
    filteredStudents.forEach(st => {
        const isSelected = selectedStudentSettingsIds.has(st.id);
        const text = `
            <div class="flex items-center gap-2">
                <span class="text-xs font-mono text-blue-400 font-semibold">${st.studentId || 'ไม่มีรหัส'}</span>
                <span class="text-sm font-medium text-white">${st.name}</span>
            </div>
        `;
        lstu.appendChild(createListItem(
            st.id,
            text,
            isSelected,
            () => {
                if (selectedStudentSettingsIds.has(st.id)) selectedStudentSettingsIds.delete(st.id);
                else selectedStudentSettingsIds.add(st.id);
                renderSettingsLists();
            },
            () => {
                if (confirm(`ยืนยันการลบรายชื่อนักศึกษา "${st.name}"?`)) {
                    appData.students = appData.students.filter(x => x.id !== st.id);
                    selectedStudentSettingsIds.delete(st.id);
                    saveData();
                    renderSettingsLists();
                    if (typeof triggerAutoCloudSync === 'function') triggerAutoCloudSync();
                }
            },
            () => openEditModal('student', st)
        ));
    });
    if (filteredStudents.length === 0) lstu.innerHTML = '<li class="text-center text-gray-500 text-sm py-4">ไม่พบข้อมูลนักศึกษา</li>';

    // Update Toolbar Batch Counters & States
    const countTeachers = selectedTeacherSettingsIds.size;
    const countSubjects = selectedSubjectSettingsIds.size;
    const countStudents = selectedStudentSettingsIds.size;

    const countSelT = document.getElementById('count-selected-teachers');
    const btnDelTNum = document.getElementById('btn-delete-teachers-num');
    const btnDelT = document.getElementById('btn-delete-selected-teachers');
    const chkAllT = document.getElementById('chk-all-teachers');
    if (countSelT) countSelT.textContent = countTeachers;
    if (btnDelTNum) btnDelTNum.textContent = countTeachers;
    if (btnDelT) btnDelT.disabled = (countTeachers === 0);
    if (chkAllT) chkAllT.checked = (filteredTeachers.length > 0 && filteredTeachers.every(t => selectedTeacherSettingsIds.has(t.id)));

    const countSelS = document.getElementById('count-selected-subjects');
    const btnDelSNum = document.getElementById('btn-delete-subjects-num');
    const btnDelS = document.getElementById('btn-delete-selected-subjects');
    const chkAllS = document.getElementById('chk-all-subjects');
    if (countSelS) countSelS.textContent = countSubjects;
    if (btnDelSNum) btnDelSNum.textContent = countSubjects;
    if (btnDelS) btnDelS.disabled = (countSubjects === 0);
    if (chkAllS) chkAllS.checked = (filteredSubjects.length > 0 && filteredSubjects.every(s => selectedSubjectSettingsIds.has(s.id)));

    const countSelStu = document.getElementById('count-selected-students');
    const btnDelStuNum = document.getElementById('btn-delete-students-num');
    const btnDelStu = document.getElementById('btn-delete-selected-students');
    const chkAllStu = document.getElementById('chk-all-students');
    if (countSelStu) countSelStu.textContent = countStudents;
    if (btnDelStuNum) btnDelStuNum.textContent = countStudents;
    if (btnDelStu) btnDelStu.disabled = (countStudents === 0);
    if (chkAllStu) chkAllStu.checked = (filteredStudents.length > 0 && filteredStudents.every(st => selectedStudentSettingsIds.has(st.id)));
}

// =========================================================================
// CLAIM FORM MODULE (แบบฟอร์มเบิกรายบุคคล ป.ตรี รายวิชา RC & Live A4 Preview)
// =========================================================================

// Thai Baht Text Converter
function thaiBahtText(num) {
    if (num === null || num === undefined || isNaN(num)) return 'ศูนย์บาทถ้วน';
    const n = parseFloat(num);
    if (n === 0) return 'ศูนย์บาทถ้วน';
    
    const formatted = Math.abs(n).toFixed(2);
    const [intPart, decPart] = formatted.split('.');
    
    const digits = ['ศูนย์', 'หนึ่ง', 'สอง', 'สาม', 'สี่', 'ห้า', 'หก', 'เจ็ด', 'แปด', 'เก้า'];
    const units = ['', 'สิบ', 'ร้อย', 'พัน', 'หมื่น', 'แสน'];
    
    function convertGroup(str) {
        let res = '';
        const len = str.length;
        for (let i = 0; i < len; i++) {
            const d = parseInt(str[i]);
            const pos = len - i - 1;
            if (d !== 0) {
                if (pos === 1 && d === 1) {
                    res += 'สิบ';
                } else if (pos === 1 && d === 2) {
                    res += 'ยี่สิบ';
                } else if (pos === 0 && d === 1 && len > 1 && str[len - 2] !== '0') {
                    res += 'เอ็ด';
                } else {
                    res += digits[d] + units[pos];
                }
            }
        }
        return res;
    }

    let bahtText = '';
    let remaining = intPart;
    let millionGroups = [];
    while (remaining.length > 6) {
        millionGroups.unshift(remaining.slice(-6));
        remaining = remaining.slice(0, -6);
    }
    millionGroups.unshift(remaining);

    for (let g = 0; g < millionGroups.length; g++) {
        const groupText = convertGroup(millionGroups[g]);
        if (groupText) {
            bahtText += groupText + (g < millionGroups.length - 1 ? 'ล้าน' : '');
        }
    }

    let result = (n < 0 ? 'ลบ' : '') + bahtText + 'บาท';
    const decNum = parseInt(decPart);
    if (decNum === 0) {
        result += 'ถ้วน';
    } else {
        result += convertGroup(decPart) + 'สตางค์';
    }
    return result;
}

// Thai Date Helpers
const THAI_MONTHS_FULL = ['มกราคม', 'กุมภาพันธ์', 'มีนาคม', 'เมษายน', 'พฤษภาคม', 'มิถุนายน', 'กรกฎาคม', 'สิงหาคม', 'กันยายน', 'ตุลาคม', 'พฤศจิกายน', 'ธันวาคม'];
const THAI_MONTHS_SHORT = ['ม.ค.', 'ก.พ.', 'มี.ค.', 'เม.ย.', 'พ.ค.', 'มิ.ย.', 'ก.ค.', 'ส.ค.', 'ก.ย.', 'ต.ค.', 'พ.ย.', 'ธ.ค.'];

function formatThaiDateFull(dateObjOrStr) {
    if (!dateObjOrStr) return '';
    const d = new Date(dateObjOrStr);
    if (isNaN(d.getTime())) return dateObjOrStr;
    const day = d.getDate();
    const month = THAI_MONTHS_FULL[d.getMonth()];
    const year = d.getFullYear() + 543;
    return `${day} เดือน ${month} พ.ศ. ${year}`;
}

function formatThaiDateShort(dateObjOrStr) {
    if (!dateObjOrStr) return '';
    const d = new Date(dateObjOrStr);
    if (isNaN(d.getTime())) return dateObjOrStr;
    const day = d.getDate();
    const month = THAI_MONTHS_SHORT[d.getMonth()];
    const year = (d.getFullYear() + 543).toString().slice(-2);
    return `${day} ${month} ${year}`;
}

// Convert ISO (YYYY-MM-DD) or Date to Thai BE string "DD/MM/YYYY" (เช่น 29/05/2569)
function formatThaiBEDate(dateObjOrStr) {
    if (!dateObjOrStr) return '';
    const d = new Date(dateObjOrStr);
    if (isNaN(d.getTime())) return '';
    const dd = String(d.getDate()).padStart(2, '0');
    const mm = String(d.getMonth() + 1).padStart(2, '0');
    const yyyy = d.getFullYear() + 543;
    return `${dd}/${mm}/${yyyy}`;
}

// Convert Thai BE string "DD/MM/YYYY" (เช่น 29/05/2569) to ISO "YYYY-MM-DD"
function parseThaiBEToISO(thaiStr) {
    if (!thaiStr) return null;
    const clean = thaiStr.trim().replace(/-/g, '/');
    const parts = clean.split('/');
    if (parts.length !== 3) return null;
    const d = parseInt(parts[0]);
    const m = parseInt(parts[1]);
    let y = parseInt(parts[2]);
    if (isNaN(d) || isNaN(m) || isNaN(y)) return null;
    if (d < 1 || d > 31 || m < 1 || m > 12) return null;
    
    // If year is BE (e.g. 2568, 2569) convert to CE
    if (y > 2400) {
        y = y - 543;
    }
    const iso = `${y}-${String(m).padStart(2, '0')}-${String(d).padStart(2, '0')}`;
    const testDate = new Date(iso);
    if (isNaN(testDate.getTime())) return null;
    return iso;
}

// Parse various Thai Date strings ("3 พ.ย. 68", "03/11/2568", "2025-11-03") to JS Date
function parseThaiDateShort(thaiStr) {
    if (!thaiStr || typeof thaiStr !== 'string') return null;
    const clean = thaiStr.trim();
    if (!clean) return null;

    // Check ISO (YYYY-MM-DD)
    if (/^\d{4}-\d{2}-\d{2}$/.test(clean)) {
        const parts = clean.split('-');
        return new Date(parseInt(parts[0]), parseInt(parts[1]) - 1, parseInt(parts[2]), 12, 0, 0);
    }

    // Check DD/MM/YYYY or DD-MM-YYYY
    const slashParts = clean.replace(/-/g, '/').split('/');
    if (slashParts.length === 3) {
        const d = parseInt(slashParts[0]);
        const m = parseInt(slashParts[1]);
        let y = parseInt(slashParts[2]);
        if (!isNaN(d) && !isNaN(m) && !isNaN(y)) {
            if (y > 2400) y -= 543;
            else if (y < 100) y += 2000;
            return new Date(y, m - 1, d, 12, 0, 0);
        }
    }

    // Check "3 พ.ย. 68" or "03 พ.ย. 2568" or "3 พฤศจิกายน 2568"
    const spaceParts = clean.split(/\s+/);
    if (spaceParts.length >= 3) {
        const d = parseInt(spaceParts[0]);
        const mStr = spaceParts[1];
        let y = parseInt(spaceParts[2]);
        if (!isNaN(d) && !isNaN(y)) {
            let mIdx = THAI_MONTHS_SHORT.indexOf(mStr);
            if (mIdx === -1) mIdx = THAI_MONTHS_FULL.indexOf(mStr);
            if (mIdx !== -1) {
                if (y < 100) y += 2500;
                const ceYear = y > 2400 ? y - 543 : y;
                return new Date(ceYear, mIdx, d, 12, 0, 0);
            }
        }
    }

    const testD = new Date(clean);
    if (!isNaN(testD.getTime())) {
        testD.setHours(12, 0, 0, 0);
        return testD;
    }
    return null;
}

// Check if a holiday reason string matches official public holidays
function isKnownThaiHolidayReason(reason) {
    if (!reason || typeof reason !== 'string') return false;
    const r = reason.trim();
    if (!r) return false;
    for (const k in FIXED_THAI_HOLIDAYS) {
        if (FIXED_THAI_HOLIDAYS[k] && (r.includes(FIXED_THAI_HOLIDAYS[k]) || FIXED_THAI_HOLIDAYS[k].includes(r))) return true;
    }
    for (const k in LUNAR_THAI_HOLIDAYS) {
        if (LUNAR_THAI_HOLIDAYS[k] && (r.includes(LUNAR_THAI_HOLIDAYS[k]) || LUNAR_THAI_HOLIDAYS[k].includes(r))) return true;
    }
    const keywords = ['วันพ่อ', 'วันแม่', 'วันขึ้นปีใหม่', 'วันสิ้นปี', 'วันรัฐธรรมนูญ', 'วันสงกรานต์', 'วันจักรี', 'วันมาฆบูชา', 'วันวิสาขบูชา', 'วันอาสาฬหบูชา', 'วันเข้าพรรษา', 'วันปิยมหาราช', 'วันนวมินทร', 'ชดเชย', 'วันหยุด'];
    return keywords.some(kw => r.includes(kw));
}

// Official Thai Public Holidays (วันหยุดราชการไทย)
const FIXED_THAI_HOLIDAYS = {
    "01-01": "วันขึ้นปีใหม่",
    "04-06": "วันจักรี",
    "04-13": "วันสงกรานต์",
    "04-14": "วันสงกรานต์",
    "04-15": "วันสงกรานต์",
    "05-04": "วันฉัตรมงคล",
    "06-03": "วันเฉลิมฯ พระราชินี",
    "07-28": "วันเฉลิมฯ ร.10",
    "08-12": "วันแม่แห่งชาติ",
    "10-13": "วันนวมินทรมหาราช",
    "10-23": "วันปิยมหาราช",
    "12-05": "วันพ่อแห่งชาติ (วันชาติ)",
    "12-10": "วันรัฐธรรมนูญ",
    "12-31": "วันสิ้นปี"
};

// Variable Lunar & Official Thai Government Holidays (2024 - 2030)
const LUNAR_THAI_HOLIDAYS = {
    // 2024 / 2567
    "2024-02-24": "วันมาฆบูชา",
    "2024-02-26": "ชดเชยวันมาฆบูชา",
    "2024-04-08": "ชดเชยวันจักรี",
    "2024-04-16": "ชดเชยวันสงกรานต์",
    "2024-05-06": "ชดเชยวันฉัตรมงคล",
    "2024-05-10": "วันพืชมงคล",
    "2024-05-22": "วันวิสาขบูชา",
    "2024-07-20": "วันอาสาฬหบูชา",
    "2024-07-21": "วันเข้าพรรษา",
    "2024-07-22": "ชดเชยวันอาสาฬหบูชา/เข้าพรรษา",
    "2024-07-29": "ชดเชยวันเฉลิมฯ ร.10",
    "2024-10-14": "ชดเชยวันนวมินทรมหาราช",
    "2024-12-30": "วันหยุดพิเศษ ครม.",

    // 2025 / 2568
    "2025-01-02": "วันหยุดพิเศษ ครม.",
    "2025-02-12": "วันมาฆบูชา",
    "2025-04-07": "ชดเชยวันจักรี",
    "2025-04-16": "ชดเชยวันสงกรานต์",
    "2025-05-05": "ชดเชยวันฉัตรมงคล",
    "2025-05-09": "วันพืชมงคล",
    "2025-05-11": "วันวิสาขบูชา",
    "2025-05-12": "ชดเชยวันวิสาขบูชา",
    "2025-07-10": "วันอาสาฬหบูชา",
    "2025-07-11": "วันเข้าพรรษา",
    "2025-10-13": "วันนวมินทรมหาราช",
    "2025-10-23": "วันปิยมหาราช",
    "2025-12-05": "วันพ่อแห่งชาติ (วันชาติ)",
    "2025-12-10": "วันรัฐธรรมนูญ",
    "2025-12-31": "วันสิ้นปี",

    // 2026 / 2569
    "2026-01-02": "วันหยุดพิเศษ ครม.",
    "2026-03-03": "วันมาฆบูชา",
    "2026-04-06": "วันจักรี",
    "2026-04-13": "วันสงกรานต์",
    "2026-04-14": "วันสงกรานต์",
    "2026-04-15": "วันสงกรานต์",
    "2026-05-04": "วันฉัตรมงคล",
    "2026-05-15": "วันพืชมงคล",
    "2026-05-31": "วันวิสาขบูชา",
    "2026-06-01": "ชดเชยวันวิสาขบูชา",
    "2026-06-03": "วันเฉลิมฯ พระราชินี",
    "2026-07-28": "วันเฉลิมฯ ร.10",
    "2026-07-29": "วันอาสาฬหบูชา",
    "2026-07-30": "วันเข้าพรรษา",
    "2026-08-12": "วันแม่แห่งชาติ",
    "2026-10-13": "วันนวมินทรมหาราช",
    "2026-10-23": "วันปิยมหาราช",
    "2026-12-07": "ชดเชยวันพ่อแห่งชาติ",
    "2026-12-10": "วันรัฐธรรมนูญ",
    "2026-12-31": "วันสิ้นปี",

    // 2027 / 2570
    "2027-02-21": "วันมาฆบูชา",
    "2027-02-22": "ชดเชยวันมาฆบูชา",
    "2027-04-06": "วันจักรี",
    "2027-05-04": "วันฉัตรมงคล",
    "2027-05-20": "วันวิสาขบูชา",
    "2027-06-03": "วันเฉลิมฯ พระราชินี",
    "2027-07-18": "วันอาสาฬหบูชา",
    "2027-07-19": "วันเข้าพรรษา / ชดเชย",
    "2027-07-28": "วันเฉลิมฯ ร.10",
    "2027-08-12": "วันแม่แห่งชาติ",
    "2027-10-13": "วันนวมินทรมหาราช",
    "2027-10-25": "ชดเชยวันปิยมหาราช",
    "2027-12-06": "ชดเชยวันพ่อแห่งชาติ",

    // 2028 / 2571
    "2028-02-10": "วันมาฆบูชา",
    "2028-04-06": "วันจักรี",
    "2028-05-04": "วันฉัตรมงคล",
    "2028-05-08": "วันวิสาขบูชา",
    "2028-06-03": "วันเฉลิมฯ พระราชินี",
    "2028-06-05": "ชดเชยวันเฉลิมฯ พระราชินี",
    "2028-07-06": "วันอาสาฬหบูชา",
    "2028-07-07": "วันเข้าพรรษา",
    "2028-07-28": "วันเฉลิมฯ ร.10",
    "2028-08-12": "วันแม่แห่งชาติ",
    "2028-08-14": "ชดเชยวันแม่แห่งชาติ",
    "2028-10-13": "วันนวมินทรมหาราช",
    "2028-10-23": "วันปิยมหาราช",
    "2028-12-05": "วันพ่อแห่งชาติ (วันชาติ)"
};

function getThaiHoliday(dateObjOrStr) {
    if (!dateObjOrStr) return null;
    const d = new Date(dateObjOrStr);
    if (isNaN(d.getTime())) return null;

    const yyyy = d.getFullYear();
    const mm = String(d.getMonth() + 1).padStart(2, '0');
    const dd = String(d.getDate()).padStart(2, '0');
    const fullIso = `${yyyy}-${mm}-${dd}`;
    const md = `${mm}-${dd}`;

    if (LUNAR_THAI_HOLIDAYS[fullIso]) {
        return { name: LUNAR_THAI_HOLIDAYS[fullIso] };
    }
    if (FIXED_THAI_HOLIDAYS[md]) {
        return { name: FIXED_THAI_HOLIDAYS[md] };
    }

    // Check Monday substitutions if holiday fell on Sat/Sun
    if (d.getDay() === 1) {
        const sun = new Date(d);
        sun.setDate(d.getDate() - 1);
        const sunMD = `${String(sun.getMonth() + 1).padStart(2, '0')}-${String(sun.getDate()).padStart(2, '0')}`;
        if (FIXED_THAI_HOLIDAYS[sunMD]) {
            return { name: `ชดเชย${FIXED_THAI_HOLIDAYS[sunMD]}` };
        }
        const sat = new Date(d);
        sat.setDate(d.getDate() - 2);
        const satMD = `${String(sat.getMonth() + 1).padStart(2, '0')}-${String(sat.getDate()).padStart(2, '0')}`;
        if (FIXED_THAI_HOLIDAYS[satMD]) {
            return { name: `ชดเชย${FIXED_THAI_HOLIDAYS[satMD]}` };
        }
    }

    return null;
}

// ย่อชื่อวันหยุดให้สั้นลงไม่เกิน 2 บรรทัด
function shortenHolidayName(name) {
    if (!name) return "";
    let str = name.trim();

    const dict = [
        { pattern: /วันคล้ายวันพระบรมราชสมภพ.*วันพ่อแห่งชาติ/i, rep: "วันพ่อแห่งชาติ (วันชาติ)" },
        { pattern: /วันคล้ายวันสวรรคต.*มหาภูมิพลอดุลยเดชมหาราช/i, rep: "วันนวมินทรมหาราช (ร.9)" },
        { pattern: /วันเฉลิมพระชนมพรรษา.*พระวชิรเกล้าเจ้าอยู่หัว/i, rep: "วันเฉลิมฯ ร.10" },
        { pattern: /วันเฉลิมพระชนมพรรษา.*พระเจ้าอยู่หัว/i, rep: "วันเฉลิมฯ ร.10" },
        { pattern: /วันเฉลิมพระชนมพรรษา.*พันปีหลวง.*วันแม่/i, rep: "วันแม่แห่งชาติ" },
        { pattern: /วันเฉลิมพระชนมพรรษา.*พระบรมราชินีนาถ/i, rep: "วันแม่แห่งชาติ" },
        { pattern: /วันเฉลิมพระชนมพรรษา.*พระบรมราชินี/i, rep: "วันเฉลิมฯ พระราชินี" },
        { pattern: /วันพระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช.*มหาจักรีบรมราชวงศ์/i, rep: "วันจักรี" },
        { pattern: /พระราชพิธีพืชมงคลจรดพระนังคัลแรกนาขวัญ/i, rep: "วันพืชมงคล" }
    ];

    for (const item of dict) {
        if (item.pattern.test(str)) {
            str = item.rep;
            break;
        }
    }

    if (str.length > 30) {
        str = str.slice(0, 28) + '...';
    }
    return str;
}

// Default RC Benchmark Data (ตรงตาม เบิกรายบุคคล ป.ตรี รายวิชา RC.pdf ทุกตัวอักษร)
const DEFAULT_RC_CLAIM = {
    level: "ชั้นปี 1",
    academicYear: "1/68",
    curriculum: "หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ",
    department: "เทคโนโลยีโยธา",
    teacherName: "นายณัฐวรรธน์ เกษกุล",
    teacherRole: "อาจารย์ผู้สอน",
    subjectCode: "27-40121-2106",
    subjectName: "การออกแบบโครงสร้างคอนกรีตเสริมเหล็ก",
    weeklyHours: 3,
    credits: 3,
    timeStr: "17.00-20.00",
    rate: 42,
    percent: 60,
    startDate: "2025-06-02",
    endDateThai: "29 เดือน กันยายน พ.ศ. 2568",
    teachingDaysPerWeek: 1,
    totalWeeks: 18,
    teachingDays: [
        { dow: "1", time: "17.00-20.00", hours: 3 }
    ],
    day1DOW: "1",
    day1Time: "17.00-20.00",
    day1Hours: 3,
    day2DOW: "2",
    day2Time: "17.00-20.00",
    day2Hours: 3,
    summerTableLayout: "side_by_side",
    weeks: [
        { weekNo: 1, dayNo: 1, sessionNo: 1, dateStr: "2 มิ.ย. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 2, dayNo: 1, sessionNo: 2, dateStr: "9 มิ.ย. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 3, dayNo: 1, sessionNo: 3, dateStr: "16 มิ.ย. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 4, dayNo: 1, sessionNo: 4, dateStr: "23 มิ.ย. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 5, dayNo: 1, sessionNo: 5, dateStr: "30 มิ.ย. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 6, dayNo: 1, sessionNo: 6, dateStr: "7 ก.ค. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 7, dayNo: 1, sessionNo: 7, dateStr: "14 ก.ค. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 8, dayNo: 1, sessionNo: 8, dateStr: "21 ก.ค. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 9, dayNo: 1, sessionNo: 9, dateStr: "28 ก.ค. 68", timeStr: "17.00-20.00", theoryHrs: 0, practiceHrs: 0, totalHrs: 0, isHoliday: true, holidayReason: "วันเฉลิมฯ ร.10" },
        { weekNo: 10, dayNo: 1, sessionNo: 10, dateStr: "4 ส.ค. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 11, dayNo: 1, sessionNo: 11, dateStr: "11 ส.ค. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 12, dayNo: 1, sessionNo: 12, dateStr: "18 ส.ค. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 13, dayNo: 1, sessionNo: 13, dateStr: "25 ส.ค. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 14, dayNo: 1, sessionNo: 14, dateStr: "1 ก.ย. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 15, dayNo: 1, sessionNo: 15, dateStr: "8 ก.ย. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 16, dayNo: 1, sessionNo: 16, dateStr: "15 ก.ย. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 17, dayNo: 1, sessionNo: 17, dateStr: "22 ก.ย. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" },
        { weekNo: 18, dayNo: 1, sessionNo: 18, dateStr: "29 ก.ย. 68", timeStr: "17.00-20.00", theoryHrs: 3, practiceHrs: 0, totalHrs: 3, isHoliday: false, holidayReason: "" }
    ],
    students: [
        { studentId: "68401211001", name: "นายวัชรายุทธ", surname: "นิพระขัน" },
        { studentId: "68401211002", name: "นางสาวกัญญาวีร์", surname: "ศรีอักษร" },
        { studentId: "68401211003", name: "นางสาวษาวิณีย์", surname: "วันดี" },
        { studentId: "68401211004", name: "นายบัณฑิต", surname: "นาทัน" },
        { studentId: "68401211005", name: "นางสาวนันทนา", surname: "สนธิไชย" },
        { studentId: "68401211006", name: "นายธนาดุล", surname: "ศิริแก้ว" }
    ],
    signatures: {
        teacher: "นายณัฐวรรธน์ เกษกุล",
        teacherRole: "อาจารย์ผู้สอน",
        programChair: "นายปริวัฒน์ ยืนยิ่ง",
        programChairRole: "ประธานหลักสูตรสาขาวิชาเทคโนโลยีโยธา",
        curriculumHead: "นายชนะ สุทธิประภา",
        curriculumHeadRole: "หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ",
        deptHead: "นายปริวัฒน์ ยืนยิ่ง",
        deptHeadRole: "หัวหน้าสาขาวิชาเทคโนโลยีโยธา",
        techHead: "นายสถิระ กาญจันดา",
        techHeadRole: "หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต",
        academicDeputy: "นายสุวิชา มั่นยืน",
        academicDeputyRole: "รองผู้อำนวยการฝ่ายวิชาการ",
        financeHead: "นางมลีทอง จารุพงษ์",
        financeHeadRole: "หัวหน้าการเงิน",
        resourceDeputy: "นางสาวสายฝน สาระผล",
        resourceDeputyRole: "รองผู้อำนวยการฝ่ายบริหารทรัพยากร",
        director: "นายธาตรี พิบูลมณฑา",
        directorRole: "ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี"
    }
};

// Global Active Claim Data
let activeClaim = null;
let activeSubjectRef = null;

// -------------------------------------------------------------------------
// SIGNATURES 2-9 DEFAULT INHERITANCE SYSTEM
// -------------------------------------------------------------------------
function getFormattedDeptRole(deptName, roleType = 'deptHead') {
    let d = (deptName || '').trim();
    if (!d) d = 'เทคโนโลยีโยธา';
    if (d.startsWith('สาขาวิชา')) {
        d = d.replace(/^สาขาวิชา/, '').trim();
    } else if (d.startsWith('สาขา')) {
        d = d.replace(/^สาขา/, '').trim();
    }
    if (!d.startsWith('เทคโนโลยี')) {
        d = 'เทคโนโลยี' + d;
    }
    if (roleType === 'programChair') {
        return `ประธานหลักสูตรสาขาวิชา${d}`;
    }
    return `หัวหน้าสาขาวิชา${d}`;
}

function extractSignatures2To9(sig, deptName = '') {
    if (!sig) return {};
    return {
        programChair: sig.programChair || '',
        programChairRole: sig.programChairRole || getFormattedDeptRole(deptName, 'programChair'),
        curriculumHead: sig.curriculumHead || '',
        curriculumHeadRole: sig.curriculumHeadRole || 'หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ',
        deptHead: sig.deptHead || '',
        deptHeadRole: sig.deptHeadRole || getFormattedDeptRole(deptName, 'deptHead'),
        techHead: sig.techHead || '',
        techHeadRole: sig.techHeadRole || 'หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต',
        academicDeputy: sig.academicDeputy || '',
        academicDeputyRole: sig.academicDeputyRole || 'รองผู้อำนวยการฝ่ายวิชาการ',
        financeHead: sig.financeHead || '',
        financeHeadRole: sig.financeHeadRole || 'หัวหน้าการเงิน',
        resourceDeputy: sig.resourceDeputy || '',
        resourceDeputyRole: sig.resourceDeputyRole || 'รองผู้อำนวยการฝ่ายบริหารทรัพยากร',
        director: sig.director || '',
        directorRole: sig.directorRole || 'ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี'
    };
}

function getDefaultSignatures2To9() {
    // 1. Check if already saved in appData
    if (typeof appData !== 'undefined' && appData && appData.defaultSignatures2To9) {
        const d = appData.defaultSignatures2To9;
        if (d.director || d.academicDeputy || d.deptHead || d.programChair || d.curriculumHead) {
            return JSON.parse(JSON.stringify(d));
        }
    }

    // 2. Pull from the first created term (appData.terms[0])
    if (typeof appData !== 'undefined' && appData && appData.terms && appData.terms.length > 0) {
        const firstTerm = appData.terms[0];
        if (firstTerm && firstTerm.subjects) {
            for (const sub of firstTerm.subjects) {
                if (sub.claimData && sub.claimData.signatures) {
                    const s = sub.claimData.signatures;
                    if (s.director || s.academicDeputy || s.deptHead || s.programChair || s.curriculumHead) {
                        const extracted = extractSignatures2To9(s);
                        appData.defaultSignatures2To9 = extracted;
                        if (typeof saveData === 'function') saveData();
                        return JSON.parse(JSON.stringify(extracted));
                    }
                }
            }
        }

        // Fallback: check any term
        for (const t of appData.terms) {
            if (t.subjects) {
                for (const sub of t.subjects) {
                    if (sub.claimData && sub.claimData.signatures) {
                        const s = sub.claimData.signatures;
                        if (s.director || s.academicDeputy || s.deptHead || s.programChair || s.curriculumHead) {
                            const extracted = extractSignatures2To9(s);
                            appData.defaultSignatures2To9 = extracted;
                            if (typeof saveData === 'function') saveData();
                            return JSON.parse(JSON.stringify(extracted));
                        }
                    }
                }
            }
        }
    }

    // 3. Fallback to DEFAULT_RC_CLAIM
    const fallback = extractSignatures2To9(typeof DEFAULT_RC_CLAIM !== 'undefined' ? DEFAULT_RC_CLAIM.signatures : null);
    if (typeof appData !== 'undefined' && appData) {
        appData.defaultSignatures2To9 = fallback;
        if (typeof saveData === 'function') saveData();
    }
    return JSON.parse(JSON.stringify(fallback));
}

function updateDefaultSignatures2To9(sig) {
    if (typeof appData === 'undefined' || !appData) return;
    if (!appData.defaultSignatures2To9) {
        appData.defaultSignatures2To9 = getDefaultSignatures2To9();
    }
    const keys = [
        'programChair', 'programChairRole',
        'curriculumHead', 'curriculumHeadRole',
        'deptHead', 'deptHeadRole',
        'techHead', 'techHeadRole',
        'academicDeputy', 'academicDeputyRole',
        'financeHead', 'financeHeadRole',
        'resourceDeputy', 'resourceDeputyRole',
        'director', 'directorRole'
    ];
    keys.forEach(k => {
        if (sig && sig[k] !== undefined) {
            appData.defaultSignatures2To9[k] = sig[k];
        }
    });
    if (typeof saveData === 'function') saveData();
}

function saveActiveClaim() {
    if (typeof activeSubjectRef !== 'undefined' && activeSubjectRef && typeof activeClaim !== 'undefined' && activeClaim) {
        activeSubjectRef.claimData = JSON.parse(JSON.stringify(activeClaim));
    }
    if (typeof saveData === 'function') saveData();
}


// Ensure teachingDays array is structured properly for any daysPerWeek (1..7)
function ensureTeachingDays(claim = activeClaim) {
    if (!claim) return;
    const n = Math.max(1, Math.min(7, parseInt(claim.teachingDaysPerWeek) || 1));
    claim.teachingDaysPerWeek = n;
    claim.totalWeeks = Math.ceil(18 / n);

    if (!Array.isArray(claim.teachingDays)) {
        claim.teachingDays = [];
    }

    const defaultDows = ["1", "2", "3", "4", "5", "6", "0"]; // Mon to Sun
    const defaultTime = claim.timeStr || "17.00-20.00";
    const defaultHrs = claim.weeklyHours || 3;

    while (claim.teachingDays.length < n) {
        const i = claim.teachingDays.length;
        let dow = defaultDows[i % 7];
        let time = defaultTime;
        let hrs = defaultHrs;
        if (i === 0 && claim.day1DOW !== undefined) {
            dow = claim.day1DOW;
            time = claim.day1Time || defaultTime;
            hrs = claim.day1Hours || defaultHrs;
        } else if (i === 1 && claim.day2DOW !== undefined) {
            dow = claim.day2DOW;
            time = claim.day2Time || defaultTime;
            hrs = claim.day2Hours || defaultHrs;
        }
        claim.teachingDays.push({
            dow: String(dow),
            time: time,
            hours: parseInt(hrs) || 3
        });
    }

    if (claim.teachingDays.length > n) {
        claim.teachingDays = claim.teachingDays.slice(0, n);
    }
}

// Calculate schedule (18 sessions across totalWeeks) based on start date, days per week, and day configs
function generateScheduleForClaim(claim = activeClaim, preserveExistingHolidays = false, masterSub = null, term = null) {
    if (!claim) return;
    ensureTeachingDays(claim);
    const n = claim.teachingDaysPerWeek || 1;
    const totalWeeks = Math.ceil(18 / n);
    claim.totalWeeks = totalWeeks;

    // Parse start date safely at noon to avoid any timezone/DST drift
    let start = null;
    if (claim.startDate) {
        const parts = claim.startDate.split('-');
        if (parts.length === 3) {
            start = new Date(parseInt(parts[0]), parseInt(parts[1]) - 1, parseInt(parts[2]), 12, 0, 0);
        } else {
            start = new Date(claim.startDate);
            start.setHours(12, 0, 0, 0);
        }
    }
    if (!start || isNaN(start.getTime())) {
        start = new Date(2025, 10, 3, 12, 0, 0); // Default 2025-11-03
    }

    // Map existing manual custom holidays BY DATE (NOT by array index s!)
    // so if slots shift, custom holidays attach to their real date, not fixed in wrong box!
    const customHolidaysByDate = {};
    if (preserveExistingHolidays && claim.weeks && Array.isArray(claim.weeks)) {
        claim.weeks.forEach(w => {
            if (w.isHoliday && w.dateStr && w.holidayReason) {
                customHolidaysByDate[w.dateStr] = w.holidayReason;
                if (w.isoDate) customHolidaysByDate[w.isoDate] = w.holidayReason;
            }
        });
    }

    const newWeeks = [];
    let lastDate = null;

    // Align Day 1 DOW
    const d1Dow = parseInt(claim.teachingDays[0].dow);

    // If start date's day of week does not match Day 1 DOW, shift start date forward to match Day 1 DOW
    if (start.getDay() !== d1Dow) {
        const diff = (d1Dow - start.getDay() + 7) % 7;
        start.setDate(start.getDate() + diff);
        const yyyy = start.getFullYear();
        const mm = String(start.getMonth() + 1).padStart(2, '0');
        const dd = String(start.getDate()).padStart(2, '0');
        claim.startDate = `${yyyy}-${mm}-${dd}`;
        const elStart = document.getElementById('claim-input-start-date');
        if (elStart) elStart.value = claim.startDate;
        const elStartTh = document.getElementById('claim-input-start-date-th');
        if (elStartTh) elStartTh.value = formatThaiBEDate(claim.startDate);
    }

    const mSub = masterSub || (appData.subjects_master || []).find(s => s.code === claim.subjectCode || s.name === claim.subjectName);
    const thHours = (claim.theoryHours !== undefined) ? claim.theoryHours : (mSub && mSub.theoryHours !== undefined ? mSub.theoryHours : 3);
    const prHours = (claim.practiceHours !== undefined) ? claim.practiceHours : (mSub && mSub.practiceHours !== undefined ? mSub.practiceHours : 0);
    claim.theoryHours = thHours;
    claim.practiceHours = prHours;

    // Generate 18 sessions
    for (let s = 0; s < 18; s++) {
        const weekIdx = Math.floor(s / n); // 0-indexed week (0 to totalWeeks - 1)
        const dayIdx = s % n; // 0-indexed day within the week (0 to n - 1)
        const dayConf = claim.teachingDays[dayIdx] || claim.teachingDays[0];
        const targetDow = parseInt(dayConf.dow);

        // Calculate day offset from Day 1 within the same week
        // Order: Mon=1, Tue=2, Wed=3, Thu=4, Fri=5, Sat=6, Sun=7
        const d1Order = d1Dow === 0 ? 7 : d1Dow;
        const targetOrder = targetDow === 0 ? 7 : targetDow;
        let dayOffsetInWeek = targetOrder >= d1Order ? (targetOrder - d1Order) : (targetOrder - d1Order + 7);

        const sessionDate = new Date(start);
        sessionDate.setDate(start.getDate() + (weekIdx * 7) + dayOffsetInWeek);

        const dateStr = formatThaiDateShort(sessionDate);
        const yyyy = sessionDate.getFullYear();
        const mm = String(sessionDate.getMonth() + 1).padStart(2, '0');
        const dd = String(sessionDate.getDate()).padStart(2, '0');
        const isoDate = `${yyyy}-${mm}-${dd}`;

        const hrs = parseInt(dayConf.hours) || parseInt(claim.weeklyHours) || 3;
        const timeStr = dayConf.time || claim.timeStr || "17.00-20.00";

        // Check official Thai public holidays on this session's actual date
        const thaiHoliday = getThaiHoliday(sessionDate);
        let isHoli = false;
        let reason = "";

        if (thaiHoliday) {
            // Official public holiday on this specific date
            isHoli = true;
            reason = shortenHolidayName(thaiHoliday.name);
        } else if (preserveExistingHolidays && (customHolidaysByDate[dateStr] || customHolidaysByDate[isoDate])) {
            // User had manually set a custom holiday on this specific date
            isHoli = true;
            reason = customHolidaysByDate[dateStr] || customHolidaysByDate[isoDate];
        }

        // Check teacher leave / official travel for this teacher and date
        const teacherLeave = getTeacherLeaveForSession(claim, isoDate, term);
        if (teacherLeave) {
            isHoli = true;
            reason = teacherLeave.type || "ไปราชการ";
        }

        let sessionTh = thHours;
        let sessionPr = prHours;
        let sessionTotal = thHours + prHours;

        if (n === 1) {
            sessionTh = thHours;
            sessionPr = prHours;
            sessionTotal = thHours + prHours;
        } else {
            const dayHrs = parseInt(dayConf.hours) || parseInt(claim.weeklyHours) || 3;
            sessionTotal = dayHrs;
            if (thHours + prHours === dayHrs) {
                sessionTh = thHours;
                sessionPr = prHours;
            } else {
                if (dayIdx === 0) {
                    sessionTh = Math.min(dayHrs, thHours);
                    sessionPr = dayHrs - sessionTh;
                } else {
                    sessionPr = Math.min(dayHrs, prHours);
                    sessionTh = dayHrs - sessionPr;
                }
            }
        }

        newWeeks.push({
            weekNo: weekIdx + 1,
            dayNo: dayIdx + 1,
            sessionNo: s + 1,
            dateStr: dateStr,
            isoDate: isoDate,
            timeStr: timeStr,
            theoryHrs: isHoli ? 0 : sessionTh,
            practiceHrs: isHoli ? 0 : sessionPr,
            totalHrs: isHoli ? 0 : sessionTotal,
            isHoliday: isHoli,
            holidayReason: reason
        });

        if (!lastDate || sessionDate > lastDate) {
            lastDate = sessionDate;
        }
    }

    if (lastDate) {
        claim.endDateThai = formatThaiDateFull(lastDate);
    }

    claim.weeks = newWeeks;
}

function recalculateClaimSchedule(preserveExistingHolidays = true) {
    if (!activeClaim) return;
    ensureTeachingDays(activeClaim);
    generateScheduleForClaim(activeClaim, preserveExistingHolidays);
    const elEndDate = document.getElementById('claim-input-end-date');
    if (elEndDate) elEndDate.value = activeClaim.endDateThai;
}

function createInitialSubjectClaimData(term, masterSub, teacher = null) {
    const termYearFull = term ? `${term.no}/${term.year || '2568'}` : '1/2568';
    const c = JSON.parse(JSON.stringify(DEFAULT_RC_CLAIM));
    
    // ข้อ 2-9 ดึงมาจากเทอมแรกที่สร้าง (หรือค่าเริ่มต้นที่จดจำไว้) เสมอ
    const defSig2To9 = getDefaultSignatures2To9();
    if (!c.signatures) c.signatures = {};
    Object.assign(c.signatures, defSig2To9);

    // Check if sibling subject in the same term has settings we should inherit
    const siblingWithClaim = (term && term.subjects) ? term.subjects.find(s => s.claimData && s.claimData.weeks && s.claimData.weeks.length > 0) : null;
    
    if (siblingWithClaim && siblingWithClaim.claimData) {
        const sc = siblingWithClaim.claimData;
        if (sc.startDate) c.startDate = sc.startDate;
        if (sc.endDateThai) c.endDateThai = sc.endDateThai;
        if (sc.curriculum) c.curriculum = sc.curriculum;
        if (sc.department) c.department = sc.department;
        if (sc.level) c.level = sc.level;
        if (sc.teachingDaysPerWeek) c.teachingDaysPerWeek = sc.teachingDaysPerWeek;
        if (sc.totalWeeks) c.totalWeeks = sc.totalWeeks;
        if (sc.teachingDays && Array.isArray(sc.teachingDays)) {
            c.teachingDays = JSON.parse(JSON.stringify(sc.teachingDays));
        }
        if (sc.day1DOW !== undefined) c.day1DOW = sc.day1DOW;
        if (sc.day1Time !== undefined) c.day1Time = sc.day1Time;
        if (sc.day1Hours !== undefined) c.day1Hours = sc.day1Hours;
        if (sc.day2DOW !== undefined) c.day2DOW = sc.day2DOW;
        if (sc.day2Time !== undefined) c.day2Time = sc.day2Time;
        if (sc.day2Hours !== undefined) c.day2Hours = sc.day2Hours;
        if (sc.summerTableLayout) c.summerTableLayout = sc.summerTableLayout;
        if (sc.signatures) {
            const sib2To9 = extractSignatures2To9(sc.signatures, c.department);
            Object.assign(c.signatures, sib2To9);
        }
        if (sc.students && sc.students.length > 0) {
            c.students = JSON.parse(JSON.stringify(sc.students));
        }
    }

    const curDept = c.department || 'เทคโนโลยีโยธา';
    if (!c.signatures.deptHeadRole || (c.signatures.deptHeadRole.includes('โยธา') && !curDept.includes('โยธา'))) {
        c.signatures.deptHeadRole = getFormattedDeptRole(curDept, 'deptHead');
    }
    if (!c.signatures.programChairRole || (c.signatures.programChairRole.includes('โยธา') && !curDept.includes('โยธา'))) {
        c.signatures.programChairRole = getFormattedDeptRole(curDept, 'programChair');
    }

    c.academicYear = termYearFull;
    c.subjectCode = masterSub.code || c.subjectCode;
    c.subjectName = masterSub.name || c.subjectName;
    c.credits = masterSub.credits || 3;
    
    const th = masterSub.theoryHours !== undefined ? masterSub.theoryHours : 3;
    const pr = masterSub.practiceHours !== undefined ? masterSub.practiceHours : 0;
    const weeklyHours = masterSub.hours || (th + pr) || 3;
    c.theoryHours = th;
    c.practiceHours = pr;
    c.weeklyHours = weeklyHours;
    if (c.teachingDays && c.teachingDays[0]) {
        c.teachingDays[0].hours = weeklyHours;
    }
    c.day1Hours = weeklyHours;
    if (weeklyHours === 4 && (c.timeStr === '17.00-20.00' || !c.timeStr || c.day1Time === '17.00-20.00')) {
        c.timeStr = '17.00-21.00';
        c.day1Time = '17.00-21.00';
        if (c.teachingDays && c.teachingDays[0]) c.teachingDays[0].time = '17.00-21.00';
    }
    c.rate = (term && term.hourlyRate) ? term.hourlyRate : 42;

    if (teacher && teacher.name) {
        c.teacherName = teacher.name;
        if (!c.signatures) c.signatures = {};
        c.signatures.teacher = teacher.name;
    } else {
        c.teacherName = '';
        if (c.signatures) delete c.signatures.teacher;
    }

    if ((!c.students || c.students.length === 0) && appData.students && appData.students.length > 0) {
        c.students = appData.students.map(st => {
            const parts = st.name.trim().split(' ');
            return {
                studentId: st.studentId || '',
                name: parts[0] || '',
                surname: parts.slice(1).join(' ') || ''
            };
        });
    }

    generateScheduleForClaim(c, false, masterSub, term);

    return c;
}

// Fallback helper for backward compatibility
function generate18WeeksFromDate(startDateStr, weeklyHours = 3, timeStr = "17.00-20.00") {
    if (activeClaim) {
        activeClaim.startDate = startDateStr;
        activeClaim.timeStr = timeStr;
        activeClaim.weeklyHours = weeklyHours;
        recalculateClaimSchedule(false);
        return activeClaim.weeks;
    }
    return [];
}

// Load and Render Claim Form
function loadAndRenderClaimForm(termId, subjectId) {
    const term = appData.terms.find(t => t.id === termId);
    if (!term) return switchView('semesters');
    
    const sub = term.subjects.find(s => s.id === subjectId);
    if (!sub) return switchView('subjects', termId);
    
    activeSubjectRef = sub;

    const termYearFull = term ? `${term.no}/${term.year || '2568'}` : '1/2568';

    // Load or initialize claimData
    if (sub.claimData) {
        activeClaim = JSON.parse(JSON.stringify(sub.claimData));
        // ซิงค์ปีการศึกษาและระดับชั้น
        if (!activeClaim.academicYear || activeClaim.academicYear === '1/68') {
            activeClaim.academicYear = termYearFull;
            sub.claimData.academicYear = termYearFull;
        }
        if (sub.level && !activeClaim.level) {
            activeClaim.level = sub.level;
            sub.claimData.level = sub.level;
        }
        // ตรวจสอบและดึงลายเซ็นต์ ข้อ 2-9 จากเทอมแรก/ค่าเริ่มต้นหากยังว่างอยู่
        const defSig2To9 = getDefaultSignatures2To9();
        if (!activeClaim.signatures) activeClaim.signatures = {};
        const sigKeys2To9 = ['programChair', 'curriculumHead', 'deptHead', 'techHead', 'academicDeputy', 'financeHead', 'resourceDeputy', 'director'];
        let updatedSigFields = false;
        sigKeys2To9.forEach(k => {
            if (!activeClaim.signatures[k] && defSig2To9[k]) {
                activeClaim.signatures[k] = defSig2To9[k];
                updatedSigFields = true;
            }
            const rk = k + 'Role';
            if (!activeClaim.signatures[rk] && defSig2To9[rk]) {
                activeClaim.signatures[rk] = defSig2To9[rk];
                updatedSigFields = true;
            }
        });

        // อัปเดตชื่อตำแหน่งหัวหน้าสาขา/ประธานหลักสูตร ให้ตรงกับสาขาวิชาของรายวิชานี้โดยอัตโนมัติ
        const curSubjectDept = activeClaim.department || sub.department || 'เทคโนโลยีโยธา';
        const expectedDHRole = getFormattedDeptRole(curSubjectDept, 'deptHead');
        const expectedPCRole = getFormattedDeptRole(curSubjectDept, 'programChair');
        if (!activeClaim.signatures.deptHeadRole || (activeClaim.signatures.deptHeadRole.includes('โยธา') && !curSubjectDept.includes('โยธา'))) {
            activeClaim.signatures.deptHeadRole = expectedDHRole;
            updatedSigFields = true;
        }
        if (!activeClaim.signatures.programChairRole || (activeClaim.signatures.programChairRole.includes('โยธา') && !curSubjectDept.includes('โยธา'))) {
            activeClaim.signatures.programChairRole = expectedPCRole;
            updatedSigFields = true;
        }

        if (updatedSigFields && sub.claimData) {
            sub.claimData.signatures = JSON.parse(JSON.stringify(activeClaim.signatures));
            saveData();
        }

        // ซิงค์ชั่วโมง ท และ ป จากคลังรายวิชา Master
        const masterSub = (appData.subjects_master || []).find(s => s.id === sub.subjectId || s.code === activeClaim.subjectCode || s.name === activeClaim.subjectName);
        if (masterSub) {
            if (activeClaim.theoryHours === undefined) {
                activeClaim.theoryHours = masterSub.theoryHours !== undefined ? masterSub.theoryHours : 3;
            }
            if (activeClaim.practiceHours === undefined) {
                activeClaim.practiceHours = masterSub.practiceHours !== undefined ? masterSub.practiceHours : 0;
            }
            const expectedWeekly = masterSub.hours || (activeClaim.theoryHours + activeClaim.practiceHours);
            if (!activeClaim.weeklyHours || (activeClaim.teachingDaysPerWeek === 1 && activeClaim.weeklyHours !== expectedWeekly && !activeClaim.weeklyHoursCustomized)) {
                activeClaim.weeklyHours = expectedWeekly;
                if (activeClaim.teachingDays && activeClaim.teachingDays[0]) {
                    activeClaim.teachingDays[0].hours = expectedWeekly;
                }
                activeClaim.day1Hours = expectedWeekly;
            }
            if (activeClaim.teachingDaysPerWeek === 1 && activeClaim.weeks && activeClaim.theoryHours !== undefined && activeClaim.practiceHours !== undefined) {
                activeClaim.weeks.forEach(w => {
                    if (!w.isHoliday) {
                        w.theoryHrs = activeClaim.theoryHours;
                        w.practiceHrs = activeClaim.practiceHours;
                        w.totalHrs = activeClaim.theoryHours + activeClaim.practiceHours;
                    }
                });
            }
            sub.claimData = JSON.parse(JSON.stringify(activeClaim));
        }

        // ถ้าผู้ใช้ยังไม่ได้กำหนดอัตราเองเฉพาะวิชานี้ และเทอมมีอัตราคำนวณไว้ ให้นำอัตราเทอมมาใช้
        if (!activeClaim.rateCustomized && term && term.hourlyRate) {
            activeClaim.rate = term.hourlyRate;
            sub.rate = term.hourlyRate;
            sub.claimData.rate = term.hourlyRate;
        }
    } else {
        // Build initial claim data from master catalogue
        const masterSub = (appData.subjects_master || []).find(s => s.id === sub.subjectId) || {};
        const teacher = (appData.teachers || []).find(t => t.id === sub.teacherId) || {};
        activeClaim = createInitialSubjectClaimData(term, masterSub, teacher);
        sub.claimData = JSON.parse(JSON.stringify(activeClaim));
        saveData();
    }

    // Ensure fallback defaults
    ensureTeachingDays();

    // Update Header Badge
    const headerName = document.getElementById('claim-header-subject-name');
    if (headerName) {
        headerName.textContent = `${activeClaim.subjectName} (${activeClaim.subjectCode})`;
    }

    // Populate Subject Preset dropdown in Sidebar Tab 1
    initClaimSubjectPresetDropdown();

    // Fill Sidebar Form Controls
    populateSidebarFromClaimData();

    // Render 18 Weeks in Tab 2
    renderWeeksEditor();

    // Render Students in Tab 4
    renderStudentsEditor();

    // Live Render A4 Pages
    renderA4Page1();
    renderA4Page2();

    // Setup Claim Form Listeners (once)
    setupClaimEventListeners();
}

// Populate Preset Dropdown
function initClaimSubjectPresetDropdown() {
    const sel = document.getElementById('claim-subject-preset');
    if (!sel) return;
    sel.innerHTML = '<option value="">-- เลือกดึงข้อมูลอัตโนมัติจากหลักสูตร ป.ตรี --</option>';
    appData.subjects_master.forEach(s => {
        const opt = document.createElement('option');
        opt.value = s.id;
        const th = s.theoryHours !== undefined ? s.theoryHours : 3;
        const pr = s.practiceHours !== undefined ? s.practiceHours : 0;
        const tot = s.hours || (th + pr);
        opt.textContent = `[${s.code}] ${s.name} (${s.credits || 3} นก. / ท${th}-ป${pr}-รวม${tot} ชม.)`;
        sel.appendChild(opt);
    });

    sel.onchange = () => {
        const val = sel.value;
        if (!val) return;
        const found = appData.subjects_master.find(s => s.id === val);
        if (found) {
            const th = found.theoryHours !== undefined ? found.theoryHours : 3;
            const pr = found.practiceHours !== undefined ? found.practiceHours : 0;
            const tot = found.hours || (th + pr);

            document.getElementById('claim-input-code').value = found.code;
            document.getElementById('claim-input-name').value = found.name;
            document.getElementById('claim-input-credits').value = found.credits || 3;
            
            const elTh = document.getElementById('claim-input-theory-hours');
            if (elTh) elTh.value = th;
            const elPr = document.getElementById('claim-input-practice-hours');
            if (elPr) elPr.value = pr;
            const elWk = document.getElementById('claim-input-weekly-hours');
            if (elWk) elWk.value = tot;

            activeClaim.subjectCode = found.code;
            activeClaim.subjectName = found.name;
            activeClaim.credits = found.credits || 3;
            activeClaim.theoryHours = th;
            activeClaim.practiceHours = pr;
            activeClaim.weeklyHours = tot;

            if (activeClaim.teachingDaysPerWeek === 1 && activeClaim.teachingDays && activeClaim.teachingDays[0]) {
                activeClaim.teachingDays[0].hours = tot;
                activeClaim.day1Hours = tot;
                const day1HoursInp = document.querySelector('.input-day-hours');
                if (day1HoursInp) day1HoursInp.value = tot;
            }
            
            // Recalculate weeks hours
            activeClaim.weeks.forEach(w => {
                if (!w.isHoliday) {
                    w.theoryHrs = th;
                    w.practiceHrs = pr;
                    w.totalHrs = tot;
                }
            });

            updateCalculationsAndPreview();
            renderWeeksEditor();
        }
    };
}

// Calculate hours duration from time range string e.g. "17.00-20.00" -> 3, "08.30-12.30" -> 4
function calculateHoursFromTimeString(timeStr) {
    if (!timeStr) return null;
    const clean = timeStr.trim();
    const m = clean.match(/(\d{1,2})[.:](\d{2})\s*[-–—toถึง]\s*(\d{1,2})[.:](\d{2})/i) ||
              clean.match(/(\d{1,2})\s*[-–—toถึง]\s*(\d{1,2})/i);
    if (!m) return null;
    let sH = parseInt(m[1]), sM = m.length === 5 ? parseInt(m[2]) : 0;
    let eH = m.length === 5 ? parseInt(m[3]) : parseInt(m[2]), eM = m.length === 5 ? parseInt(m[4]) : 0;
    const diffMin = (eH * 60 + eM) - (sH * 60 + sM);
    if (diffMin > 0) {
        const hrs = diffMin / 60;
        return hrs % 1 === 0 ? hrs : Math.round(hrs * 10) / 10;
    }
    return null;
}

// Render dynamic day config cards in Sidebar Tab 1
function renderDailyConfigs() {
    const container = document.getElementById('container-daily-configs');
    if (!container || !activeClaim) return;
    ensureTeachingDays();
    container.innerHTML = '';

    const dowOptions = [
        { val: "1", label: "วันจันทร์" },
        { val: "2", label: "วันอังคาร" },
        { val: "3", label: "วันพุธ" },
        { val: "4", label: "วันพฤหัสบดี" },
        { val: "5", label: "วันศุกร์" },
        { val: "6", label: "วันเสาร์" },
        { val: "0", label: "วันอาทิตย์" }
    ];

    activeClaim.teachingDays.forEach((dayConf, idx) => {
        const dayCard = document.createElement('div');
        dayCard.className = 'p-2.5 rounded-lg bg-[#0f121d] border border-[#2d3748] space-y-1.5 day-config-card';
        dayCard.dataset.dayIdx = idx;

        const dowSelectHtml = dowOptions.map(opt => 
            `<option value="${opt.val}" ${String(dayConf.dow) === opt.val ? 'selected' : ''}>${opt.label}</option>`
        ).join('');

        dayCard.innerHTML = `
            <div class="flex items-center justify-between">
                <span class="text-xs font-semibold ${idx === 0 ? 'text-blue-400' : (idx === 1 ? 'text-orange-400' : (idx === 2 ? 'text-emerald-400' : 'text-purple-400'))} flex items-center gap-1">
                    <i class="fa-regular fa-calendar-days"></i> วันสอนที่ ${idx + 1}
                </span>
                <span class="text-[10px] text-gray-400">ครั้งที่ ${idx + 1} ของสัปดาห์</span>
            </div>
            <div class="grid grid-cols-1 sm:grid-cols-3 gap-2">
                <div>
                    <label class="block text-[10px] text-gray-400 mb-0.5">วันในสัปดาห์</label>
                    <select class="input-day-dow w-full p-1 rounded bg-[#1c2134] border border-[#2d3748] text-xs text-white">
                        ${dowSelectHtml}
                    </select>
                </div>
                <div>
                    <label class="block text-[10px] text-gray-400 mb-0.5">ช่วงเวลาสอน</label>
                    <input type="text" class="input-day-time w-full p-1 rounded bg-[#1c2134] border border-[#2d3748] text-xs text-center text-white" value="${dayConf.time || '17.00-20.00'}" placeholder="17.00-20.00">
                </div>
                <div>
                    <label class="block text-[10px] text-gray-400 mb-0.5">จำนวน ชม./วัน</label>
                    <div class="flex items-center gap-1">
                        <input type="number" class="input-day-hours w-full p-1 rounded bg-[#1c2134] border border-[#2d3748] text-xs text-center text-white" value="${dayConf.hours || 3}" min="1" max="12">
                        <span class="text-[11px] text-gray-400">ชม.</span>
                    </div>
                </div>
            </div>
        `;

        // Bind day card events
        const selDow = dayCard.querySelector('.input-day-dow');
        const inpTime = dayCard.querySelector('.input-day-time');
        const inpHours = dayCard.querySelector('.input-day-hours');

        selDow.addEventListener('change', () => {
            dayConf.dow = selDow.value;
            if (idx === 0) {
                activeClaim.day1DOW = selDow.value;
                // If user manually changes Day 1 DOW, shift startDate so Day 1 aligns to this new DOW
                const parsedStart = parseThaiDateShort(activeClaim.startDate);
                if (parsedStart && !isNaN(parsedStart.getTime())) {
                    const targetDow = parseInt(selDow.value);
                    const curDow = parsedStart.getDay();
                    if (curDow !== targetDow) {
                        const shift = (targetDow - curDow + 7) % 7;
                        parsedStart.setDate(parsedStart.getDate() + shift);
                        const yyyy = parsedStart.getFullYear();
                        const mm = String(parsedStart.getMonth() + 1).padStart(2, '0');
                        const dd = String(parsedStart.getDate()).padStart(2, '0');
                        activeClaim.startDate = `${yyyy}-${mm}-${dd}`;
                        const elStart = document.getElementById('claim-input-start-date');
                        if (elStart) elStart.value = activeClaim.startDate;
                        const elStartTh = document.getElementById('claim-input-start-date-th');
                        if (elStartTh) elStartTh.value = formatThaiBEDate(activeClaim.startDate);
                    }
                }
            }
            if (idx === 1) activeClaim.day2DOW = selDow.value;
            recalculateClaimSchedule(true);
            renderWeeksEditor();
            updateCalculationsAndPreview();
        });

        const syncHoursFromTime = () => {
            const calculatedHrs = calculateHoursFromTimeString(inpTime.value);
            if (calculatedHrs && calculatedHrs > 0) {
                inpHours.value = calculatedHrs;
                dayConf.hours = calculatedHrs;
                if (idx === 0) {
                    activeClaim.day1Hours = calculatedHrs;
                    if (activeClaim.teachingDaysPerWeek === 1) {
                        activeClaim.weeklyHours = calculatedHrs;
                        const wkInp = document.getElementById('claim-input-weekly-hours');
                        if (wkInp) wkInp.value = calculatedHrs;
                    }
                }
                if (idx === 1) activeClaim.day2Hours = calculatedHrs;
                (activeClaim.weeks || []).forEach(w => {
                    if (w.dayNo === idx + 1 && !w.isHoliday) {
                        w.theoryHrs = calculatedHrs;
                        w.totalHrs = calculatedHrs + (parseInt(w.practiceHrs) || 0);
                    }
                });
                renderWeeksEditor();
                updateCalculationsAndPreview();
            }
        };

        inpTime.addEventListener('input', () => {
            dayConf.time = inpTime.value;
            if (idx === 0) {
                activeClaim.day1Time = inpTime.value;
                activeClaim.timeStr = inpTime.value;
            }
            if (idx === 1) activeClaim.day2Time = inpTime.value;
            (activeClaim.weeks || []).forEach(w => {
                if (w.dayNo === idx + 1) w.timeStr = inpTime.value;
            });
            syncHoursFromTime();
            renderWeeksEditor();
            renderA4Page1();
        });

        inpTime.addEventListener('change', () => {
            syncHoursFromTime();
        });

        inpHours.addEventListener('input', () => {
            const hrs = parseInt(inpHours.value) || 0;
            dayConf.hours = hrs;
            if (idx === 0) {
                activeClaim.day1Hours = hrs;
                if (activeClaim.teachingDaysPerWeek === 1) activeClaim.weeklyHours = hrs;
            }
            if (idx === 1) activeClaim.day2Hours = hrs;
            (activeClaim.weeks || []).forEach(w => {
                if (w.dayNo === idx + 1 && !w.isHoliday) {
                    w.theoryHrs = hrs;
                    w.totalHrs = hrs + (parseInt(w.practiceHrs) || 0);
                }
            });
            renderWeeksEditor();
            updateCalculationsAndPreview();
        });

        container.appendChild(dayCard);
    });
}

// Populate Sidebar Tab 1 & Tab 3 from activeClaim
function populateSidebarFromClaimData() {
    if (activeClaim && activeClaim.startDate) {
        const d = parseThaiDateShort(activeClaim.startDate);
        if (d && !isNaN(d.getTime())) {
            const startDow = String(d.getDay());
            ensureTeachingDays(activeClaim);
            if (activeClaim.teachingDays && activeClaim.teachingDays[0]) {
                activeClaim.teachingDays[0].dow = startDow;
                activeClaim.day1DOW = startDow;
            }
        }
    }
    ensureTeachingDays();
    const n = activeClaim.teachingDaysPerWeek || 1;
    const totWeeks = activeClaim.totalWeeks || Math.ceil(18 / n);
    const isMulti = n > 1;

    // Tab 1
    const inputTeacher = document.getElementById('claim-input-teacher');
    if (inputTeacher) inputTeacher.value = activeClaim.teacherName || '';
    const btnClearClaimTeacher = document.getElementById('btn-clear-claim-teacher');
    if (btnClearClaimTeacher) {
        if (activeClaim.teacherName) btnClearClaimTeacher.classList.remove('hidden');
        else btnClearClaimTeacher.classList.add('hidden');
    }
    const inputLevel = document.getElementById('claim-input-level');
    if (inputLevel) inputLevel.value = activeClaim.level || 'ชั้นปี 1';

    const inputAcademicYear = document.getElementById('claim-input-academic-year');
    const curTerm = appData.terms.find(t => t.id === currentTermId);
    const defaultYear = curTerm ? `${curTerm.no}/${curTerm.year}` : '1/2568';
    if (inputAcademicYear) inputAcademicYear.value = activeClaim.academicYear || defaultYear;

    // Days per week input
    const inputDaysPerWeek = document.getElementById('claim-input-days-per-week');
    if (inputDaysPerWeek) inputDaysPerWeek.value = n;

    // Render dynamic day config cards
    renderDailyConfigs();

    const badgeMode = document.getElementById('badge-teaching-mode');
    if (badgeMode) {
        badgeMode.textContent = isMulti ? `${n} วัน/สัปดาห์ (${totWeeks} สัปดาห์)` : '1 วัน/สัปดาห์ (18 สัปดาห์)';
    }

    const tabTitle = document.getElementById('tab-calendar-title');
    if (tabTitle) {
        tabTitle.textContent = isMulti ? `2. ตาราง ${totWeeks} สัปดาห์` : '2. ตาราง 18 สัปดาห์';
    }

    const labelCalc = document.getElementById('label-calc-weeks');
    if (labelCalc) {
        labelCalc.textContent = isMulti ? `คำนวณปฏิทิน ${totWeeks} สัปดาห์อัตโนมัติ` : 'คำนวณปฏิทิน 18 สัปดาห์อัตโนมัติ';
    }

    const labelEndDate = document.getElementById('label-end-date');
    if (labelEndDate) {
        labelEndDate.textContent = isMulti ? `วันสิ้นสุด (คำนวณ ${totWeeks} สัปดาห์)` : 'วันสิ้นสุด (คำนวณ 18 สัปดาห์)';
    }

    const btnPage2Label = document.getElementById('label-btn-page-2');
    if (btnPage2Label) {
        btnPage2Label.textContent = isMulti ? `หน้า 2: ใบตรวจสอบการเข้าเรียน (${totWeeks} สัปดาห์)` : 'หน้า 2: ใบตรวจสอบการเข้าเรียน (18 สัปดาห์)';
    }

    const selLayout = document.getElementById('claim-summer-layout');
    if (selLayout) selLayout.value = activeClaim.summerTableLayout || (n === 2 ? "side_by_side" : "sequential");

    const inpDept = document.getElementById('claim-input-dept');
    if (inpDept) inpDept.value = activeClaim.department || 'เทคโนโลยีโยธา';

    document.getElementById('claim-input-code').value = activeClaim.subjectCode || '';
    document.getElementById('claim-input-name').value = activeClaim.subjectName || '';
    document.getElementById('claim-input-credits').value = activeClaim.credits || 3;
    
    const masterSub = (appData.subjects_master || []).find(s => s.id === activeSubjectRef?.subjectId || s.code === activeClaim.subjectCode || s.name === activeClaim.subjectName);
    let defaultTh = 3, defaultPr = 0;
    if (masterSub) {
        defaultTh = masterSub.theoryHours !== undefined ? masterSub.theoryHours : 3;
        defaultPr = masterSub.practiceHours !== undefined ? masterSub.practiceHours : 0;
    }
    if (activeClaim.theoryHours === undefined) activeClaim.theoryHours = defaultTh;
    if (activeClaim.practiceHours === undefined) activeClaim.practiceHours = defaultPr;
    if (!activeClaim.weeklyHours || (activeClaim.teachingDaysPerWeek === 1 && activeClaim.weeklyHours !== activeClaim.theoryHours + activeClaim.practiceHours && !activeClaim.weeklyHoursCustomized)) {
        activeClaim.weeklyHours = activeClaim.theoryHours + activeClaim.practiceHours;
    }

    const elTh = document.getElementById('claim-input-theory-hours');
    if (elTh) elTh.value = activeClaim.theoryHours;
    const elPr = document.getElementById('claim-input-practice-hours');
    if (elPr) elPr.value = activeClaim.practiceHours;
    const inpWeeklyHrs = document.getElementById('claim-input-weekly-hours');
    if (inpWeeklyHrs) inpWeeklyHrs.value = activeClaim.weeklyHours;
    document.getElementById('claim-input-start-date').value = activeClaim.startDate || '2025-06-02';
    const inpStartTh = document.getElementById('claim-input-start-date-th');
    if (inpStartTh) inpStartTh.value = formatThaiBEDate(activeClaim.startDate || '2025-06-02');
    document.getElementById('claim-input-end-date').value = activeClaim.endDateThai || '29 เดือน กันยายน พ.ศ. 2568';
    const currentTerm = appData.terms.find(t => t.id === currentTermId);
    const termRate = currentTerm ? currentTerm.hourlyRate : null;
    if (activeClaim.rate === undefined || activeClaim.rate === null) {
        activeClaim.rate = termRate || 42;
    }
    document.getElementById('claim-input-rate').value = activeClaim.rate;

    const curStudentsCount = (activeClaim.students && activeClaim.students.length > 0)
        ? activeClaim.students.length
        : (activeClaim.studentCount !== undefined ? activeClaim.studentCount : 6);
    document.getElementById('claim-input-students').value = curStudentsCount;
    document.getElementById('claim-input-percent').value = activeClaim.percent || 60;

    const totals = calculateClaimTotals(activeClaim);
    const inputTotalHours = document.getElementById('claim-input-total-hours');
    if (inputTotalHours) {
        inputTotalHours.value = (activeClaim.customTotalHours !== undefined && activeClaim.customTotalHours !== null && activeClaim.customTotalHours !== '')
            ? activeClaim.customTotalHours
            : totals.tableHours;
    }
    const hintHours = document.getElementById('claim-table-hours-hint');
    if (hintHours) {
        hintHours.textContent = `จากตารางสอน: ${totals.tableHours} ชม.`;
    }

    // Tab 3: Signatures (ข้อ 2-9 ดึงค่าเริ่มต้นจากเทอมแรกเสมอ)
    const defSig = getDefaultSignatures2To9();
    if (!activeClaim.signatures) activeClaim.signatures = {};
    const sig = activeClaim.signatures;
    const deptName = activeClaim.department || 'เทคโนโลยีโยธา';

    // เติมเต็มค่าเริ่มต้นข้อ 2-9 หากยังว่างอยู่
    if (!sig.programChair && defSig.programChair) sig.programChair = defSig.programChair;
    if (!sig.curriculumHead && defSig.curriculumHead) sig.curriculumHead = defSig.curriculumHead;
    if (!sig.deptHead && defSig.deptHead) sig.deptHead = defSig.deptHead;
    if (!sig.techHead && defSig.techHead) sig.techHead = defSig.techHead;
    if (!sig.academicDeputy && defSig.academicDeputy) sig.academicDeputy = defSig.academicDeputy;
    if (!sig.financeHead && defSig.financeHead) sig.financeHead = defSig.financeHead;
    if (!sig.resourceDeputy && defSig.resourceDeputy) sig.resourceDeputy = defSig.resourceDeputy;
    if (!sig.director && defSig.director) sig.director = defSig.director;

    // ซิงค์ชื่อตำแหน่งหัวหน้าสาขาวิชา และ ประธานหลักสูตร ให้สอดคล้องกับสาขาวิชา
    const expectedDHRole = getFormattedDeptRole(deptName, 'deptHead');
    const expectedPCRole = getFormattedDeptRole(deptName, 'programChair');
    if (!sig.deptHeadRole || (sig.deptHeadRole.includes('โยธา') && !deptName.includes('โยธา'))) {
        sig.deptHeadRole = expectedDHRole;
        if (activeSubjectRef && activeSubjectRef.signatures) activeSubjectRef.signatures.deptHeadRole = expectedDHRole;
    }
    if (!sig.programChairRole || (sig.programChairRole.includes('โยธา') && !deptName.includes('โยธา'))) {
        sig.programChairRole = expectedPCRole;
        if (activeSubjectRef && activeSubjectRef.signatures) activeSubjectRef.signatures.programChairRole = expectedPCRole;
    }

    document.getElementById('sig-teacher-name').value = sig.teacher || activeClaim.teacherName || '';
    const inpProgChair = document.getElementById('sig-program-chair');
    if (inpProgChair) inpProgChair.value = sig.programChair || defSig.programChair || 'นายปริวัฒน์ ยืนยิ่ง';
    const lblProgChair = document.getElementById('label-sig-program-chair');
    if (lblProgChair) lblProgChair.textContent = `2. ประธานหลักสูตรสาขาวิชา${deptName}`;

    const inpProgChairRole = document.getElementById('sig-program-chair-role');
    if (inpProgChairRole) {
        inpProgChairRole.value = sig.programChairRole || expectedPCRole;
        inpProgChairRole.oninput = () => {
            sig.programChairRole = inpProgChairRole.value;
            if (activeSubjectRef) {
                if (!activeSubjectRef.signatures) activeSubjectRef.signatures = {};
                activeSubjectRef.signatures.programChairRole = inpProgChairRole.value;
            }
            renderA4Page1();
            renderA4Page2();
        };
    }

    document.getElementById('sig-curriculum-head').value = sig.curriculumHead || defSig.curriculumHead || '';
    document.getElementById('sig-dept-head').value = sig.deptHead || defSig.deptHead || '';
    const lblDeptHead = document.getElementById('label-sig-dept-head');
    if (lblDeptHead) lblDeptHead.textContent = `4. หัวหน้าสาขาวิชา${deptName}`;

    const inpDeptHeadRole = document.getElementById('sig-dept-head-role');
    if (inpDeptHeadRole) {
        inpDeptHeadRole.value = sig.deptHeadRole || expectedDHRole;
        inpDeptHeadRole.oninput = () => {
            sig.deptHeadRole = inpDeptHeadRole.value;
            if (activeSubjectRef) {
                if (!activeSubjectRef.signatures) activeSubjectRef.signatures = {};
                activeSubjectRef.signatures.deptHeadRole = inpDeptHeadRole.value;
            }
            renderA4Page1();
        };
    }

    document.getElementById('sig-tech-head').value = sig.techHead || defSig.techHead || '';
    document.getElementById('sig-academic-deputy').value = sig.academicDeputy || defSig.academicDeputy || '';
    document.getElementById('sig-finance-head').value = sig.financeHead || defSig.financeHead || '';
    document.getElementById('sig-resource-deputy').value = sig.resourceDeputy || defSig.resourceDeputy || '';
    document.getElementById('sig-director').value = sig.director || defSig.director || '';

    updateCalculationsAndPreview();
}

// Calculations for Hours, Money, and Thai Baht Text
function calculateClaimTotals(claim = activeClaim) {
    let totalTheory = 0;
    let totalPractice = 0;
    let tableHours = 0;
    if (!claim) return { totalTheory: 0, totalPractice: 0, grandTotalHrs: 0, tableHours: 0, totalMoney: 0, bahtString: '' };

    (claim.weeks || []).forEach(w => {
        if (!w.isHoliday) {
            totalTheory += (parseInt(w.theoryHrs) || 0);
            totalPractice += (parseInt(w.practiceHrs) || 0);
            tableHours += (parseInt(w.totalHrs) || 0);
        }
    });

    let grandTotalHrs = tableHours;
    if (claim.customTotalHours !== undefined && claim.customTotalHours !== null && claim.customTotalHours !== '') {
        const parsed = parseFloat(claim.customTotalHours);
        if (!isNaN(parsed)) {
            grandTotalHrs = parsed;
        }
    }

    const rate = parseFloat(claim.rate) || 0;
    const totalMoney = grandTotalHrs * rate;
    const bahtString = thaiBahtText(totalMoney);

    return { totalTheory, totalPractice, grandTotalHrs, tableHours, totalMoney, bahtString };
}

function updateCalculationsAndPreview() {
    const totals = calculateClaimTotals();

    const elTotalHours = document.getElementById('claim-display-total-hours');
    const elInputTotalHours = document.getElementById('claim-input-total-hours');
    const elTotalMoney = document.getElementById('claim-display-total-money');
    const elBahtText = document.getElementById('claim-input-baht-text');
    const hintHours = document.getElementById('claim-table-hours-hint');

    if (elTotalHours) elTotalHours.textContent = `${totals.grandTotalHrs} ชั่วโมง`;
    if (elInputTotalHours && document.activeElement !== elInputTotalHours) {
        elInputTotalHours.value = (activeClaim.customTotalHours !== undefined && activeClaim.customTotalHours !== null && activeClaim.customTotalHours !== '')
            ? activeClaim.customTotalHours
            : totals.tableHours;
    }
    if (hintHours) hintHours.textContent = `จากตารางสอน: ${totals.tableHours} ชม.`;
    if (elTotalMoney) elTotalMoney.textContent = formatMoney(totals.totalMoney);
    if (elBahtText) elBahtText.value = totals.bahtString;

    // Synchronize subject data and term hours in real-time
    if (activeSubjectRef) {
        activeSubjectRef.claimData = JSON.parse(JSON.stringify(activeClaim));
        activeSubjectRef.hours = totals.grandTotalHrs;
        activeSubjectRef.rate = activeClaim.rate;
        activeSubjectRef.level = activeClaim.level || activeSubjectRef.level || 'ชั้นปี 1';
        activeSubjectRef.time = activeClaim.timeStr || activeSubjectRef.time || '17.00-20.00';
        activeSubjectRef.studentCount = activeClaim.students ? activeClaim.students.length : 0;
        const matchedTeacher = (appData.teachers || []).find(t => t.name === activeClaim.teacherName);
        if (matchedTeacher) {
            activeSubjectRef.teacherId = matchedTeacher.id;
        }

        const currentTerm = appData.terms.find(t => t.id === currentTermId);
        if (currentTerm) {
            const autoHrs = calculateTermTotalHours(currentTerm);
            currentTerm.totalTeachingHours = autoHrs;
            if (currentTerm.budget > 0 && autoHrs > 0 && !activeClaim.rateCustomized) {
                currentTerm.hourlyRate = Math.floor(currentTerm.budget / autoHrs);
            }
        }
        saveData();
    }

    // Refresh Live A4 Documents
    renderA4Page1();
    renderA4Page2();
}

// Render Tab 2: Weeks Editor (18 Weeks or 9 Weeks)
// Render Tab 2: Weeks Editor (Dynamic totalWeeks or 18 Weeks)
// Helper to handle manual date input changes and check Thai holidays in real-time
function handleDateInputChange(sessionData, newDateStr, boxOrItem, isMulti) {
    sessionData.dateStr = newDateStr;
    const parsedDate = parseThaiDateShort(newDateStr);
    if (parsedDate) {
        const yyyy = parsedDate.getFullYear();
        const mm = String(parsedDate.getMonth() + 1).padStart(2, '0');
        const dd = String(parsedDate.getDate()).padStart(2, '0');
        sessionData.isoDate = `${yyyy}-${mm}-${dd}`;

        const thaiHoliday = getThaiHoliday(parsedDate);
        const chk = boxOrItem.querySelector('.chk-holiday');
        const reasonInp = boxOrItem.querySelector('.input-holiday-reason');
        const reasonDiv = boxOrItem.querySelector('.div-holiday-reason');
        const hrsDiv = boxOrItem.querySelector('.div-teaching-hours');
        const sessTotalSpan = boxOrItem.querySelector('.session-total-text');

        if (thaiHoliday) {
            sessionData.isHoliday = true;
            sessionData.holidayReason = shortenHolidayName(thaiHoliday.name);
            sessionData.theoryHrs = 0;
            sessionData.practiceHrs = 0;
            sessionData.totalHrs = 0;

            if (chk) chk.checked = true;
            if (reasonInp) reasonInp.value = sessionData.holidayReason;
            if (reasonDiv) reasonDiv.classList.remove('hidden');
            if (hrsDiv) hrsDiv.classList.add('hidden');
            if (sessTotalSpan) sessTotalSpan.textContent = '0';
            if (isMulti) {
                boxOrItem.className = 'session-box p-2 rounded-lg border text-xs transition bg-red-950/20 border-red-500/40';
            } else {
                boxOrItem.className = 'p-2.5 rounded-lg border text-xs transition bg-red-950/20 border-red-500/40';
            }
        } else {
            if (sessionData.isHoliday && isKnownThaiHolidayReason(sessionData.holidayReason)) {
                sessionData.isHoliday = false;
                sessionData.holidayReason = "";
                const defaultHrs = parseInt(sessionData.timeStr ? calculateHoursFromTimeString(sessionData.timeStr) : 3) || 3;
                sessionData.theoryHrs = defaultHrs;
                sessionData.practiceHrs = 0;
                sessionData.totalHrs = defaultHrs;

                if (chk) chk.checked = false;
                if (reasonInp) reasonInp.value = "";
                if (reasonDiv) reasonDiv.classList.add('hidden');
                if (hrsDiv) hrsDiv.classList.remove('hidden');
                if (sessTotalSpan) sessTotalSpan.textContent = defaultHrs;
                if (isMulti) {
                    boxOrItem.className = 'session-box p-2 rounded-lg border text-xs transition bg-[#0f121d] border-[#2d3748]';
                } else {
                    boxOrItem.className = 'p-2.5 rounded-lg border text-xs transition bg-[#141725] border-[#2d3748]';
                }
            }
        }
    }
    renderA4Page1();
    renderA4Page2();
    updateCalculationsAndPreview();
}

// Helper to handle manual time input changes
function handleTimeInputChange(sessionData, newTimeStr, boxOrItem) {
    sessionData.timeStr = newTimeStr;
    const calcHrs = calculateHoursFromTimeString(newTimeStr);
    if (calcHrs && calcHrs > 0 && !sessionData.isHoliday) {
        sessionData.theoryHrs = calcHrs;
        sessionData.practiceHrs = 0;
        sessionData.totalHrs = calcHrs;
        const thInp = boxOrItem.querySelector('.input-theory');
        const prInp = boxOrItem.querySelector('.input-practice');
        const totalSpan = boxOrItem.querySelector('.session-total-text');
        if (thInp) thInp.value = calcHrs;
        if (prInp) prInp.value = 0;
        if (totalSpan) totalSpan.textContent = calcHrs;
    }
    renderA4Page1();
    renderA4Page2();
    updateCalculationsAndPreview();
}

// Helper to handle Start Date changes and automatically sync Day 1 DOW with real calendar
function handleStartDateChange(newIsoDate) {
    if (!activeClaim || !newIsoDate) return;
    activeClaim.startDate = newIsoDate;

    // Parse date and determine real calendar day of week (0=Sun, 1=Mon, 2=Tue, 3=Wed, 4=Thu, 5=Fri, 6=Sat)
    const parsedDate = parseThaiDateShort(newIsoDate);
    if (parsedDate && !isNaN(parsedDate.getTime())) {
        const startDow = String(parsedDate.getDay());
        ensureTeachingDays(activeClaim);
        if (activeClaim.teachingDays && activeClaim.teachingDays[0]) {
            // Automatically set Day 1 DOW to match real calendar day of start date!
            activeClaim.teachingDays[0].dow = startDow;
            activeClaim.day1DOW = startDow;
        }
    }

    // Keep inputs in sync
    const elStart = document.getElementById('claim-input-start-date');
    if (elStart && elStart.value !== newIsoDate) elStart.value = newIsoDate;
    const elStartTh = document.getElementById('claim-input-start-date-th');
    if (elStartTh) elStartTh.value = formatThaiBEDate(newIsoDate);

    recalculateClaimSchedule(true);
    renderDailyConfigs(); // Day 1 dropdown automatically updates to show the real calendar day!
    renderWeeksEditor();
    updateCalculationsAndPreview();
}

function renderWeeksEditor() {
    const container = document.getElementById('claim-weeks-editor-list');
    const labelCount = document.getElementById('claim-weeks-count-label');
    const tabTitle = document.getElementById('tab-calendar-title');
    if (!container || !activeClaim) return;
    ensureTeachingDays();
    container.innerHTML = '';

    const n = activeClaim.teachingDaysPerWeek || 1;
    const totalWeeks = activeClaim.totalWeeks || Math.ceil(18 / n);
    const isMulti = n > 1;

    if (tabTitle) tabTitle.textContent = isMulti ? `2. ตาราง ${totalWeeks} สัปดาห์` : '2. ตาราง 18 สัปดาห์';
    if (labelCount) labelCount.textContent = isMulti 
        ? `รายการสอน ${totalWeeks} สัปดาห์ (สัปดาห์ละ ${n} วัน รวม 18 ครั้ง)` 
        : 'รายการสอน 18 สัปดาห์ (ติ๊กเพื่อตั้งเป็นวันหยุด)';

    if (isMulti) {
        // Group sessions into totalWeeks cards
        for (let w = 1; w <= totalWeeks; w++) {
            const startSessionIdx = (w - 1) * n;
            const endSessionIdx = Math.min(w * n, 18);

            const weekCard = document.createElement('div');
            weekCard.className = 'p-3 bg-[#141725] rounded-xl border border-[#2d3748] space-y-2.5';

            let sessionsHtml = '';
            for (let s = startSessionIdx; s < endSessionIdx; s++) {
                const dayInWeek = (s % n) + 1;
                const dConf = activeClaim.teachingDays[dayInWeek - 1] || {};
                const sessionData = activeClaim.weeks[s] || { 
                    weekNo: w, 
                    dayNo: dayInWeek, 
                    sessionNo: s + 1, 
                    dateStr: '', 
                    timeStr: dConf.time || '17.00-20.00', 
                    theoryHrs: dConf.hours || 3, 
                    practiceHrs: 0, 
                    totalHrs: dConf.hours || 3, 
                    isHoliday: false, 
                    holidayReason: '' 
                };

                const dayColors = ['text-blue-300', 'text-orange-300', 'text-emerald-300', 'text-purple-300', 'text-yellow-300', 'text-cyan-300', 'text-rose-300'];
                const dayColor = dayColors[(dayInWeek - 1) % dayColors.length];

                sessionsHtml += `
                    <div class="session-box p-2 rounded-lg border text-xs transition ${sessionData.isHoliday ? 'bg-red-950/20 border-red-500/40' : 'bg-[#0f121d] border-[#2d3748]'}" data-session-idx="${s}">
                        <div class="flex items-center justify-between gap-1.5 mb-1.5">
                            <div class="flex items-center gap-1.5 flex-1">
                                <span class="font-semibold ${dayColor} text-[11px] w-14">ครั้งที่ ${dayInWeek}</span>
                                <input type="text" class="input-week-date bg-[#1c2134] border border-[#2d3748] rounded px-2 py-0.5 text-xs ${dayColor} w-24 text-center" value="${sessionData.dateStr}" placeholder="ว/ด/ป">
                                <input type="text" class="input-week-time bg-[#1c2134] border border-[#2d3748] rounded px-2 py-0.5 text-xs text-gray-300 flex-1 text-center" value="${sessionData.timeStr || dConf.time || '17.00-20.00'}" placeholder="ช่วงเวลา">
                            </div>
                            <label class="flex items-center gap-1 cursor-pointer text-xs ${sessionData.isHoliday ? 'text-red-400 font-bold' : 'text-gray-400'}">
                                <input type="checkbox" class="chk-holiday accent-red-500 rounded" ${sessionData.isHoliday ? 'checked' : ''}>
                                <span>วันหยุด</span>
                            </label>
                        </div>
                        <div class="flex items-center gap-1.5 ${sessionData.isHoliday ? '' : 'hidden'} div-holiday-reason mb-1">
                            <span class="text-red-400 text-[11px]">เหตุผล:</span>
                            <input type="text" class="input-holiday-reason flex-1 bg-[#1c2134] border border-red-500/30 rounded px-2 py-0.5 text-xs text-red-300" value="${sessionData.holidayReason || ''}" placeholder="ระบุเหตุผลวันหยุด">
                        </div>
                        <div class="flex items-center gap-2 ${sessionData.isHoliday ? 'hidden' : ''} div-teaching-hours text-[11px] text-gray-400">
                            <span>ทฤษฎี: <input type="number" class="input-theory bg-[#1c2134] border border-[#2d3748] rounded w-10 text-center text-xs text-white" value="${sessionData.theoryHrs}"> ชม.</span>
                            <span>ปฏิบัติ: <input type="number" class="input-practice bg-[#1c2134] border border-[#2d3748] rounded w-10 text-center text-xs text-white" value="${sessionData.practiceHrs}"> ชม.</span>
                            <span class="font-bold text-white ml-auto">รวม: <span class="session-total-text">${sessionData.totalHrs}</span> ชม.</span>
                        </div>
                    </div>
                `;
            }

            let weekTotalHrs = 0;
            for (let s = startSessionIdx; s < endSessionIdx; s++) {
                const ws = activeClaim.weeks[s];
                if (ws && !ws.isHoliday) {
                    weekTotalHrs += (parseInt(ws.totalHrs) || 0);
                }
            }

            weekCard.innerHTML = `
                <div class="flex items-center justify-between border-b border-[#2d3748] pb-1.5">
                    <span class="font-bold text-blue-400 text-xs flex items-center gap-1.5">
                        <i class="fa-solid fa-calendar-week"></i> สัปดาห์ที่ ${w}
                    </span>
                    <span class="text-[11px] text-gray-400">
                        รวมสัปดาห์นี้: <span class="font-bold text-white week-total-display">${weekTotalHrs} ชม.</span>
                    </span>
                </div>
                ${sessionsHtml}
            `;

            // Bind session inputs within weekCard
            const sessionBoxes = weekCard.querySelectorAll('.session-box');
            sessionBoxes.forEach((box) => {
                const sIdx = parseInt(box.dataset.sessionIdx);
                const sessionData = activeClaim.weeks[sIdx];
                if (!sessionData) return;
                const dIdx = sIdx % n;
                const defaultHrs = parseInt((activeClaim.teachingDays[dIdx] || {}).hours) || 3;

                const chk = box.querySelector('.chk-holiday');
                const reasonInp = box.querySelector('.input-holiday-reason');
                const reasonDiv = box.querySelector('.div-holiday-reason');
                const hrsDiv = box.querySelector('.div-teaching-hours');
                const dateInp = box.querySelector('.input-week-date');
                const timeInp = box.querySelector('.input-week-time');
                const theoryInp = box.querySelector('.input-theory');
                const practiceInp = box.querySelector('.input-practice');
                const sessTotalSpan = box.querySelector('.session-total-text');

                const updateCardTotal = () => {
                    let sum = 0;
                    for (let s = startSessionIdx; s < endSessionIdx; s++) {
                        const ws = activeClaim.weeks[s];
                        if (ws && !ws.isHoliday) sum += (parseInt(ws.totalHrs) || 0);
                    }
                    weekCard.querySelector('.week-total-display').textContent = `${sum} ชม.`;
                };

                chk.addEventListener('change', () => {
                    sessionData.isHoliday = chk.checked;
                    if (sessionData.isHoliday) {
                        if (!sessionData.holidayReason) sessionData.holidayReason = "วันหยุด";
                        sessionData.theoryHrs = 0;
                        sessionData.practiceHrs = 0;
                        sessionData.totalHrs = 0;
                        reasonDiv.classList.remove('hidden');
                        hrsDiv.classList.add('hidden');
                        box.className = 'session-box p-2 rounded-lg border text-xs transition bg-red-950/20 border-red-500/40';
                    } else {
                        sessionData.holidayReason = "";
                        sessionData.theoryHrs = defaultHrs;
                        sessionData.practiceHrs = 0;
                        sessionData.totalHrs = defaultHrs;
                        reasonDiv.classList.add('hidden');
                        hrsDiv.classList.remove('hidden');
                        box.className = 'session-box p-2 rounded-lg border text-xs transition bg-[#0f121d] border-[#2d3748]';
                    }
                    if (sessTotalSpan) sessTotalSpan.textContent = sessionData.totalHrs;
                    updateCardTotal();
                    updateCalculationsAndPreview();
                });

                reasonInp.addEventListener('input', () => {
                    sessionData.holidayReason = reasonInp.value;
                    renderA4Page1();
                });

                dateInp.addEventListener('input', () => {
                    handleDateInputChange(sessionData, dateInp.value, box, true);
                    updateCardTotal();
                });
                dateInp.addEventListener('change', () => {
                    handleDateInputChange(sessionData, dateInp.value, box, true);
                    updateCardTotal();
                });

                timeInp.addEventListener('input', () => {
                    handleTimeInputChange(sessionData, timeInp.value, box);
                    updateCardTotal();
                });
                timeInp.addEventListener('change', () => {
                    handleTimeInputChange(sessionData, timeInp.value, box);
                    updateCardTotal();
                });

                theoryInp.addEventListener('input', () => {
                    sessionData.theoryHrs = parseInt(theoryInp.value) || 0;
                    sessionData.totalHrs = sessionData.theoryHrs + (parseInt(sessionData.practiceHrs) || 0);
                    if (sessTotalSpan) sessTotalSpan.textContent = sessionData.totalHrs;
                    updateCardTotal();
                    updateCalculationsAndPreview();
                });

                practiceInp.addEventListener('input', () => {
                    sessionData.practiceHrs = parseInt(practiceInp.value) || 0;
                    sessionData.totalHrs = (parseInt(sessionData.theoryHrs) || 0) + sessionData.practiceHrs;
                    if (sessTotalSpan) sessTotalSpan.textContent = sessionData.totalHrs;
                    updateCardTotal();
                    updateCalculationsAndPreview();
                });
            });

            container.appendChild(weekCard);
        }
    } else {
        // 1 Day / Week (18 weeks)
        (activeClaim.weeks || []).forEach((w, idx) => {
            const item = document.createElement('div');
            item.className = `p-2.5 rounded-lg border text-xs transition ${
                w.isHoliday ? 'bg-red-950/20 border-red-500/40' : 'bg-[#141725] border-[#2d3748]'
            }`;
            
            item.innerHTML = `
                <div class="flex items-center justify-between gap-2 mb-1.5">
                    <div class="flex items-center gap-1.5 flex-1">
                        <span class="font-bold text-gray-300 w-16">สัปดาห์ ${w.weekNo}</span>
                        <input type="text" class="input-week-date bg-[#0f121d] border border-[#2d3748] rounded px-2 py-0.5 text-xs text-blue-300 w-24 text-center" value="${w.dateStr}" placeholder="ว/ด/ป">
                        <input type="text" class="input-week-time bg-[#0f121d] border border-[#2d3748] rounded px-2 py-0.5 text-xs text-gray-300 flex-1 text-center" value="${w.timeStr || activeClaim.day1Time || '17.00-20.00'}" placeholder="ช่วงเวลา">
                    </div>
                    <label class="flex items-center gap-1.5 cursor-pointer text-xs ${w.isHoliday ? 'text-red-400 font-bold' : 'text-gray-400'}">
                        <input type="checkbox" class="chk-holiday accent-red-500 rounded" ${w.isHoliday ? 'checked' : ''}>
                        <span>วันหยุด</span>
                    </label>
                </div>
                <div class="flex items-center gap-2 ${w.isHoliday ? '' : 'hidden'} div-holiday-reason mb-1">
                    <span class="text-red-400">เหตุผล:</span>
                    <input type="text" class="input-holiday-reason flex-1 bg-[#0f121d] border border-red-500/30 rounded px-2 py-0.5 text-xs text-red-300" value="${w.holidayReason || ''}" placeholder="เช่น หยุดตามมติ ครม.">
                </div>
                <div class="flex items-center gap-3 ${w.isHoliday ? 'hidden' : ''} div-teaching-hours text-gray-400 mt-1">
                    <span>ทฤษฎี: <input type="number" class="input-theory bg-[#0f121d] border border-[#2d3748] rounded w-12 text-center text-xs text-white" value="${w.theoryHrs}"> ชม.</span>
                    <span>ปฏิบัติ: <input type="number" class="input-practice bg-[#0f121d] border border-[#2d3748] rounded w-12 text-center text-xs text-white" value="${w.practiceHrs}"> ชม.</span>
                    <span class="font-bold text-white ml-auto">รวม: ${w.totalHrs} ชม.</span>
                </div>
            `;

            // Bind week item inputs
            const chkHoli = item.querySelector('.chk-holiday');
            const inputReason = item.querySelector('.input-holiday-reason');
            const divReason = item.querySelector('.div-holiday-reason');
            const divHrs = item.querySelector('.div-teaching-hours');
            const inputDate = item.querySelector('.input-week-date');
            const inputTime = item.querySelector('.input-week-time');
            const inputTheory = item.querySelector('.input-theory');
            const inputPractice = item.querySelector('.input-practice');

            chkHoli.addEventListener('change', () => {
                w.isHoliday = chkHoli.checked;
                if (w.isHoliday) {
                    if (!w.holidayReason) w.holidayReason = "หยุดตามมติ ครม.";
                    w.theoryHrs = 0;
                    w.practiceHrs = 0;
                    w.totalHrs = 0;
                    divReason.classList.remove('hidden');
                    divHrs.classList.add('hidden');
                    item.className = 'p-2.5 rounded-lg border text-xs transition bg-red-950/20 border-red-500/40';
                } else {
                    w.holidayReason = "";
                    const defTh = activeClaim.theoryHours !== undefined ? activeClaim.theoryHours : 3;
                    const defPr = activeClaim.practiceHours !== undefined ? activeClaim.practiceHours : 0;
                    w.theoryHrs = defTh;
                    w.practiceHrs = defPr;
                    w.totalHrs = defTh + defPr;
                    divReason.classList.add('hidden');
                    divHrs.classList.remove('hidden');
                    item.className = 'p-2.5 rounded-lg border text-xs transition bg-[#141725] border-[#2d3748]';
                }
                updateCalculationsAndPreview();
            });

            inputReason.addEventListener('input', () => {
                w.holidayReason = inputReason.value;
                renderA4Page1();
            });

            inputDate.addEventListener('input', () => {
                handleDateInputChange(w, inputDate.value, item, false);
            });
            inputDate.addEventListener('change', () => {
                handleDateInputChange(w, inputDate.value, item, false);
            });

            inputTime.addEventListener('input', () => {
                handleTimeInputChange(w, inputTime.value, item);
            });
            inputTime.addEventListener('change', () => {
                handleTimeInputChange(w, inputTime.value, item);
            });

            inputTheory.addEventListener('input', () => {
                w.theoryHrs = parseInt(inputTheory.value) || 0;
                w.totalHrs = w.theoryHrs + (parseInt(w.practiceHrs) || 0);
                updateCalculationsAndPreview();
            });

            inputPractice.addEventListener('input', () => {
                w.practiceHrs = parseInt(inputPractice.value) || 0;
                w.totalHrs = (parseInt(w.theoryHrs) || 0) + w.practiceHrs;
                updateCalculationsAndPreview();
            });

            container.appendChild(item);
        });
    }
}

// Helper to split Thai Full Name into { name, surname }
function splitThaiFullName(fullName = '') {
    const trimmed = (fullName || '').trim();
    if (!trimmed) return { name: '', surname: '' };

    const prefixes = ['นางสาว', 'นาย', 'นาง', 'น.ส.', 'ด.ช.', 'ด.ญ.'];
    const parts = trimmed.split(/\s+/);
    
    if (parts.length <= 1) {
        return { name: parts[0] || '', surname: '' };
    }

    // Check if first token is a standalone prefix (e.g. ["นาย", "วัชรายุทธ", "นิพระขัน"])
    if (parts.length >= 3 && prefixes.includes(parts[0])) {
        return {
            name: `${parts[0]} ${parts[1]}`,
            surname: parts.slice(2).join(' ')
        };
    }

    return {
        name: parts[0],
        surname: parts.slice(1).join(' ')
    };
}

// Render Tab 4: Students Editor (รวมเป็นช่องกรอกเดียว: ชื่อ-สกุล)
function renderStudentsEditor() {
    const container = document.getElementById('claim-students-editor-list');
    const badgeCount = document.getElementById('claim-student-count-badge');
    if (!container) return;

    const count = activeClaim.students ? activeClaim.students.length : 0;
    if (badgeCount) badgeCount.textContent = count;
    container.innerHTML = '';

    (activeClaim.students || []).forEach((st, idx) => {
        const row = document.createElement('div');
        row.className = 'p-2 bg-[#141725] border border-[#2d3748] rounded-lg text-xs flex items-center gap-2';
        
        // ประกอบชื่อ-สกุลเต็มสำหรับแสดงในช่องกรอกเดียว
        const currentFullName = [st.name || '', st.surname || ''].filter(Boolean).join(' ');

        row.innerHTML = `
            <span class="text-gray-500 font-mono w-5 text-right">${idx + 1}.</span>
            <div class="relative w-28">
                <input type="text" class="input-st-id bg-[#0f121d] border border-[#2d3748] rounded px-2 py-1.5 text-xs text-blue-300 w-full font-mono" value="${st.studentId || ''}" placeholder="รหัสนักศึกษา" autocomplete="off">
            </div>
            <div class="relative flex-1">
                <input type="text" class="input-st-fullname w-full bg-[#0f121d] border border-[#2d3748] rounded px-2 py-1.5 text-xs text-white" value="${currentFullName}" placeholder="ชื่อ - สกุล (เช่น นายวัชรายุทธ นิพระขัน)" autocomplete="off">
            </div>
            <button class="btn-del-st text-gray-500 hover:text-red-400 p-1" title="ลบนักศึกษา"><i class="fa-solid fa-trash-can"></i></button>
        `;

        const idInput = row.querySelector('.input-st-id');
        const fullnameInput = row.querySelector('.input-st-fullname');

        idInput.addEventListener('input', (e) => {
            st.studentId = e.target.value;
            renderA4Page2();
        });

        fullnameInput.addEventListener('input', (e) => {
            const splitted = splitThaiFullName(e.target.value);
            st.name = splitted.name;
            st.surname = splitted.surname;
            renderA4Page2();
        });

        // Autocomplete for Student Full Name
        createAutocompleteDropdown(fullnameInput, {
            getItems: (query) => {
                const sorted = filterAndSortSuggestions(appData.students || [], query, stItem => ({
                    primary: stItem.name,
                    secondary: stItem.studentId || ''
                }));
                return sorted.map(stItem => ({
                    title: stItem.name,
                    subtitle: stItem.studentId ? `รหัสนักศึกษา: ${stItem.studentId}` : '',
                    value: stItem.name,
                    raw: stItem
                }));
            },
            onSelect: (item) => {
                const s = item.raw;
                const full = (s.name || '').trim();
                const splitted = splitThaiFullName(full);
                fullnameInput.value = full;
                if (s.studentId) idInput.value = s.studentId;
                st.name = splitted.name;
                st.surname = splitted.surname;
                st.studentId = s.studentId || st.studentId || '';
                renderA4Page2();
            }
        });

        // Autocomplete for Student ID
        createAutocompleteDropdown(idInput, {
            getItems: (query) => {
                const sorted = filterAndSortSuggestions(appData.students || [], query, stItem => ({
                    primary: stItem.studentId || '',
                    secondary: stItem.name || ''
                }));
                return sorted.map(stItem => ({
                    title: stItem.studentId || '',
                    subtitle: stItem.name || '',
                    value: stItem.studentId || '',
                    raw: stItem
                }));
            },
            onSelect: (item) => {
                const s = item.raw;
                const full = (s.name || '').trim();
                const splitted = splitThaiFullName(full);
                idInput.value = s.studentId || '';
                fullnameInput.value = full;
                st.name = splitted.name;
                st.surname = splitted.surname;
                st.studentId = s.studentId || '';
                renderA4Page2();
            }
        });

        row.querySelector('.btn-del-st').addEventListener('click', () => {
            activeClaim.students.splice(idx, 1);
            activeClaim.studentCount = activeClaim.students.length;
            if (activeSubjectRef) activeSubjectRef.studentCount = activeClaim.students.length;
            document.getElementById('claim-input-students').value = activeClaim.students.length;
            renderStudentsEditor();
            renderA4Page2();
            renderA4Page1();
        });

        container.appendChild(row);
    });
}

// -------------------------------------------------------------------------
// SELECT STUDENTS MODAL FOR CLAIM SUBJECT
// -------------------------------------------------------------------------
let selectedStudentClaimKeys = new Set();
let selectStudentsClaimEventsInitialized = false;

function openSelectStudentsClaimModal() {
    selectedStudentClaimKeys.clear();
    const searchInput = document.getElementById('input-search-claim-students');
    if (searchInput) searchInput.value = '';
    const btnClear = document.getElementById('btn-clear-search-claim-students');
    if (btnClear) btnClear.classList.add('hidden');

    const quickBox = document.getElementById('box-quick-add-student');
    if (quickBox) quickBox.classList.add('hidden');
    const qId = document.getElementById('quick-add-student-id');
    if (qId) qId.value = '';
    const qName = document.getElementById('quick-add-student-name');
    if (qName) qName.value = '';

    renderSelectStudentsClaimModalList('');
    initSelectStudentsClaimModalEvents();
    openModal('modal-select-students-claim');

    setTimeout(() => {
        if (searchInput) searchInput.focus();
    }, 100);
}

function renderSelectStudentsClaimModalList(query = '') {
    const container = document.getElementById('claim-modal-students-list');
    const selectedCounter = document.getElementById('claim-modal-selected-counter');
    const totalCounter = document.getElementById('claim-modal-total-counter');
    const btnConfirmCount = document.getElementById('btn-confirm-add-count');
    const btnConfirm = document.getElementById('btn-confirm-add-selected-students');
    if (!container) return;

    const allStudents = (appData && appData.students) ? appData.students : [];
    if (totalCounter) totalCounter.textContent = allStudents.length;

    // Track existing students in activeClaim
    const existingIds = new Set(
        (activeClaim.students || []).map(s => (s.studentId || '').trim()).filter(Boolean)
    );
    const existingNames = new Set(
        (activeClaim.students || []).map(s => {
            return [s.name || '', s.surname || ''].filter(Boolean).join(' ').trim();
        }).filter(Boolean)
    );

    const q = (query || '').trim().toLowerCase();
    const filtered = allStudents.filter(st => {
        if (!q) return true;
        const nameMatch = (st.name || '').toLowerCase().includes(q);
        const idMatch = (st.studentId || '').toLowerCase().includes(q);
        return nameMatch || idMatch;
    });

    container.innerHTML = '';

    if (allStudents.length === 0) {
        container.innerHTML = `
            <div class="py-8 text-center text-gray-400 space-y-2">
                <i class="fa-solid fa-user-graduate text-3xl text-gray-500"></i>
                <div class="text-xs">ยังไม่มีข้อมูลนักศึกษาในระบบ</div>
                <div class="text-[11px] text-gray-500">คลิกปุ่ม <b>+ เพิ่ม นศ. ใหม่เข้าระบบ</b> ด้านบน เพื่อเพิ่มรายชื่อนักศึกษา</div>
            </div>
        `;
    } else if (filtered.length === 0) {
        container.innerHTML = `
            <div class="py-8 text-center text-gray-400 space-y-2">
                <i class="fa-solid fa-magnifying-glass text-2xl text-gray-500"></i>
                <div class="text-xs">ไม่พบนักศึกษาที่ตรงกับคำค้นหา "${query}"</div>
                <div class="text-[11px] text-gray-500">ลองตรวจสอบตัวสะกด หรือคลิกปุ่มเพิ่มนักศึกษาใหม่เข้าระบบ</div>
            </div>
        `;
    } else {
        filtered.forEach((st, idx) => {
            const stName = (st.name || '').trim();
            const stId = (st.studentId || '').trim();
            const key = stId || st.id || `st_key_${idx}`;

            const isInClaim = (stId && existingIds.has(stId)) || (stName && existingNames.has(stName));
            const isSelected = selectedStudentClaimKeys.has(key);

            const row = document.createElement('div');
            if (isInClaim) {
                row.className = 'flex items-center gap-3 p-2.5 rounded-xl border border-emerald-500/20 bg-emerald-950/10 opacity-75';
                row.innerHTML = `
                    <input type="checkbox" class="w-4 h-4 rounded text-emerald-500 bg-[#0f121d] border-emerald-500/50 cursor-not-allowed" checked disabled>
                    <div class="flex-1 min-w-0 flex items-center justify-between gap-2">
                        <div class="min-w-0">
                            <div class="text-xs font-medium text-gray-300 truncate">${stName || 'ไม่ระบุชื่อ'}</div>
                            <div class="text-[11px] font-mono text-gray-500">${stId || 'ไม่มีรหัส'}</div>
                        </div>
                        <span class="px-2 py-0.5 rounded text-[10px] bg-emerald-500/20 text-emerald-300 border border-emerald-500/30 flex items-center gap-1 shrink-0">
                            <i class="fa-solid fa-check text-[9px]"></i> มีในวิชานี้แล้ว
                        </span>
                    </div>
                `;
            } else {
                row.className = `flex items-center gap-3 p-2.5 rounded-xl border transition cursor-pointer select-none ${
                    isSelected ? 'bg-blue-950/30 border-blue-500/50 text-white' : 'border-transparent hover:border-[#2d3748] hover:bg-[#141829] text-gray-300'
                }`;
                row.innerHTML = `
                    <input type="checkbox" class="claim-st-checkbox w-4 h-4 rounded text-blue-600 bg-[#0f121d] border-gray-600 cursor-pointer pointer-events-none" ${isSelected ? 'checked' : ''}>
                    <div class="flex-1 min-w-0 flex items-center justify-between gap-2">
                        <div class="min-w-0">
                            <div class="text-xs font-medium text-white truncate">${stName || 'ไม่ระบุชื่อ'}</div>
                            <div class="text-[11px] font-mono text-blue-400">${stId || 'ไม่มีรหัส'}</div>
                        </div>
                        ${isSelected ? '<span class="px-2 py-0.5 rounded text-[10px] bg-blue-500/20 text-blue-300 border border-blue-500/30 shrink-0"><i class="fa-solid fa-check text-[9px]"></i> เลือกแล้ว</span>' : ''}
                    </div>
                `;

                row.addEventListener('click', (e) => {
                    if (selectedStudentClaimKeys.has(key)) {
                        selectedStudentClaimKeys.delete(key);
                    } else {
                        selectedStudentClaimKeys.add(key);
                    }
                    updateSelectStudentsClaimCounts();
                    renderSelectStudentsClaimModalList(document.getElementById('input-search-claim-students')?.value || '');
                });
            }
            container.appendChild(row);
        });
    }

    updateSelectStudentsClaimCounts();
}

function updateSelectStudentsClaimCounts() {
    const selectedCounter = document.getElementById('claim-modal-selected-counter');
    const btnConfirmCount = document.getElementById('btn-confirm-add-count');
    const btnConfirm = document.getElementById('btn-confirm-add-selected-students');
    const count = selectedStudentClaimKeys.size;

    if (selectedCounter) selectedCounter.textContent = count;
    if (btnConfirmCount) btnConfirmCount.textContent = count;
    if (btnConfirm) {
        if (count === 0) {
            btnConfirm.disabled = true;
            btnConfirm.classList.add('opacity-50', 'cursor-not-allowed');
        } else {
            btnConfirm.disabled = false;
            btnConfirm.classList.remove('opacity-50', 'cursor-not-allowed');
        }
    }
}

function initSelectStudentsClaimModalEvents() {
    if (selectStudentsClaimEventsInitialized) return;
    selectStudentsClaimEventsInitialized = true;

    // Search Input
    const searchInput = document.getElementById('input-search-claim-students');
    const btnClearSearch = document.getElementById('btn-clear-search-claim-students');

    if (searchInput) {
        searchInput.addEventListener('input', (e) => {
            const val = e.target.value;
            if (btnClearSearch) {
                if (val.trim()) btnClearSearch.classList.remove('hidden');
                else btnClearSearch.classList.add('hidden');
            }
            renderSelectStudentsClaimModalList(val);
        });
    }

    if (btnClearSearch) {
        btnClearSearch.addEventListener('click', () => {
            if (searchInput) {
                searchInput.value = '';
                searchInput.focus();
            }
            btnClearSearch.classList.add('hidden');
            renderSelectStudentsClaimModalList('');
        });
    }

    // Select All (from currently filtered, excluding already in claim)
    const btnSelectAll = document.getElementById('btn-claim-select-all-students');
    if (btnSelectAll) {
        btnSelectAll.addEventListener('click', () => {
            const allStudents = (appData && appData.students) ? appData.students : [];
            const existingIds = new Set(
                (activeClaim.students || []).map(s => (s.studentId || '').trim()).filter(Boolean)
            );
            const existingNames = new Set(
                (activeClaim.students || []).map(s => {
                    return [s.name || '', s.surname || ''].filter(Boolean).join(' ').trim();
                }).filter(Boolean)
            );
            const q = (searchInput?.value || '').trim().toLowerCase();

            allStudents.forEach((st, idx) => {
                const stName = (st.name || '').trim();
                const stId = (st.studentId || '').trim();
                if (q) {
                    const nameMatch = stName.toLowerCase().includes(q);
                    const idMatch = stId.toLowerCase().includes(q);
                    if (!nameMatch && !idMatch) return;
                }
                const isInClaim = (stId && existingIds.has(stId)) || (stName && existingNames.has(stName));
                if (!isInClaim) {
                    const key = stId || st.id || `st_key_${idx}`;
                    selectedStudentClaimKeys.add(key);
                }
            });
            renderSelectStudentsClaimModalList(searchInput?.value || '');
        });
    }

    // Deselect All
    const btnDeselectAll = document.getElementById('btn-claim-deselect-all-students');
    if (btnDeselectAll) {
        btnDeselectAll.addEventListener('click', () => {
            selectedStudentClaimKeys.clear();
            renderSelectStudentsClaimModalList(searchInput?.value || '');
        });
    }

    // Toggle Quick Add Form
    const btnToggleQuick = document.getElementById('btn-toggle-quick-add-student');
    const boxQuick = document.getElementById('box-quick-add-student');
    const btnCancelQuick = document.getElementById('btn-cancel-quick-add-student');
    const btnSaveQuick = document.getElementById('btn-save-quick-add-student');

    if (btnToggleQuick && boxQuick) {
        btnToggleQuick.addEventListener('click', () => {
            boxQuick.classList.toggle('hidden');
            if (!boxQuick.classList.contains('hidden')) {
                const qId = document.getElementById('quick-add-student-id');
                if (qId) qId.focus();
            }
        });
    }

    if (btnCancelQuick && boxQuick) {
        btnCancelQuick.addEventListener('click', () => {
            boxQuick.classList.add('hidden');
        });
    }

    if (btnSaveQuick) {
        btnSaveQuick.addEventListener('click', () => {
            const idInput = document.getElementById('quick-add-student-id');
            const nameInput = document.getElementById('quick-add-student-name');
            const sid = idInput ? idInput.value.trim() : '';
            const sname = nameInput ? nameInput.value.trim() : '';

            if (!sid && !sname) {
                alert('กรุณากรอกรหัสนักศึกษา หรือชื่อ-สกุล');
                return;
            }

            if (!appData.students) appData.students = [];

            // Check if student already exists in master students list
            let existing = appData.students.find(s => 
                (sid && s.studentId && s.studentId.trim() === sid) ||
                (sname && s.name && s.name.trim() === sname)
            );

            let key = '';
            if (existing) {
                key = existing.studentId || existing.id;
            } else {
                const newStudent = {
                    id: (typeof generateId === 'function') ? generateId() : 'st_' + Date.now(),
                    studentId: sid,
                    name: sname
                };
                appData.students.push(newStudent);
                key = sid || newStudent.id;
                saveData();
            }

            selectedStudentClaimKeys.add(key);

            if (idInput) idInput.value = '';
            if (nameInput) nameInput.value = '';
            if (boxQuick) boxQuick.classList.add('hidden');

            renderSelectStudentsClaimModalList(searchInput?.value || '');
        });
    }

    // Confirm Add Selected Students
    const btnConfirm = document.getElementById('btn-confirm-add-selected-students');
    if (btnConfirm) {
        btnConfirm.addEventListener('click', () => {
            if (selectedStudentClaimKeys.size === 0) {
                alert('กรุณาเลือกนักศึกษาอย่างน้อย 1 คน');
                return;
            }

            if (!activeClaim.students) activeClaim.students = [];

            const allStudents = (appData && appData.students) ? appData.students : [];
            let addedCount = 0;

            allStudents.forEach((st, idx) => {
                const stName = (st.name || '').trim();
                const stId = (st.studentId || '').trim();
                const key = stId || st.id || `st_key_${idx}`;

                if (selectedStudentClaimKeys.has(key)) {
                    const splitted = splitThaiFullName(stName);
                    const alreadyIn = activeClaim.students.some(s => {
                        return (stId && s.studentId && s.studentId.trim() === stId) ||
                               (s.name === splitted.name && s.surname === splitted.surname);
                    });

                    if (!alreadyIn) {
                        activeClaim.students.push({
                            studentId: stId,
                            name: splitted.name || '',
                            surname: splitted.surname || ''
                        });
                        addedCount++;
                    }
                }
            });

            activeClaim.studentCount = activeClaim.students.length;
            if (activeSubjectRef) {
                activeSubjectRef.studentCount = activeClaim.students.length;
                if (activeSubjectRef.claimData) {
                    activeSubjectRef.claimData.students = activeClaim.students;
                    activeSubjectRef.claimData.studentCount = activeClaim.students.length;
                }
            }

            const inpStudents = document.getElementById('claim-input-students');
            if (inpStudents) inpStudents.value = activeClaim.students.length;

            renderStudentsEditor();
            renderA4Page1();
            renderA4Page2();
            updateCalculationsAndPreview();
            saveData();
            if (typeof triggerAutoCloudSync === 'function') {
                triggerAutoCloudSync();
            }

            // Close modal
            const modal = document.getElementById('modal-select-students-claim');
            if (modal) {
                modal.classList.remove('active');
                modal.classList.add('hidden');
            }
        });
    }
}

window.openSelectStudentsClaimModal = openSelectStudentsClaimModal;

// -------------------------------------------------------------------------
// LIVE A4 RENDERING: PAGE 1 (ใบเบิกเงินค่าตอบแทนภาคสมทบ)
// -------------------------------------------------------------------------
function generateA4Page1HTML(claim = activeClaim) {
    if (!claim) return '';

    const totals = calculateClaimTotals(claim);
    const weeks = claim.weeks || [];
    const defSig = getDefaultSignatures2To9();
    const rawSig = claim.signatures || {};

    const curDept = claim.department || 'เทคโนโลยีโยธา';
    const defaultDHRole = getFormattedDeptRole(curDept, 'deptHead');
    const defaultPCRole = getFormattedDeptRole(curDept, 'programChair');

    let resolvedDHRole = rawSig.deptHeadRole;
    if (!resolvedDHRole || (resolvedDHRole.includes('โยธา') && !curDept.includes('โยธา'))) {
        resolvedDHRole = defaultDHRole;
    }

    let resolvedPCRole = rawSig.programChairRole;
    if (!resolvedPCRole || (resolvedPCRole.includes('โยธา') && !curDept.includes('โยธา'))) {
        resolvedPCRole = defaultPCRole;
    }

    const sig = {
        teacher: rawSig.teacher || claim.teacherName || '',
        teacherRole: rawSig.teacherRole || claim.teacherRole || 'อาจารย์ผู้สอน',
        programChair: rawSig.programChair || defSig.programChair || '',
        programChairRole: resolvedPCRole || defSig.programChairRole || defaultPCRole,
        curriculumHead: rawSig.curriculumHead || defSig.curriculumHead || 'นายชนะ สุทธิประภา',
        curriculumHeadRole: rawSig.curriculumHeadRole || defSig.curriculumHeadRole || 'หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ',
        deptHead: rawSig.deptHead || defSig.deptHead || 'นายปริวัฒน์ ยืนยิ่ง',
        deptHeadRole: resolvedDHRole || defSig.deptHeadRole || defaultDHRole,
        techHead: rawSig.techHead || defSig.techHead || 'นายสถิระ กาญจันดา',
        techHeadRole: rawSig.techHeadRole || defSig.techHeadRole || 'หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต',
        academicDeputy: rawSig.academicDeputy || defSig.academicDeputy || 'นายสุวิชา มั่นยืน',
        academicDeputyRole: rawSig.academicDeputyRole || defSig.academicDeputyRole || 'รองผู้อำนวยการฝ่ายวิชาการ',
        financeHead: rawSig.financeHead || defSig.financeHead || 'นางมลีทอง จารุพงษ์',
        financeHeadRole: rawSig.financeHeadRole || defSig.financeHeadRole || 'หัวหน้าการเงิน',
        resourceDeputy: rawSig.resourceDeputy || defSig.resourceDeputy || 'นางสาวสายฝน สาระผล',
        resourceDeputyRole: rawSig.resourceDeputyRole || defSig.resourceDeputyRole || 'รองผู้อำนวยการฝ่ายบริหารทรัพยากร',
        director: rawSig.director || defSig.director || 'นายธาตรี พิบูลมณฑา',
        directorRole: rawSig.directorRole || defSig.directorRole || 'ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี'
    };

    // Format academic year as 1/2568
    let yearFormatted = (claim.academicYear || '1/2568').trim();
    if (yearFormatted.startsWith('ปีการศึกษา')) {
        yearFormatted = yearFormatted.replace('ปีการศึกษา', '').trim();
    } else if (yearFormatted.includes('/') && !yearFormatted.includes('25')) {
        const parts = yearFormatted.split('/');
        yearFormatted = `${parts[0]}/25${parts[1]}`;
    }

    let scheduleRowsHtml = '';
    const n = claim.teachingDaysPerWeek || 1;
    const is2Days = (n === 2);
    const mSub = (appData.subjects_master || []).find(s => s.code === claim.subjectCode || s.name === claim.subjectName);
    let weeklyHoursPlan = 3;
    if (claim.theoryHours !== undefined && claim.practiceHours !== undefined) {
        weeklyHoursPlan = claim.theoryHours + claim.practiceHours;
    } else if (mSub) {
        const th = mSub.theoryHours !== undefined ? mSub.theoryHours : 3;
        const pr = mSub.practiceHours !== undefined ? mSub.practiceHours : 0;
        weeklyHoursPlan = mSub.hours || (th + pr);
    } else if (claim.weeklyHours) {
        weeklyHoursPlan = claim.weeklyHours;
    } else {
        weeklyHoursPlan = (claim.teachingDays || []).reduce((sum, d) => sum + (parseInt(d.hours) || 0), 0) || 3;
    }

    for (let r = 0; r < 9; r++) {
        let wLeft, wRight;
        let leftWeekNum = '';
        let rightWeekNum = '';

        if (is2Days && claim.summerTableLayout === 'side_by_side') {
            // side_by_side: Left = Day 1 of week r+1, Right = Day 2 of week r+1
            wLeft = weeks[r * 2] || { weekNo: r + 1, dayNo: 1, dateStr: '', timeStr: '', theoryHrs: 0, practiceHrs: 0, totalHrs: 0, isHoliday: false, holidayReason: '' };
            wRight = weeks[r * 2 + 1] || { weekNo: r + 1, dayNo: 2, dateStr: '', timeStr: '', theoryHrs: 0, practiceHrs: 0, totalHrs: 0, isHoliday: false, holidayReason: '' };
            leftWeekNum = `${r + 1}`;
            rightWeekNum = `${r + 1}`;
        } else {
            // Sequential filling for N >= 3, or N=2 sequential, or N=1: Left = session r, Right = session r + 9
            wLeft = weeks[r] || { weekNo: Math.floor(r / n) + 1, dayNo: (r % n) + 1, dateStr: '', timeStr: '', theoryHrs: 0, practiceHrs: 0, totalHrs: 0, isHoliday: false, holidayReason: '' };
            wRight = weeks[r + 9] || { weekNo: Math.floor((r + 9) / n) + 1, dayNo: ((r + 9) % n) + 1, dateStr: '', timeStr: '', theoryHrs: 0, practiceHrs: 0, totalHrs: 0, isHoliday: false, holidayReason: '' };
            leftWeekNum = `${wLeft.weekNo}`;
            rightWeekNum = `${wRight.weekNo}`;
        }

        const leftDIdx = wLeft.dayNo ? wLeft.dayNo - 1 : (r % n);
        const rightDIdx = wRight.dayNo ? wRight.dayNo - 1 : ((r + 9) % n);
        const leftTime = wLeft.timeStr || (claim.teachingDays && claim.teachingDays[leftDIdx] ? claim.teachingDays[leftDIdx].time : '17.00-20.00');
        const rightTime = wRight.timeStr || (claim.teachingDays && claim.teachingDays[rightDIdx] ? claim.teachingDays[rightDIdx].time : '17.00-20.00');

        // Left Cell
        let leftContent = '';
        if (wLeft.isHoliday) {
            leftContent = `
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${leftWeekNum}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${wLeft.dateStr}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${leftTime}</td>
                <td colspan="3" style="text-align: center; border: 1px solid #000; padding: 1.5px 2px; vertical-align: middle;">
                    <div class="clamp-2-lines" style="font-size: 13.5px; line-height: 1.25; max-height: 2.6em; overflow: hidden; display: -webkit-box; -webkit-line-clamp: 2; -webkit-box-orient: vertical; word-break: break-word; text-align: center; margin: 0 auto;" title="${wLeft.holidayReason || 'วันหยุด'}">
                        ${shortenHolidayName(wLeft.holidayReason || 'วันหยุด')}
                    </div>
                </td>
            `;
        } else {
            leftContent = `
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${leftWeekNum}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${wLeft.dateStr}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${leftTime}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${wLeft.theoryHrs}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${wLeft.practiceHrs}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${wLeft.totalHrs}</td>
            `;
        }

        // Right Cell
        let rightContent = '';
        if (wRight.isHoliday) {
            rightContent = `
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${rightWeekNum}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${wRight.dateStr}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${rightTime}</td>
                <td colspan="3" style="text-align: center; border: 1px solid #000; padding: 1.5px 2px; vertical-align: middle;">
                    <div class="clamp-2-lines" style="font-size: 13.5px; line-height: 1.25; max-height: 2.6em; overflow: hidden; display: -webkit-box; -webkit-line-clamp: 2; -webkit-box-orient: vertical; word-break: break-word; text-align: center; margin: 0 auto;" title="${wRight.holidayReason || 'วันหยุด'}">
                        ${shortenHolidayName(wRight.holidayReason || 'วันหยุด')}
                    </div>
                </td>
            `;
        } else {
            rightContent = `
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${rightWeekNum}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${wRight.dateStr}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${rightTime}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${wRight.theoryHrs}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${wRight.practiceHrs}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2.5px 1px;">${wRight.totalHrs}</td>
            `;
        }

        scheduleRowsHtml += `<tr>${leftContent}${rightContent}</tr>`;
    }

    return `
        <div style="font-family: 'TH Sarabun PSK', 'TH Sarabun New', 'Sarabun', Tahoma, sans-serif; color: #000; line-height: 1.35; padding: 0 4px; font-size: 14pt;">
            
            <!-- Page 1 Title -->
            <div style="text-align: center; font-size: 20pt; font-weight: bold; margin-bottom: 3px; letter-spacing: 0.2px;">
                ใบเบิกเงินค่าตอบแทนภาคสมทบ
            </div>
            <div style="text-align: center; font-size: 17pt; font-weight: bold; margin-bottom: 14px; letter-spacing: 0.2px;">
                วิทยาลัยเทคนิคอุบลราชธานี
            </div>

            <!-- Page 1 Subheader details -->
            <div style="font-size: 14pt; margin-bottom: 4px;">
                ${claim.level && claim.level.startsWith('ชั้นปี') ? claim.level : 'ชั้นปี ' + (claim.level || '1')}&nbsp;&nbsp;&nbsp;&nbsp;ปีการศึกษา ${yearFormatted}&nbsp;&nbsp;&nbsp;&nbsp;${claim.curriculum || 'หลักสูตร ปริญญาตรี สายเทคโนโลยีหรือสายปฏิบัติการ'}&nbsp;&nbsp;&nbsp;&nbsp;สาขาวิชา ${claim.department || 'เทคโนโลยีโยธา'}
            </div>
            <div style="font-size: 14pt; margin-bottom: 4px;">
                ชื่อผู้ขอเบิก ${claim.teacherName || ''}&nbsp;&nbsp;&nbsp;&nbsp;ตำแหน่ง ${claim.teacherRole || 'อาจารย์'}
            </div>
            <div style="font-size: 14pt; margin-bottom: 4px;">
                ระหว่างวันที่ ${formatThaiDateFull(claim.startDate)} ถึง วันที่ ${claim.endDateThai || ''}
            </div>
            <div style="font-size: 14pt; margin-bottom: 10px;">
                รหัสวิชา ${claim.subjectCode}&nbsp;&nbsp;&nbsp;&nbsp;ชื่อวิชา ${claim.subjectName}&nbsp;&nbsp;&nbsp;&nbsp;เวลาเรียน ${weeklyHoursPlan} ชม.&nbsp;&nbsp;&nbsp;&nbsp;จำนวน ${claim.credits || 3} หน่วยกิต
            </div>

            <!-- 18 Weeks Split Table -->
            <table class="doc-table" style="width: 100%; border-collapse: collapse; font-size: 14pt; margin-bottom: 10px;">
                <thead>
                    <tr style="font-weight: bold; text-align: center; background-color: #fafafa;">
                        <th style="width: 6%; border: 1px solid #000; padding: 2px 1px;">สัปดาห์</th>
                        <th style="width: 13.5%; border: 1px solid #000; padding: 2px 1px;">ว/ด/ป</th>
                        <th style="width: 15%; border: 1px solid #000; padding: 2px 1px;">ช่วงเวลา</th>
                        <th style="width: 5%; border: 1px solid #000; padding: 2px 1px;">ท</th>
                        <th style="width: 5%; border: 1px solid #000; padding: 2px 1px;">ป</th>
                        <th style="width: 5.5%; border: 1px solid #000; padding: 2px 1px;">รวม</th>
                        <th style="width: 6%; border: 1px solid #000; padding: 2px 1px;">สัปดาห์</th>
                        <th style="width: 13.5%; border: 1px solid #000; padding: 2px 1px;">ว/ด/ป</th>
                        <th style="width: 15%; border: 1px solid #000; padding: 2px 1px;">ช่วงเวลา</th>
                        <th style="width: 5%; border: 1px solid #000; padding: 2px 1px;">ท</th>
                        <th style="width: 5%; border: 1px solid #000; padding: 2px 1px;">ป</th>
                        <th style="width: 5.5%; border: 1px solid #000; padding: 2px 1px;">รวม</th>
                    </tr>
                </thead>
                <tbody>
                    ${scheduleRowsHtml}
                    <!-- Total Row -->
                    <tr style="font-weight: bold;">
                        <td colspan="9" style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 14pt;">รวมชั่วโมงสอน</td>
                        <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 14pt;">${totals.totalTheory}</td>
                        <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 14pt;">${totals.totalPractice}</td>
                        <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 14pt;">${totals.grandTotalHrs}</td>
                    </tr>
                </tbody>
            </table>

            <!-- Signatures & Calculation Section with Vertical Line Divider -->
            <div style="display: flex; font-size: 14pt; line-height: 1.35; margin-top: 10px;">
                
                <!-- Left 67%: Calculation & Staff Signatures -->
                <div style="width: 67%; padding-right: 14px; box-sizing: border-box;">
                    <!-- Calculation and text below table -->
                    <div style="font-size: 14pt; line-height: 1.45; margin-bottom: 12px;">
                        <div>
                            โดยขอเบิกในอัตราชั่วโมงละ &nbsp;${claim.rate}&nbsp; บาท &nbsp;&nbsp;จำนวน &nbsp;${totals.grandTotalHrs}&nbsp; ชม. &nbsp;&nbsp;${claim.credits}&nbsp; หน่วยกิต
                        </div>
                        <div style="margin-top: 2px;">
                            ตามจำนวนนักศึกษาลงทะเบียนเรียนวิชา ${claim.subjectName}
                        </div>
                        <div id="p1-calc-total-line" style="margin-top: 2px; white-space: nowrap; overflow: hidden;">
                            รวมจำนวน &nbsp;${claim.students ? claim.students.length : (claim.studentCount || 6)}&nbsp; คน &nbsp;&nbsp;ร้อยละ ${claim.percent || 60} เป็นเงิน &nbsp;${formatMoney(totals.totalMoney)}&nbsp; บาท (${totals.bahtString})
                        </div>
                    </div>

                    <!-- Row 1 Signatures -->
                    <div style="display: flex; justify-content: space-between; margin-bottom: 12px;">
                        <div style="width: 48%; text-align: center;">
                            ลงชื่อ..................................ผู้ขอเบิก<br>
                            ( ${sig.teacher || claim.teacherName || ''} )<br>
                            ตำแหน่ง ${sig.teacherRole || claim.teacherRole || 'อาจารย์ผู้สอน'}
                        </div>
                        <div style="width: 48%; text-align: center;">
                            ลงชื่อ.................................................<br>
                            ( ${sig.curriculumHead || 'นายชนะ สุทธิประภา'} )<br>
                            ${sig.curriculumHeadRole || 'หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีฯ'}
                        </div>
                    </div>

                    <!-- Verification header -->
                    <div style="font-weight: bold; font-size: 14pt; margin: 8px 0 6px 0;">
                        ขอรับรองว่าได้ตรวจสอบถูกต้องแล้ว
                    </div>

                    <!-- Row 2 Signatures -->
                    <div style="display: flex; justify-content: space-between; margin-bottom: 12px;">
                        <div style="width: 48%; text-align: center;">
                            ลงชื่อ.................................................<br>
                            ( ${sig.deptHead || 'นายปริวัฒน์ ยืนยิ่ง'} )<br>
                            ${sig.deptHeadRole || defaultDHRole}
                        </div>
                        <div style="width: 48%; text-align: center;">
                            ลงชื่อ.................................................<br>
                            ( ${sig.academicDeputy || 'นายสุวิชา มั่นยืน'} )<br>
                            ${sig.academicDeputyRole || 'รองผู้อำนวยการฝ่ายวิชาการ'}
                        </div>
                    </div>

                    <!-- Row 3 Signature -->
                    <div style="display: flex; justify-content: flex-start;">
                        <div style="width: 48%; text-align: center;">
                            ลงชื่อ.................................................<br>
                            ( ${sig.techHead || 'นายสถิระ กาญจันดา'} )<br>
                            ${sig.techHeadRole || 'หัวหน้างานภาควิชาเทคโนโลยีบัณฑิต'}
                        </div>
                    </div>
                </div>

                <!-- Right 33%: Approval Box with clean vertical dividing line -->
                <div style="width: 33%; border-left: 1px solid #000; padding-left: 14px; box-sizing: border-box; display: flex; flex-direction: column; justify-content: space-between;">
                    <div style="font-weight: bold; font-size: 14pt; text-align: center; margin-bottom: 6px;">
                        เห็นควรอนุมัติให้เบิกได้
                    </div>
                    <div style="text-align: center; margin-bottom: 14px;">
                        ลงชื่อ.................................................<br>
                        ( ${sig.financeHead || 'นางมลีทอง จารุพงษ์'} )<br>
                        ${sig.financeHeadRole || 'หัวหน้าการเงิน'}
                    </div>
                    <div style="text-align: center; margin-bottom: 14px;">
                        ลงชื่อ.................................................<br>
                        ( ${sig.resourceDeputy || 'นางสาวสายฝน สาระผล'} )<br>
                        ${sig.resourceDeputyRole || 'รองผู้อำนวยการฝ่ายบริหารทรัพยากร'}
                    </div>
                    <div style="text-align: center;">
                        ลงชื่อ.................................................<br>
                        ( ${sig.director || 'นายธาตรี พิบูลมณฑา'} )<br>
                        ${sig.directorRole || 'ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี'}
                    </div>
                </div>

            </div>

        </div>
    `;
}

function renderA4Page1() {
    const page1 = document.getElementById('doc-page-1');
    if (!page1 || !activeClaim) return;
    page1.innerHTML = generateA4Page1HTML(activeClaim);

    // ปรับลดขนาดตัวอักษรยอดเงินรวมอัตโนมัติหากยาวเกิน 1 บรรทัด เพื่อให้อยู่ใน 1 บรรทัดเสมอ
    const totalLineEl = page1.querySelector('#p1-calc-total-line');
    if (totalLineEl) {
        let currentPt = 14;
        while (totalLineEl.scrollWidth > totalLineEl.clientWidth && currentPt > 8.5) {
            currentPt -= 0.5;
            totalLineEl.style.fontSize = currentPt + 'pt';
        }
    }
}

// -------------------------------------------------------------------------
// LIVE A4 RENDERING: PAGE 2 (ใบตรวจสอบการเข้าเรียนนักศึกษา 18 สัปดาห์)
// -------------------------------------------------------------------------
function generateA4Page2HTML(claim = activeClaim) {
    if (!claim) return '';

    const weeks = claim.weeks || [];
    const students = claim.students || [];
    const sig = claim.signatures || {};

    // Header 18 dates vertical cells
    let weekHeaderCols = '';
    weeks.forEach(w => {
        weekHeaderCols += `
            <th style="width: 17px; min-width: 17px; max-width: 17px; height: 62px; padding: 2px 0; text-align: center; vertical-align: bottom; border: 1px solid #000; box-sizing: border-box;">
                <div style="writing-mode: vertical-rl; transform: rotate(180deg); font-size: 13px; font-weight: 500; white-space: nowrap; margin: 0 auto; letter-spacing: -0.2px;">
                    ${w.dateStr}
                </div>
            </th>
        `;
    });

    // Student rows: ตัดตามจำนวนนักศึกษาจริง ไม่สร้างช่องเปล่าต่อท้าย
    let studentRowsHtml = '';
    const totalRenderRows = students.length;

    for (let i = 0; i < totalRenderRows; i++) {
        const st = students[i];
        const rowNo = i + 1;

        let weekCells = '';
        weeks.forEach(w => {
            if (w.isHoliday) {
                // Red shaded holiday cell as per RC reference PDF
                weekCells += `<td style="background-color: #ff0000; border: 1px solid #000; padding: 0; width: 17px; min-width: 17px; max-width: 17px; box-sizing: border-box;"></td>`;
            } else {
                // Blank check cell as per RC reference PDF
                weekCells += `<td style="border: 1px solid #000; padding: 0; width: 17px; min-width: 17px; max-width: 17px; box-sizing: border-box;"></td>`;
            }
        });

        let fName = (st.name || '').trim();
        let lName = (st.surname || '').trim();
        if (!lName && fName) {
            const splitted = splitThaiFullName(fName);
            fName = splitted.name;
            lName = splitted.surname;
        }

        studentRowsHtml += `
            <tr style="height: 22px;">
                <td style="text-align: center; font-size: 14pt; border: 1px solid #000;">${rowNo}</td>
                <td style="text-align: center; font-size: 14pt; white-space: nowrap; padding: 2px 3px; border: 1px solid #000;">${st.studentId || ''}</td>
                <td style="padding: 2px 4px; white-space: nowrap; font-size: 14pt; border: 1px solid #000;">${fName}</td>
                <td style="padding: 2px 4px; white-space: nowrap; font-size: 14pt; border: 1px solid #000;">${lName}</td>
                ${weekCells}
                <td style="border: 1px solid #000;"></td>
            </tr>
        `;
    }

    const p2TermFormatted = (claim.academicYear || '1/2568').trim().startsWith('ภาคเรียนที่')
        ? (claim.academicYear || '1/2568').trim()
        : `ภาคเรียนที่ ${claim.academicYear || '1/2568'}`;

    return `
        <div style="font-family: 'TH Sarabun New', 'TH Sarabun PSK', 'Sarabun', Tahoma, sans-serif; line-height: 1.25; color: #000; font-size: 14pt;">
            
            <!-- Page 2 Header -->
            <div style="text-align: center; font-size: 18pt; font-weight: bold; margin-bottom: 2px;">
                ใบตรวจสอบการเข้าเรียนนักศึกษา ระดับปริญญาตรี หลักสูตรเทคโนโลยีบัณฑิต (ทล.บ.)
            </div>
            <div style="text-align: center; font-size: 15pt; font-weight: bold; margin-bottom: 2px;">
                สาขาวิชา ${claim.department || 'เทคโนโลยีโยธา'} ${p2TermFormatted}
            </div>
            <div style="text-align: center; font-size: 14pt; margin-bottom: 2px;">
                วิชา ${claim.subjectName} รหัสวิชา ${claim.subjectCode} สัปดาห์ที่ ${claim.teachingDaysPerWeek > 1 ? `1-${claim.totalWeeks || Math.ceil(18 / claim.teachingDaysPerWeek)} (18 ครั้ง)` : '1-18'}
            </div>
            <div style="text-align: center; font-size: 14pt; margin-bottom: 2px;">
                ระหว่างวันที่ ${formatThaiDateFull(claim.startDate)} ถึง วันที่ ${claim.endDateThai || ''}
            </div>
            <div style="text-align: center; font-size: 14pt; margin-bottom: 8px;">
                อาจารย์ผู้สอน ${claim.teacherName || ''}
            </div>

            <!-- Attendance Table (18 Weeks) - จัดกลางหน้ากระดาษและระบุขนาดคอลัมน์ชัดเจน -->
            <table class="doc-table" style="width: 100%; border-collapse: collapse; font-family: 'TH Sarabun New', 'TH Sarabun PSK', 'Sarabun', Tahoma, sans-serif; font-size: 14pt; margin: 0 auto 10px auto; table-layout: fixed;">
                <thead>
                    <tr style="background-color: #f1f5f9;">
                        <th rowspan="2" style="width: 36px; text-align: center; font-size: 14pt; padding: 3px 2px; border: 1px solid #000; white-space: nowrap;">ลำดับ</th>
                        <th rowspan="2" style="width: 94px; text-align: center; font-size: 14pt; white-space: nowrap; padding: 3px 2px; border: 1px solid #000;">รหัสประจำตัว</th>
                        <th rowspan="2" style="width: 120px; text-align: center; font-size: 14pt; white-space: nowrap; padding: 3px 2px; border: 1px solid #000;">ชื่อ</th>
                        <th rowspan="2" style="width: 88px; text-align: center; font-size: 14pt; white-space: nowrap; padding: 3px 2px; border: 1px solid #000;">นามสกุล</th>
                        <th colspan="18" style="width: 306px; text-align: center; padding: 3px 0; font-size: 14pt; border: 1px solid #000;">สัปดาห์ที่ ${claim.teachingDaysPerWeek > 1 ? `1-${claim.totalWeeks || Math.ceil(18 / claim.teachingDaysPerWeek)} (18 ครั้ง)` : '1-18'}</th>
                        <th rowspan="2" style="width: 96px; text-align: center; font-size: 14pt; white-space: nowrap; padding: 3px 2px; border: 1px solid #000;">ลายเซ็นต์นักศึกษา</th>
                    </tr>
                    <tr style="background-color: #f8fafc;">
                        ${weekHeaderCols}
                    </tr>
                </thead>
                <tbody>
                    ${studentRowsHtml}
                </tbody>
            </table>

            <!-- Page 2 Footer: Legend & Signatures -->
            <div style="display: flex; justify-content: space-between; align-items: flex-start; font-size: 14pt; margin-top: 44px;">
                
                <!-- Legend -->
                <div style="line-height: 1.5; padding-left: 8px;">
                    <table style="border: none; border-collapse: collapse; font-size: 14pt;">
                        <tr><td style="font-weight: bold; padding-right: 14px; border:none; vertical-align: top;">หมายเหตุ</td><td style="width:22px; border:none; text-align:center; font-weight:bold;">/</td><td style="border:none;">มาเรียน</td></tr>
                        <tr><td style="border:none;"></td><td style="border:none; text-align:center; font-weight:bold;">0</td><td style="border:none;">ขาดเรียน</td></tr>
                        <tr><td style="border:none;"></td><td style="border:none; text-align:center; font-weight:bold;">L</td><td style="border:none;">มาสาย</td></tr>
                        <tr><td style="border:none;"></td><td style="border:none; text-align:center; font-weight:bold;">S</td><td style="border:none;">ลาป่วย</td></tr>
                    </table>
                </div>

                <!-- Signatures -->
                <div style="text-align: center; line-height: 1.6; font-size: 14pt; padding-right: 20px;">
                    <div style="margin-bottom: 26px;">
                        ลงชื่อ........................................................<br>
                        ( ${sig.teacher || claim.teacherName || '........................................................'} )<br>
                        อาจารย์ผู้สอน
                    </div>
                    <div>
                        ลงชื่อ........................................................<br>
                        ( ${sig.programChair || sig.deptHead || 'นายปริวัฒน์ ยืนยิ่ง'} )<br>
                        ${sig.programChairRole || getFormattedDeptRole(claim.department || '', 'programChair')}
                    </div>
                </div>

            </div>

        </div>
    `;
}

function renderA4Page2() {
    const page2 = document.getElementById('doc-page-2');
    if (!page2 || !activeClaim) return;
    page2.innerHTML = generateA4Page2HTML(activeClaim);
}

// -------------------------------------------------------------------------
// CLAIM EVENT LISTENERS & BINDINGS
// -------------------------------------------------------------------------
let claimListenersInitialized = false;

function setupClaimEventListeners() {
    if (claimListenersInitialized) return;
    claimListenersInitialized = true;

    // Top Bar Back Button
    const btnBack = document.getElementById('btn-back-to-term');
    if (btnBack) {
        btnBack.addEventListener('click', () => {
            if (activeSubjectRef) {
                activeSubjectRef.claimData = JSON.parse(JSON.stringify(activeClaim));
                const totals = calculateClaimTotals();
                activeSubjectRef.hours = totals.grandTotalHrs;
                activeSubjectRef.studentCount = activeClaim.students ? activeClaim.students.length : (activeClaim.studentCount || 0);
                const term = appData.terms.find(t => t.id === currentTermId);
                if (term) {
                    const autoHours = calculateTermTotalHours(term);
                    term.totalTeachingHours = autoHours;
                    if (term.budget > 0 && autoHours > 0 && !activeClaim.rateCustomized) {
                        term.hourlyRate = Math.floor(term.budget / autoHours);
                    }
                }
                saveData();
            }
            switchView('subjects', currentTermId);
        });
    }

    // Save Claim Button
    const btnSave = document.getElementById('btn-save-claim');
    if (btnSave) {
        btnSave.addEventListener('click', () => {
            if (activeSubjectRef) {
                activeSubjectRef.claimData = JSON.parse(JSON.stringify(activeClaim));
                // Sync subject hours and rate back to card
                const totals = calculateClaimTotals();
                activeSubjectRef.hours = totals.grandTotalHrs;
                activeSubjectRef.rate = activeClaim.rate;
                activeSubjectRef.level = activeClaim.level || activeSubjectRef.level || 'ชั้นปี 1';
                activeSubjectRef.time = activeClaim.timeStr || activeSubjectRef.time || '17.00-20.00';
                activeSubjectRef.studentCount = activeClaim.students ? activeClaim.students.length : 0;
                const matchedTeacher = (appData.teachers || []).find(t => t.name === activeClaim.teacherName);
                if (matchedTeacher) {
                    activeSubjectRef.teacherId = matchedTeacher.id;
                }
                const term = appData.terms.find(t => t.id === currentTermId);
                if (term) {
                    const autoHours = calculateTermTotalHours(term);
                    term.totalTeachingHours = autoHours;
                    if (term.budget > 0 && autoHours > 0 && !activeClaim.rateCustomized) {
                        term.hourlyRate = Math.floor(term.budget / autoHours);
                    }
                }
                saveData();
                alert('✓ บันทึกข้อมูลใบเบิกและตาราง 18 สัปดาห์เรียบร้อยแล้ว');
            }
        });
    }

    // Reset RC Button
    const btnResetRC = document.getElementById('btn-reset-rc');
    if (btnResetRC) {
        btnResetRC.addEventListener('click', () => {
            if (confirm('ต้องการรีเซ็ตข้อมูลใบเบิกเป็น "ค่าเริ่มต้นวิชา RC" ตามแบบฟอร์มต้นฉบับหรือไม่?')) {
                activeClaim = JSON.parse(JSON.stringify(DEFAULT_RC_CLAIM));
                populateSidebarFromClaimData();
                renderWeeksEditor();
                renderStudentsEditor();
                renderA4Page1();
                renderA4Page2();
                alert('รีเซ็ตข้อมูลตามต้นฉบับวิชา RC เรียบร้อยแล้ว');
            }
        });
    }

    // Export JSON Button
    const btnExport = document.getElementById('btn-export-json');
    if (btnExport) {
        btnExport.addEventListener('click', () => {
            const dataStr = "data:text/json;charset=utf-8," + encodeURIComponent(JSON.stringify(activeClaim, null, 2));
            const downloadAnchor = document.createElement('a');
            downloadAnchor.setAttribute("href", dataStr);
            downloadAnchor.setAttribute("download", `ใบเบิก_${activeClaim.subjectCode}_${activeClaim.subjectName}.json`);
            document.body.appendChild(downloadAnchor);
            downloadAnchor.click();
            downloadAnchor.remove();
        });
    }

    // Print Button
    const btnPrint = document.getElementById('btn-print-claim');
    if (btnPrint) {
        btnPrint.addEventListener('click', () => {
            // Show both pages for printing
            const p1 = document.getElementById('doc-page-1');
            const p2 = document.getElementById('doc-page-2');
            if (p1) p1.classList.remove('hidden');
            if (p2) p2.classList.remove('hidden');
            window.print();
        });
    }

    // Page Switchers
    const btnP1 = document.getElementById('btn-page-1');
    const btnP2 = document.getElementById('btn-page-2');
    const btnPAll = document.getElementById('btn-page-all');
    const p1 = document.getElementById('doc-page-1');
    const p2 = document.getElementById('doc-page-2');

    function setActivePageBtn(activeBtn) {
        [btnP1, btnP2, btnPAll].forEach(b => {
            if (b) {
                b.classList.remove('active', 'bg-blue-600', 'text-white', 'font-medium');
                b.classList.add('bg-[#141725]', 'text-gray-300');
            }
        });
        if (activeBtn) {
            activeBtn.classList.add('active', 'bg-blue-600', 'text-white', 'font-medium');
            activeBtn.classList.remove('bg-[#141725]', 'text-gray-300');
        }
    }

    if (btnP1) {
        btnP1.addEventListener('click', () => {
            if (p1) p1.classList.remove('hidden');
            if (p2) p2.classList.add('hidden');
            setActivePageBtn(btnP1);
        });
    }

    if (btnP2) {
        btnP2.addEventListener('click', () => {
            if (p1) p1.classList.add('hidden');
            if (p2) p2.classList.remove('hidden');
            setActivePageBtn(btnP2);
        });
    }

    if (btnPAll) {
        btnPAll.addEventListener('click', () => {
            if (p1) p1.classList.remove('hidden');
            if (p2) p2.classList.remove('hidden');
            setActivePageBtn(btnPAll);
        });
    }

    // Init Thai calendar
    initThaiCalendarPopup();

    // Claim Settings Button
    const btnClaimSettings = document.getElementById('btn-claim-settings');
    if (btnClaimSettings) {
        btnClaimSettings.addEventListener('click', () => {
            selectedTeacherSettingsIds.clear();
            selectedSubjectSettingsIds.clear();
            selectedStudentSettingsIds.clear();
            renderSettingsLists();
            openModal('modal-settings');
        });
    }

    // Sidebar Tab Switching
    document.querySelectorAll('.claim-tab-btn').forEach(btn => {
        btn.addEventListener('click', () => {
            document.querySelectorAll('.claim-tab-btn').forEach(b => {
                b.classList.remove('active', 'text-blue-400', 'bg-blue-900/40', 'font-medium');
                b.classList.add('text-gray-400');
            });
            btn.classList.add('active', 'text-blue-400', 'bg-blue-900/40', 'font-medium');
            btn.classList.remove('text-gray-400');

            document.querySelectorAll('.claim-tab-content').forEach(c => c.classList.add('hidden'));
            const targetId = btn.getAttribute('data-target');
            const target = document.getElementById(targetId);
            if (target) target.classList.remove('hidden');
        });
    });

    // Reset Weeks Default button in Tab 2
    const btnResetWeeks = document.getElementById('btn-reset-weeks-default');
    if (btnResetWeeks) {
        btnResetWeeks.addEventListener('click', () => {
            recalculateClaimSchedule(false);
            renderWeeksEditor();
            updateCalculationsAndPreview();
        });
    }

    // Add Student Button in Tab 4 (Open multi-select modal)
    const btnAddStudent = document.getElementById('btn-add-student-to-subject');
    if (btnAddStudent) {
        btnAddStudent.addEventListener('click', () => {
            openSelectStudentsClaimModal();
        });
    }

    // Initialize Teacher Autocomplete in Tab 1
    initClaimTeacherAutocomplete();
    initUniversalClaimAutocompletes();

    // Live Sidebar Input Listeners (Tab 1: Subject info)
    const bindLiveInput = (id, property, updateCallback) => {
        const el = document.getElementById(id);
        if (el) {
            el.addEventListener('input', () => {
                activeClaim[property] = el.value;
                if (updateCallback) updateCallback();
                else updateCalculationsAndPreview();
            });
        }
    };

    bindLiveInput('claim-input-dept', 'department', () => {
        if (activeSubjectRef) activeSubjectRef.department = activeClaim.department;
        const deptName = activeClaim.department || 'เทคโนโลยีโยธา';
        const lblPC = document.getElementById('label-sig-program-chair');
        if (lblPC) lblPC.textContent = `2. ประธานหลักสูตรสาขาวิชา${deptName}`;
        const lblDH = document.getElementById('label-sig-dept-head');
        if (lblDH) lblDH.textContent = `4. หัวหน้าสาขาวิชา${deptName}`;

        const formattedRole = getFormattedDeptRole(deptName, 'deptHead');
        const formattedProgChairRole = getFormattedDeptRole(deptName, 'programChair');
        if (!activeClaim.signatures) activeClaim.signatures = {};
        activeClaim.signatures.deptHeadRole = formattedRole;
        activeClaim.signatures.programChairRole = formattedProgChairRole;
        if (activeSubjectRef) {
            if (!activeSubjectRef.signatures) activeSubjectRef.signatures = {};
            activeSubjectRef.signatures.deptHeadRole = formattedRole;
            activeSubjectRef.signatures.programChairRole = formattedProgChairRole;
        }
        const inpDHRole = document.getElementById('sig-dept-head-role');
        if (inpDHRole) inpDHRole.value = formattedRole;
        const inpPCRole = document.getElementById('sig-program-chair-role');
        if (inpPCRole) inpPCRole.value = formattedProgChairRole;

        renderA4Page1();
        renderA4Page2();
    });

    bindLiveInput('claim-input-level', 'level', () => {
        if (activeSubjectRef) activeSubjectRef.level = activeClaim.level;
        renderA4Page1();
        renderA4Page2();
    });

    bindLiveInput('claim-input-academic-year', 'academicYear', () => {
        renderA4Page1();
        renderA4Page2();
    });

    bindLiveInput('claim-input-code', 'subjectCode', () => {
        const hName = document.getElementById('claim-header-subject-name');
        if (hName) hName.textContent = `${activeClaim.subjectName} (${activeClaim.subjectCode})`;
        renderA4Page1();
        renderA4Page2();
    });

    bindLiveInput('claim-input-name', 'subjectName', () => {
        const hName = document.getElementById('claim-header-subject-name');
        if (hName) hName.textContent = `${activeClaim.subjectName} (${activeClaim.subjectCode})`;
        renderA4Page1();
        renderA4Page2();
    });

    bindLiveInput('claim-input-credits', 'credits', () => {
        const cr = parseInt(document.getElementById('claim-input-credits').value, 10) || 3;
        activeClaim.credits = cr;
        if (activeSubjectRef) {
            activeSubjectRef.credits = cr;
            if (activeSubjectRef.claimData) activeSubjectRef.claimData.credits = cr;
        }
        renderA4Page1();
        saveData();
    });

    const elThHrs = document.getElementById('claim-input-theory-hours');
    const elPrHrs = document.getElementById('claim-input-practice-hours');
    const elWkHrs = document.getElementById('claim-input-weekly-hours');

    function updateHoursFromInputs() {
        const th = parseInt(elThHrs ? elThHrs.value : 3) || 0;
        const pr = parseInt(elPrHrs ? elPrHrs.value : 0) || 0;
        const total = th + pr;
        activeClaim.theoryHours = th;
        activeClaim.practiceHours = pr;
        activeClaim.weeklyHours = total;
        if (elWkHrs) elWkHrs.value = total;
        if (activeClaim.teachingDaysPerWeek === 1 && activeClaim.teachingDays && activeClaim.teachingDays[0]) {
            activeClaim.teachingDays[0].hours = total;
            activeClaim.day1Hours = total;
            const day1HoursInp = document.querySelector('.input-day-hours');
            if (day1HoursInp) day1HoursInp.value = total;
            (activeClaim.weeks || []).forEach(w => {
                if (w.dayNo === 1 && !w.isHoliday) {
                    w.theoryHrs = th;
                    w.practiceHrs = pr;
                    w.totalHrs = total;
                }
            });
        }
        renderWeeksEditor();
        updateCalculationsAndPreview();
        renderA4Page1();
    }

    if (elThHrs) elThHrs.addEventListener('input', updateHoursFromInputs);
    if (elPrHrs) elPrHrs.addEventListener('input', updateHoursFromInputs);
    if (elWkHrs) {
        elWkHrs.addEventListener('input', () => {
            const val = parseInt(elWkHrs.value) || 0;
            activeClaim.weeklyHours = val;
            if (activeClaim.teachingDaysPerWeek === 1 && activeClaim.teachingDays && activeClaim.teachingDays[0]) {
                activeClaim.teachingDays[0].hours = val;
                activeClaim.day1Hours = val;
                const day1HoursInp = document.querySelector('.input-day-hours');
                if (day1HoursInp) day1HoursInp.value = val;
                (activeClaim.weeks || []).forEach(w => {
                    if (w.dayNo === 1 && !w.isHoliday) {
                        w.theoryHrs = val;
                        w.totalHrs = val;
                    }
                });
            }
            renderWeeksEditor();
            updateCalculationsAndPreview();
            renderA4Page1();
        });
    }

    // Flexible teaching days per week input
    const inputDaysMode = document.getElementById('claim-input-days-per-week');
    if (inputDaysMode) {
        inputDaysMode.addEventListener('input', () => {
            let val = parseInt(inputDaysMode.value);
            if (isNaN(val) || val < 1) val = 1;
            if (val > 7) val = 7;
            activeClaim.teachingDaysPerWeek = val;
            ensureTeachingDays();
            recalculateClaimSchedule(true);
            populateSidebarFromClaimData();
            renderWeeksEditor();
            updateCalculationsAndPreview();
        });
    }

    // Quick Day Preset buttons
    document.querySelectorAll('.btn-quick-day-preset').forEach(btn => {
        btn.addEventListener('click', () => {
            const days = parseInt(btn.getAttribute('data-days')) || 1;
            const inputDays = document.getElementById('claim-input-days-per-week');
            if (inputDays) inputDays.value = days;
            activeClaim.teachingDaysPerWeek = days;
            ensureTeachingDays();
            recalculateClaimSchedule(true);
            populateSidebarFromClaimData();
            renderWeeksEditor();
            updateCalculationsAndPreview();
        });
    });

    // Add / Remove teaching day buttons
    const btnAddDay = document.getElementById('btn-add-teaching-day');
    if (btnAddDay) {
        btnAddDay.addEventListener('click', () => {
            let cur = parseInt(activeClaim.teachingDaysPerWeek) || 1;
            if (cur < 7) {
                cur++;
                activeClaim.teachingDaysPerWeek = cur;
                const inputDays = document.getElementById('claim-input-days-per-week');
                if (inputDays) inputDays.value = cur;
                ensureTeachingDays();
                recalculateClaimSchedule(true);
                populateSidebarFromClaimData();
                renderWeeksEditor();
                updateCalculationsAndPreview();
            }
        });
    }

    const btnRemoveDay = document.getElementById('btn-remove-teaching-day');
    if (btnRemoveDay) {
        btnRemoveDay.addEventListener('click', () => {
            let cur = parseInt(activeClaim.teachingDaysPerWeek) || 1;
            if (cur > 1) {
                cur--;
                activeClaim.teachingDaysPerWeek = cur;
                const inputDays = document.getElementById('claim-input-days-per-week');
                if (inputDays) inputDays.value = cur;
                ensureTeachingDays();
                recalculateClaimSchedule(true);
                populateSidebarFromClaimData();
                renderWeeksEditor();
                updateCalculationsAndPreview();
            }
        });
    }

    // Summer table layout option for Page 1
    const selSummerLayout = document.getElementById('claim-summer-layout');
    if (selSummerLayout) {
        selSummerLayout.addEventListener('change', () => {
            activeClaim.summerTableLayout = selSummerLayout.value;
            renderA4Page1();
        });
    }

    const btnRecalc = document.getElementById('btn-recalculate-calendar');
    if (btnRecalc) {
        btnRecalc.addEventListener('click', () => {
            recalculateClaimSchedule(false);
            const inpStartTh = document.getElementById('claim-input-start-date-th');
            if (inpStartTh) inpStartTh.value = formatThaiBEDate(activeClaim.startDate);
            renderWeeksEditor();
            updateCalculationsAndPreview();
        });
    }

    const inputStartDate = document.getElementById('claim-input-start-date');
    if (inputStartDate) {
        inputStartDate.addEventListener('change', () => {
            handleStartDateChange(inputStartDate.value);
        });
    }

    bindLiveInput('claim-input-rate', 'rate', () => {
        const val = parseFloat(document.getElementById('claim-input-rate').value) || 0;
        activeClaim.rate = val;
        activeClaim.rateCustomized = true;
        if (activeSubjectRef) {
            activeSubjectRef.rate = val;
            if (activeSubjectRef.claimData) activeSubjectRef.claimData.rate = val;
            saveData();
        }
        updateCalculationsAndPreview();
    });

    bindLiveInput('claim-input-percent', 'percent', () => {
        activeClaim.percent = parseFloat(document.getElementById('claim-input-percent').value) || 0;
        renderA4Page1();
    });

    const inputStudents = document.getElementById('claim-input-students');
    if (inputStudents) {
        const handleStudentCountChange = () => {
            const rawVal = inputStudents.value.trim();
            if (rawVal === '') return;
            let count = parseInt(rawVal, 10);
            if (isNaN(count) || count < 0) count = 0;

            if (!activeClaim.students) activeClaim.students = [];

            while (activeClaim.students.length < count) {
                const idx = activeClaim.students.length + 1;
                activeClaim.students.push({
                    studentId: `6840121100${idx}`,
                    name: `นักศึกษาคนที่ ${idx}`,
                    surname: ''
                });
            }
            if (activeClaim.students.length > count) {
                activeClaim.students = activeClaim.students.slice(0, count);
            }

            activeClaim.studentCount = count;
            if (activeSubjectRef) {
                activeSubjectRef.studentCount = count;
                if (activeSubjectRef.claimData) {
                    activeSubjectRef.claimData.students = activeClaim.students;
                    activeSubjectRef.claimData.studentCount = count;
                }
            }

            const badge = document.getElementById('claim-student-count-badge');
            if (badge) badge.textContent = count;

            renderStudentsEditor();
            renderA4Page1();
            renderA4Page2();
            saveData();
        };

        inputStudents.addEventListener('input', handleStudentCountChange);
        inputStudents.addEventListener('change', () => {
            if (inputStudents.value.trim() === '') {
                inputStudents.value = activeClaim.students ? activeClaim.students.length : 0;
            } else {
                handleStudentCountChange();
            }
        });
    }

    const inputTotalHours = document.getElementById('claim-input-total-hours');
    if (inputTotalHours) {
        inputTotalHours.addEventListener('input', () => {
            const rawVal = inputTotalHours.value.trim();
            if (rawVal === '') {
                delete activeClaim.customTotalHours;
            } else {
                const parsed = parseFloat(rawVal);
                activeClaim.customTotalHours = isNaN(parsed) ? 0 : parsed;
            }
            if (activeSubjectRef) {
                if (activeSubjectRef.claimData) {
                    activeSubjectRef.claimData.customTotalHours = activeClaim.customTotalHours;
                }
            }
            updateCalculationsAndPreview();
        });
    }

    const btnSyncHours = document.getElementById('btn-sync-claim-hours');
    if (btnSyncHours) {
        btnSyncHours.addEventListener('click', () => {
            delete activeClaim.customTotalHours;
            if (activeSubjectRef && activeSubjectRef.claimData) {
                delete activeSubjectRef.claimData.customTotalHours;
            }
            const totals = calculateClaimTotals(activeClaim);
            if (inputTotalHours) inputTotalHours.value = totals.tableHours;
            updateCalculationsAndPreview();
        });
    }

    // Signatures Live Inputs (Tab 3)
    const bindSigInput = (id, propKey) => {
        const el = document.getElementById(id);
        if (el) {
            el.addEventListener('input', () => {
                if (!activeClaim.signatures) activeClaim.signatures = {};
                activeClaim.signatures[propKey] = el.value;
                if (propKey === 'teacher') {
                    activeClaim.teacherName = el.value;
                    const cTeacher = document.getElementById('claim-input-teacher');
                    if (cTeacher) cTeacher.value = el.value;
                } else {
                    updateDefaultSignatures2To9({ [propKey]: el.value });
                }
                saveActiveClaim();
                renderA4Page1();
                renderA4Page2();
            });
        }
    };

    bindSigInput('sig-teacher-name', 'teacher');
    bindSigInput('sig-program-chair', 'programChair');
    bindSigInput('sig-program-chair-role', 'programChairRole');
    bindSigInput('sig-curriculum-head', 'curriculumHead');
    bindSigInput('sig-dept-head', 'deptHead');
    bindSigInput('sig-dept-head-role', 'deptHeadRole');
    bindSigInput('sig-tech-head', 'techHead');
    bindSigInput('sig-academic-deputy', 'academicDeputy');
    bindSigInput('sig-finance-head', 'financeHead');
    bindSigInput('sig-resource-deputy', 'resourceDeputy');
    bindSigInput('sig-director', 'director');

    // Apply all signatures (except teacher) to all subjects in current term
    const btnApplyAllSigs = document.getElementById('btn-apply-all-signatures');
    if (btnApplyAllSigs) {
        btnApplyAllSigs.addEventListener('click', () => {
            const curTerm = appData.terms.find(t => t.id === currentTermId);
            if (!curTerm || !curTerm.subjects || curTerm.subjects.length === 0) {
                alert('ไม่พบรายวิชาในภาคเรียนนี้');
                return;
            }

            const sig = activeClaim.signatures || {};
            let count = 0;
            curTerm.subjects.forEach(sub => {
                if (!sub.claimData) {
                    sub.claimData = JSON.parse(JSON.stringify(DEFAULT_RC_CLAIM));
                }
                if (!sub.claimData.signatures) sub.claimData.signatures = {};

                // Copy positions 2 through 9 and their role titles
                sub.claimData.signatures.programChair = sig.programChair || '';
                sub.claimData.signatures.programChairRole = sig.programChairRole || '';
                sub.claimData.signatures.curriculumHead = sig.curriculumHead || '';
                sub.claimData.signatures.curriculumHeadRole = sig.curriculumHeadRole || '';
                sub.claimData.signatures.deptHead = sig.deptHead || '';
                sub.claimData.signatures.deptHeadRole = sig.deptHeadRole || '';
                sub.claimData.signatures.techHead = sig.techHead || '';
                sub.claimData.signatures.techHeadRole = sig.techHeadRole || '';
                sub.claimData.signatures.academicDeputy = sig.academicDeputy || '';
                sub.claimData.signatures.academicDeputyRole = sig.academicDeputyRole || '';
                sub.claimData.signatures.financeHead = sig.financeHead || '';
                sub.claimData.signatures.financeHeadRole = sig.financeHeadRole || '';
                sub.claimData.signatures.resourceDeputy = sig.resourceDeputy || '';
                sub.claimData.signatures.resourceDeputyRole = sig.resourceDeputyRole || '';
                sub.claimData.signatures.director = sig.director || '';
                sub.claimData.signatures.directorRole = sig.directorRole || '';

                // Ensure teacher name is preserved from each subject's own teacher
                const masterTeacher = appData.teachers.find(t => t.id === sub.teacherId)?.name;
                sub.claimData.signatures.teacher = sub.claimData.teacherName || masterTeacher || sub.claimData.signatures.teacher || '';
                count++;
            });

            updateDefaultSignatures2To9(sig);
            saveData();
            alert(`นำชุดรายชื่อผู้ลงนาม (ข้อ 2-9) ไปใช้กับทั้ง ${count} รายวิชาในภาคเรียนนี้เรียบร้อยแล้ว\n(ระบบบันทึกจดจำไว้เป็นค่าเริ่มต้นของเทอมต่อๆ ไปด้วยโดยอัตโนมัติ)`);
        });
    }

    // Apply single signature field to all subjects in current term
    document.querySelectorAll('.btn-apply-single-sig').forEach(btn => {
        btn.addEventListener('click', () => {
            const field = btn.getAttribute('data-field');
            const inputId = btn.getAttribute('data-input-id');
            if (!field) return;
            const curTerm = appData.terms.find(t => t.id === currentTermId);
            if (!curTerm || !curTerm.subjects || curTerm.subjects.length === 0) {
                alert('ไม่พบรายวิชาในภาคเรียนนี้');
                return;
            }

            const currentVal = (activeClaim.signatures && activeClaim.signatures[field]) ? activeClaim.signatures[field] : (document.getElementById(inputId)?.value || '');
            let count = 0;
            curTerm.subjects.forEach(sub => {
                if (!sub.claimData) {
                    sub.claimData = JSON.parse(JSON.stringify(DEFAULT_RC_CLAIM));
                }
                if (!sub.claimData.signatures) sub.claimData.signatures = {};
                sub.claimData.signatures[field] = currentVal;

                // Ensure teacher name is preserved from each subject's own teacher
                const masterTeacher = appData.teachers.find(t => t.id === sub.teacherId)?.name;
                sub.claimData.signatures.teacher = sub.claimData.teacherName || masterTeacher || sub.claimData.signatures.teacher || '';
                count++;
            });

            if (field === 'deptHead') {
                const roleVal = document.getElementById('sig-dept-head-role')?.value || activeClaim.signatures?.deptHeadRole;
                if (roleVal) {
                    curTerm.subjects.forEach(sub => {
                        if (sub.claimData && sub.claimData.signatures) {
                            sub.claimData.signatures.deptHeadRole = roleVal;
                        }
                    });
                    updateDefaultSignatures2To9({ deptHeadRole: roleVal });
                }
            }
            if (field === 'programChair') {
                const roleVal = document.getElementById('sig-program-chair-role')?.value || activeClaim.signatures?.programChairRole;
                if (roleVal) {
                    curTerm.subjects.forEach(sub => {
                        if (sub.claimData && sub.claimData.signatures) {
                            sub.claimData.signatures.programChairRole = roleVal;
                        }
                    });
                    updateDefaultSignatures2To9({ programChairRole: roleVal });
                }
            }

            updateDefaultSignatures2To9({ [field]: currentVal });
            saveData();
            alert(`นำชื่อนี้ไปใช้กับตำแหน่งเดียวกันในทั้ง ${count} รายวิชาของภาคเรียนนี้เรียบร้อยแล้ว\n(พร้อมบันทึกจดจำไว้เป็นค่าเริ่มต้นของเทอมต่อๆ ไปด้วย)`);
        });
    });
}

// -------------------------------------------------------------------------
// UNIVERSAL AUTOCOMPLETE ENGINE (ระบบค้นหาและแนะนำตัวเลือกอัตโนมัติป้องกันพิมพ์ผิด)
// -------------------------------------------------------------------------

function escapeHtml(str) {
    if (str === undefined || str === null) return '';
    return String(str)
        .replace(/&/g, '&amp;')
        .replace(/</g, '&lt;')
        .replace(/>/g, '&gt;')
        .replace(/"/g, '&quot;')
        .replace(/'/g, '&#039;');
}

function highlightMatch(text, query) {
    if (!query || !text) return escapeHtml(text || '');
    const cleanQ = query.trim();
    if (!cleanQ) return escapeHtml(text);
    const escaped = cleanQ.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
    try {
        const regex = new RegExp(`(${escaped})`, 'gi');
        return escapeHtml(text).replace(regex, '<span class="text-blue-400 font-bold bg-blue-500/20 px-0.5 rounded">$1</span>');
    } catch (e) {
        return escapeHtml(text);
    }
}

function filterAndSortSuggestions(list, query, getFields) {
    const q = (query || '').toLowerCase().trim();
    if (!q) {
        return list.slice(0, 30);
    }
    const matched = [];
    for (const item of list) {
        const { primary, secondary } = getFields(item);
        const pLower = (primary || '').toLowerCase();
        const sLower = (secondary || '').toLowerCase();
        if (pLower.startsWith(q)) {
            matched.push({ item, score: 0 });
        } else if (sLower.startsWith(q)) {
            matched.push({ item, score: 1 });
        } else if (pLower.includes(q)) {
            matched.push({ item, score: 2 });
        } else if (sLower.includes(q)) {
            matched.push({ item, score: 3 });
        }
    }
    matched.sort((a, b) => a.score - b.score);
    return matched.map(m => m.item);
}

function createAutocompleteDropdown(inputEl, options) {
    if (!inputEl) return;
    
    // Prevent duplicate binding
    if (inputEl._acInitialized) return;
    inputEl._acInitialized = true;

    inputEl.setAttribute('autocomplete', 'off');

    // Ensure parent element has relative positioning
    const parent = inputEl.parentElement;
    if (parent && window.getComputedStyle(parent).position === 'static') {
        parent.style.position = 'relative';
    }

    // Create dropdown element
    const dropdown = document.createElement('div');
    dropdown.className = 'autocomplete-popup hidden absolute left-0 right-0 top-full mt-1 bg-[#141725] border border-blue-500/50 rounded-xl max-h-56 overflow-y-auto z-[9999] shadow-2xl p-1 text-xs space-y-0.5';
    parent.appendChild(dropdown);

    let activeIndex = -1;
    let currentItems = [];

    function positionDropdown() {
        const rect = inputEl.getBoundingClientRect();
        const spaceBelow = window.innerHeight - rect.bottom;
        const spaceAbove = rect.top;
        if (spaceBelow < 200 && spaceAbove > spaceBelow) {
            dropdown.style.top = 'auto';
            dropdown.style.bottom = '100%';
            dropdown.style.marginTop = '0px';
            dropdown.style.marginBottom = '4px';
        } else {
            dropdown.style.top = '100%';
            dropdown.style.bottom = 'auto';
            dropdown.style.marginTop = '4px';
            dropdown.style.marginBottom = '0px';
        }
    }

    function renderDropdown(query = '') {
        const items = options.getItems(query) || [];
        currentItems = items;
        activeIndex = -1;

        dropdown.innerHTML = '';
        if (items.length === 0) {
            if (query.trim()) {
                dropdown.innerHTML = `<div class="p-2.5 text-center text-[11px] text-gray-500">ไม่พบ "${escapeHtml(query)}" ในคลัง (พิมพ์ระบุเองได้)</div>`;
                positionDropdown();
                dropdown.classList.remove('hidden');
            } else {
                dropdown.classList.add('hidden');
            }
            return;
        }

        const maxDisplay = 30;
        const displayItems = items.slice(0, maxDisplay);

        displayItems.forEach((item, index) => {
            const itemDiv = document.createElement('div');
            itemDiv.className = 'ac-item p-2 hover:bg-blue-600/25 hover:text-white rounded-lg cursor-pointer transition text-xs flex justify-between items-center group text-left border-b border-[#2d3748]/40 last:border-0';
            itemDiv.setAttribute('data-index', index);

            itemDiv.innerHTML = `
                <div class="overflow-hidden pr-2 flex-1">
                    <div class="font-medium text-white group-hover:text-blue-200 truncate">${highlightMatch(item.title, query)}</div>
                    ${item.subtitle ? `<div class="text-[11px] text-gray-400 group-hover:text-gray-300 truncate mt-0.5">${highlightMatch(item.subtitle, query)}</div>` : ''}
                </div>
                <span class="text-[10px] bg-blue-500/20 text-blue-300 border border-blue-500/30 px-1.5 py-0.5 rounded whitespace-nowrap opacity-80 group-hover:opacity-100 flex-shrink-0">เลือก</span>
            `;

            itemDiv.addEventListener('mousedown', (e) => {
                e.preventDefault();
                selectItem(item);
            });

            dropdown.appendChild(itemDiv);
        });

        if (items.length > maxDisplay) {
            const moreHint = document.createElement('div');
            moreHint.className = 'p-1.5 text-center text-[10px] text-gray-500 border-t border-[#2d3748]/50 mt-1';
            moreHint.textContent = `พบทั้งหมด ${items.length} รายการ (พิมพ์ตัวอักษรเพื่อค้นหา)`;
            dropdown.appendChild(moreHint);
        }

        positionDropdown();
        dropdown.classList.remove('hidden');
    }

    function highlightActive() {
        const itemEls = dropdown.querySelectorAll('.ac-item');
        itemEls.forEach((el, i) => {
            if (i === activeIndex) {
                el.classList.add('bg-blue-600/35', 'text-white');
                el.scrollIntoView({ block: 'nearest' });
            } else {
                el.classList.remove('bg-blue-600/35', 'text-white');
            }
        });
    }

    function selectItem(item) {
        dropdown.classList.add('hidden');
        if (options.onSelect) {
            options.onSelect(item, inputEl);
        } else {
            inputEl.value = item.value || item.title;
            inputEl.dispatchEvent(new Event('input', { bubbles: true }));
        }
    }

    inputEl.addEventListener('input', () => {
        renderDropdown(inputEl.value);
    });

    inputEl.addEventListener('focus', () => {
        renderDropdown(inputEl.value);
    });

    inputEl.addEventListener('keydown', (e) => {
        if (dropdown.classList.contains('hidden')) {
            if (e.key === 'ArrowDown') {
                renderDropdown(inputEl.value);
                e.preventDefault();
            }
            return;
        }

        const count = Math.min(currentItems.length, 30);
        if (e.key === 'ArrowDown') {
            e.preventDefault();
            if (count > 0) {
                activeIndex = (activeIndex + 1) % count;
                highlightActive();
            }
        } else if (e.key === 'ArrowUp') {
            e.preventDefault();
            if (count > 0) {
                activeIndex = (activeIndex - 1 + count) % count;
                highlightActive();
            }
        } else if (e.key === 'Enter') {
            if (activeIndex >= 0 && activeIndex < currentItems.length) {
                e.preventDefault();
                selectItem(currentItems[activeIndex]);
            }
        } else if (e.key === 'Escape') {
            dropdown.classList.add('hidden');
        }
    });

    document.addEventListener('click', (e) => {
        if (!inputEl.contains(e.target) && !dropdown.contains(e.target)) {
            dropdown.classList.add('hidden');
        }
    });
}

function attachTeacherAutocomplete(inputEl, onSelectCallback) {
    if (!inputEl) return;
    createAutocompleteDropdown(inputEl, {
        getItems: (query) => {
            const sorted = filterAndSortSuggestions(appData.teachers || [], query, t => ({
                primary: t.name,
                secondary: ''
            }));
            return sorted.map(t => ({
                title: t.name,
                subtitle: 'บุคลากร วท.อุบลราชธานี',
                value: t.name,
                raw: t
            }));
        },
        onSelect: (item, el) => {
            el.value = item.value;
            el.dispatchEvent(new Event('input', { bubbles: true }));
            if (onSelectCallback) onSelectCallback(item.value, item.raw, el);
        }
    });
}

function initUniversalClaimAutocompletes() {
    // 1. Subject Name Autocomplete in Tab 1
    const nameInput = document.getElementById('claim-input-name');
    if (nameInput) {
        createAutocompleteDropdown(nameInput, {
            getItems: (query) => {
                const sorted = filterAndSortSuggestions(appData.subjects_master || [], query, s => ({
                    primary: s.name,
                    secondary: s.code
                }));
                return sorted.map(s => ({
                    title: s.name,
                    subtitle: `รหัส ${s.code} • ${s.credits || 3} นก. • ${s.hours || 3} ชม.`,
                    value: s.name,
                    raw: s
                }));
            },
            onSelect: (item, el) => {
                const s = item.raw;
                el.value = s.name;
                activeClaim.subjectName = s.name;
                const elCode = document.getElementById('claim-input-code');
                if (elCode && s.code) {
                    elCode.value = s.code;
                    activeClaim.subjectCode = s.code;
                }
                const elCredits = document.getElementById('claim-input-credits');
                if (elCredits && s.credits) {
                    elCredits.value = s.credits;
                    activeClaim.credits = s.credits;
                }
                const thHrs = s.theoryHours !== undefined ? s.theoryHours : 3;
                const prHrs = s.practiceHours !== undefined ? s.practiceHours : 0;
                const weeklyHrs = s.hours || (thHrs + prHrs);
                const elTh = document.getElementById('claim-input-theory-hours');
                if (elTh) elTh.value = thHrs;
                const elPr = document.getElementById('claim-input-practice-hours');
                if (elPr) elPr.value = prHrs;
                const inpHours = document.getElementById('claim-input-weekly-hours');
                if (inpHours) inpHours.value = weeklyHrs;
                activeClaim.theoryHours = thHrs;
                activeClaim.practiceHours = prHrs;
                activeClaim.weeklyHours = weeklyHrs;

                if (activeClaim.teachingDaysPerWeek === 1 && activeClaim.teachingDays && activeClaim.teachingDays[0]) {
                    activeClaim.teachingDays[0].hours = weeklyHrs;
                    activeClaim.day1Hours = weeklyHrs;
                    const day1HoursInp = document.querySelector('.input-day-hours');
                    if (day1HoursInp) day1HoursInp.value = weeklyHrs;
                    (activeClaim.weeks || []).forEach(w => {
                        if (w.dayNo === 1 && !w.isHoliday) {
                            w.theoryHrs = thHrs;
                            w.practiceHrs = prHrs;
                            w.totalHrs = weeklyHrs;
                        }
                    });
                }
                const headerName = document.getElementById('claim-header-subject-name');
                if (headerName) headerName.textContent = `${s.name} (${s.code || ''})`;
                if (activeSubjectRef) {
                    activeSubjectRef.name = s.name;
                    if (s.code) activeSubjectRef.code = s.code;
                    if (s.credits) activeSubjectRef.credits = s.credits;
                    saveData();
                }
                updateCalculationsAndPreview();
                renderWeeksEditor();
                renderA4Page1();
                renderA4Page2();
            }
        });
    }

    // 2. Subject Code Autocomplete in Tab 1
    const codeInput = document.getElementById('claim-input-code');
    if (codeInput) {
        createAutocompleteDropdown(codeInput, {
            getItems: (query) => {
                const sorted = filterAndSortSuggestions(appData.subjects_master || [], query, s => ({
                    primary: s.code,
                    secondary: s.name
                }));
                return sorted.map(s => ({
                    title: s.code,
                    subtitle: `${s.name} (${s.credits || 3} นก.)`,
                    value: s.code,
                    raw: s
                }));
            },
            onSelect: (item, el) => {
                const s = item.raw;
                el.value = s.code;
                activeClaim.subjectCode = s.code;
                const elName = document.getElementById('claim-input-name');
                if (elName && s.name) {
                    elName.value = s.name;
                    activeClaim.subjectName = s.name;
                }
                const elCredits = document.getElementById('claim-input-credits');
                if (elCredits && s.credits) {
                    elCredits.value = s.credits;
                    activeClaim.credits = s.credits;
                }
                const thHrs = s.theoryHours !== undefined ? s.theoryHours : 3;
                const prHrs = s.practiceHours !== undefined ? s.practiceHours : 0;
                const weeklyHrs = s.hours || (thHrs + prHrs);
                const elTh = document.getElementById('claim-input-theory-hours');
                if (elTh) elTh.value = thHrs;
                const elPr = document.getElementById('claim-input-practice-hours');
                if (elPr) elPr.value = prHrs;
                const inpHours = document.getElementById('claim-input-weekly-hours');
                if (inpHours) inpHours.value = weeklyHrs;
                activeClaim.theoryHours = thHrs;
                activeClaim.practiceHours = prHrs;
                activeClaim.weeklyHours = weeklyHrs;

                if (activeClaim.teachingDaysPerWeek === 1 && activeClaim.teachingDays && activeClaim.teachingDays[0]) {
                    activeClaim.teachingDays[0].hours = weeklyHrs;
                    activeClaim.day1Hours = weeklyHrs;
                    const day1HoursInp = document.querySelector('.input-day-hours');
                    if (day1HoursInp) day1HoursInp.value = weeklyHrs;
                    (activeClaim.weeks || []).forEach(w => {
                        if (w.dayNo === 1 && !w.isHoliday) {
                            w.theoryHrs = thHrs;
                            w.practiceHrs = prHrs;
                            w.totalHrs = weeklyHrs;
                        }
                    });
                }
                const headerName = document.getElementById('claim-header-subject-name');
                if (headerName) headerName.textContent = `${s.name || ''} (${s.code})`;
                if (activeSubjectRef) {
                    if (s.name) activeSubjectRef.name = s.name;
                    activeSubjectRef.code = s.code;
                    if (s.credits) activeSubjectRef.credits = s.credits;
                    saveData();
                }
                updateCalculationsAndPreview();
                renderWeeksEditor();
                renderA4Page1();
                renderA4Page2();
            }
        });
    }

    // 3. Tab 3 Signatures Autocomplete (9 Positions)
    const sigMap = [
        { id: 'sig-teacher-name', prop: 'teacher' },
        { id: 'sig-program-chair', prop: 'programChair' },
        { id: 'sig-curriculum-head', prop: 'curriculumHead' },
        { id: 'sig-dept-head', prop: 'deptHead' },
        { id: 'sig-tech-head', prop: 'techHead' },
        { id: 'sig-academic-deputy', prop: 'academicDeputy' },
        { id: 'sig-finance-head', prop: 'financeHead' },
        { id: 'sig-resource-deputy', prop: 'resourceDeputy' },
        { id: 'sig-director', prop: 'director' }
    ];

    sigMap.forEach(({ id, prop }) => {
        const el = document.getElementById(id);
        if (el) {
            attachTeacherAutocomplete(el, (name) => {
                if (!activeClaim.signatures) activeClaim.signatures = {};
                activeClaim.signatures[prop] = name;
                if (prop === 'teacher') {
                    activeClaim.teacherName = name;
                    const cTeacher = document.getElementById('claim-input-teacher');
                    if (cTeacher) cTeacher.value = name;
                } else {
                    updateDefaultSignatures2To9({ [prop]: name });
                }
                saveActiveClaim();
                renderA4Page1();
                renderA4Page2();
            });
        }
    });
}

// Autocomplete for Teacher input in Tab 1 (Claim form)
function initClaimTeacherAutocomplete() {
    const inputTeacher = document.getElementById('claim-input-teacher');
    const dropTeacher = document.getElementById('dropdown-claim-teacher-list');
    const btnClearTeacher = document.getElementById('btn-clear-claim-teacher');

    if (!inputTeacher || !dropTeacher) return;

    function renderTeacherDropdown(query = '') {
        const q = query.toLowerCase().trim();
        const matches = (appData.teachers || []).filter(t => {
            if (!q) return true;
            return t.name.toLowerCase().includes(q);
        });

        dropTeacher.innerHTML = '';
        if (matches.length === 0) {
            dropTeacher.innerHTML = '<div class="p-2.5 text-center text-xs text-gray-500">ไม่พบอาจารย์ที่ค้นหา (พิมพ์ชื่อเองได้)</div>';
        } else {
            const displayList = q ? matches.slice(0, 50) : matches.slice(0, 30);
            displayList.forEach(t => {
                const item = document.createElement('div');
                item.className = 'p-2 hover:bg-blue-600/20 hover:text-blue-200 rounded-lg cursor-pointer transition text-xs flex justify-between items-center border-b border-[#2d3748]/40 last:border-0';
                item.innerHTML = `
                    <div class="font-medium text-white">${t.name}</div>
                    <span class="text-[10px] bg-blue-500/20 text-blue-300 px-1.5 py-0.5 rounded ml-2">เลือก</span>
                `;
                item.addEventListener('click', (e) => {
                    e.stopPropagation();
                    selectTeacher(t.name);
                });
                dropTeacher.appendChild(item);
            });
            if (!q && matches.length > 30) {
                const hint = document.createElement('div');
                hint.className = 'p-1.5 text-center text-[10px] text-gray-500';
                hint.textContent = `พิมพ์ชื่อเพื่อค้นหาจากทั้งหมด ${matches.length} ท่าน`;
                dropTeacher.appendChild(hint);
            }
        }
        dropTeacher.classList.remove('hidden');
    }

    function selectTeacher(name) {
        inputTeacher.value = name;
        activeClaim.teacherName = name;
        if (!activeClaim.signatures) activeClaim.signatures = {};
        activeClaim.signatures.teacher = name;
        const sigTeacher = document.getElementById('sig-teacher-name');
        if (sigTeacher) sigTeacher.value = name;
        if (btnClearTeacher) btnClearTeacher.classList.remove('hidden');
        dropTeacher.classList.add('hidden');
        renderA4Page1();
        renderA4Page2();
    }

    inputTeacher.addEventListener('focus', () => renderTeacherDropdown(inputTeacher.value));
    inputTeacher.addEventListener('input', () => {
        const val = inputTeacher.value;
        activeClaim.teacherName = val;
        if (!activeClaim.signatures) activeClaim.signatures = {};
        activeClaim.signatures.teacher = val;
        const sigTeacher = document.getElementById('sig-teacher-name');
        if (sigTeacher) sigTeacher.value = val;
        if (val && btnClearTeacher) btnClearTeacher.classList.remove('hidden');
        else if (btnClearTeacher) btnClearTeacher.classList.add('hidden');
        renderTeacherDropdown(val);
        renderA4Page1();
        renderA4Page2();
    });

    if (btnClearTeacher) {
        btnClearTeacher.addEventListener('click', (e) => {
            e.stopPropagation();
            inputTeacher.value = '';
            activeClaim.teacherName = '';
            if (!activeClaim.signatures) activeClaim.signatures = {};
            activeClaim.signatures.teacher = '';
            const sigTeacher = document.getElementById('sig-teacher-name');
            if (sigTeacher) sigTeacher.value = '';
            btnClearTeacher.classList.add('hidden');
            dropTeacher.classList.add('hidden');
            renderA4Page1();
            renderA4Page2();
        });
    }

    document.addEventListener('click', (e) => {
        if (!e.target.closest('#claim-input-teacher') && !e.target.closest('#dropdown-claim-teacher-list')) {
            dropTeacher.classList.add('hidden');
        }
    });
}

// -------------------------------------------------------------------------
// THAI BUDDHIST CALENDAR POPUP & DATE PICKER
// -------------------------------------------------------------------------
let calCurrentYearBE = 2568;
let calCurrentMonth = 5; // 0-indexed (5 = June)
let thaiCalendarInitialized = false;

function initThaiCalendarPopup() {
    if (thaiCalendarInitialized) return;
    thaiCalendarInitialized = true;

    const inputTH = document.getElementById('claim-input-start-date-th');
    const inputISO = document.getElementById('claim-input-start-date');
    const btnOpen = document.getElementById('btn-open-thai-calendar');
    const popup = document.getElementById('thai-calendar-popup');
    const monthSelect = document.getElementById('cal-month-select');
    const yearSelect = document.getElementById('cal-year-select');
    const btnPrev = document.getElementById('cal-prev-month');
    const btnNext = document.getElementById('cal-next-month');
    const daysGrid = document.getElementById('cal-days-grid');
    const btnToday = document.getElementById('cal-btn-today');
    const holidayDetail = document.getElementById('cal-holiday-detail');

    if (!inputTH || !popup) return;

    // Populate Month Select
    monthSelect.innerHTML = THAI_MONTHS_FULL.map((m, idx) => `<option value="${idx}">${m}</option>`).join('');

    // Populate Year Select (BE 2565 to 2575)
    let yearOptions = '';
    for (let y = 2565; y <= 2575; y++) {
        yearOptions += `<option value="${y}">${y}</option>`;
    }
    yearSelect.innerHTML = yearOptions;

    function renderCalendarGrid() {
        daysGrid.innerHTML = '';
        const yearCE = calCurrentYearBE - 543;
        const firstDay = new Date(yearCE, calCurrentMonth, 1).getDay(); // 0 = Sun
        const daysInMonth = new Date(yearCE, calCurrentMonth + 1, 0).getDate();

        monthSelect.value = calCurrentMonth;
        yearSelect.value = calCurrentYearBE;
        if (holidayDetail) holidayDetail.textContent = '';

        const currentIso = inputISO ? inputISO.value : '';
        const now = new Date();
        const todayIso = `${now.getFullYear()}-${String(now.getMonth()+1).padStart(2,'0')}-${String(now.getDate()).padStart(2,'0')}`;

        // Empty padding cells before 1st of month
        for (let i = 0; i < firstDay; i++) {
            const blank = document.createElement('div');
            blank.className = 'h-8';
            daysGrid.appendChild(blank);
        }

        // Days of month
        for (let day = 1; day <= daysInMonth; day++) {
            const dateCE = new Date(yearCE, calCurrentMonth, day);
            const dateIso = `${yearCE}-${String(calCurrentMonth + 1).padStart(2, '0')}-${String(day).padStart(2, '0')}`;
            const holiday = getThaiHoliday(dateCE);
            const isSelected = dateIso === currentIso;
            const isToday = dateIso === todayIso;

            const btn = document.createElement('button');
            btn.type = 'button';
            btn.className = `cal-day-btn text-xs ${isSelected ? 'selected' : ''} ${isToday ? 'today' : ''} ${holiday ? 'holiday' : ''}`;
            btn.textContent = day;

            if (holiday) {
                btn.title = holiday.name;
                btn.addEventListener('mouseenter', () => {
                    if (holidayDetail) holidayDetail.textContent = `📌 ${holiday.name}`;
                });
                btn.addEventListener('mouseleave', () => {
                    if (holidayDetail) holidayDetail.textContent = '';
                });
            }

            btn.addEventListener('click', () => {
                if (inputISO) inputISO.value = dateIso;
                inputTH.value = formatThaiBEDate(dateIso);
                handleStartDateChange(dateIso);
                popup.classList.add('hidden');
            });

            daysGrid.appendChild(btn);
        }
    }

    function openCalendar() {
        const curIso = (inputISO && inputISO.value) ? inputISO.value : (activeClaim ? activeClaim.startDate : "2025-06-02");
        const d = new Date(curIso);
        if (!isNaN(d.getTime())) {
            calCurrentMonth = d.getMonth();
            calCurrentYearBE = d.getFullYear() + 543;
        }
        renderCalendarGrid();
        popup.classList.remove('hidden');
    }

    if (btnOpen) {
        btnOpen.addEventListener('click', (e) => {
            e.stopPropagation();
            if (popup.classList.contains('hidden')) {
                openCalendar();
            } else {
                popup.classList.add('hidden');
            }
        });
    }

    monthSelect.addEventListener('change', () => {
        calCurrentMonth = parseInt(monthSelect.value);
        renderCalendarGrid();
    });

    yearSelect.addEventListener('change', () => {
        calCurrentYearBE = parseInt(yearSelect.value);
        renderCalendarGrid();
    });

    btnPrev.addEventListener('click', (e) => {
        e.stopPropagation();
        calCurrentMonth--;
        if (calCurrentMonth < 0) {
            calCurrentMonth = 11;
            calCurrentYearBE--;
        }
        renderCalendarGrid();
    });

    btnNext.addEventListener('click', (e) => {
        e.stopPropagation();
        calCurrentMonth++;
        if (calCurrentMonth > 11) {
            calCurrentMonth = 0;
            calCurrentYearBE++;
        }
        renderCalendarGrid();
    });

    if (btnToday) {
        btnToday.addEventListener('click', (e) => {
            e.stopPropagation();
            const now = new Date();
            const todayIso = `${now.getFullYear()}-${String(now.getMonth()+1).padStart(2,'0')}-${String(now.getDate()).padStart(2,'0')}`;
            if (inputISO) inputISO.value = todayIso;
            inputTH.value = formatThaiBEDate(todayIso);
            calCurrentMonth = now.getMonth();
            calCurrentYearBE = now.getFullYear() + 543;
            handleStartDateChange(todayIso);
            popup.classList.add('hidden');
        });
    }

    // Close calendar when clicking outside
    document.addEventListener('click', (e) => {
        if (!popup.contains(e.target) && e.target !== btnOpen && e.target !== inputTH) {
            popup.classList.add('hidden');
        }
    });

    // Auto-masking and typing for inputTH (เช่น 29/05/2569)
    inputTH.addEventListener('input', (e) => {
        let val = inputTH.value.replace(/[^\d/]/g, '');
        if (e.inputType !== 'deleteContentBackward') {
            if (val.length === 2 && !val.includes('/')) {
                val = val + '/';
            } else if (val.length === 5 && val.split('/').length === 2) {
                val = val + '/';
            }
        }
        inputTH.value = val;

        if (val.length === 10) {
            const iso = parseThaiBEToISO(val);
            if (iso) {
                if (inputISO) inputISO.value = iso;
                handleStartDateChange(iso);
            }
        }
    });

    inputTH.addEventListener('change', () => {
        const iso = parseThaiBEToISO(inputTH.value);
        if (iso) {
            if (inputISO) inputISO.value = iso;
            inputTH.value = formatThaiBEDate(iso);
            handleStartDateChange(iso);
        } else {
            if (activeClaim && activeClaim.startDate) {
                inputTH.value = formatThaiBEDate(activeClaim.startDate);
            }
        }
    });
}

// -------------------------------------------------------------------------
// PERMANENT DARK MODE ENFORCER
// -------------------------------------------------------------------------
function initPermanentDarkMode() {
    localStorage.removeItem('teachingFeeTheme');
    document.body.classList.remove('light-theme');
}

// -------------------------------------------------------------------------
// DATA IMPORT SYSTEM (EXCEL / PDF / IMAGES)
// -------------------------------------------------------------------------
let importCurrentCategory = 'student'; // 'teacher' | 'subject' | 'student'
let importExtractedItems = []; // Array of parsed candidate objects
let importTargetContext = 'settings'; // 'settings' | 'claim'

function initDataImportSystem() {
    // Configure PDF.js worker if available
    if (typeof pdfjsLib !== 'undefined' && !pdfjsLib.GlobalWorkerOptions.workerSrc) {
        pdfjsLib.GlobalWorkerOptions.workerSrc = 'https://cdnjs.cloudflare.com/ajax/libs/pdf.js/3.11.174/pdf.worker.min.js';
    }

    const dropzone = document.getElementById('import-dropzone');
    const fileInput = document.getElementById('import-file-input');
    const categoryRadios = document.querySelectorAll('input[name="import-category"]');
    const btnConfirmImport = document.getElementById('btn-confirm-import-data');
    const chkSelectAll = document.getElementById('import-select-all');

    if (!dropzone || !fileInput) return;

    // Trigger buttons from Settings tabs
    document.querySelectorAll('.btn-import-trigger').forEach(btn => {
        btn.addEventListener('click', () => {
            const cat = btn.getAttribute('data-category') || 'student';
            importTargetContext = 'settings';
            openDataImportModal(cat);
        });
    });

    // Universal import button in Settings footer
    const btnUniversal = document.getElementById('btn-open-universal-import');
    if (btnUniversal) {
        btnUniversal.addEventListener('click', () => {
            importTargetContext = 'settings';
            openDataImportModal('student');
        });
    }

    // Quick import button from Claim Tab 4 (Students)
    const btnImportClaimStudents = document.getElementById('btn-import-students-claim');
    if (btnImportClaimStudents) {
        btnImportClaimStudents.addEventListener('click', () => {
            importTargetContext = 'claim';
            openDataImportModal('student');
        });
    }

    // Category Radio Changes
    categoryRadios.forEach(radio => {
        radio.addEventListener('change', () => {
            if (radio.checked) {
                setImportCategory(radio.value);
                // If file already loaded, re-parse with new category
                if (window._lastUploadedFile) {
                    processUploadedFile(window._lastUploadedFile);
                }
            }
        });
    });

    // Dropzone Click & Drag Events
    dropzone.addEventListener('click', () => fileInput.click());

    ['dragenter', 'dragover'].forEach(eventName => {
        dropzone.addEventListener(eventName, (e) => {
            e.preventDefault();
            e.stopPropagation();
            dropzone.classList.add('border-purple-400', 'bg-[#141725]');
        });
    });

    ['dragleave', 'drop'].forEach(eventName => {
        dropzone.addEventListener(eventName, (e) => {
            e.preventDefault();
            e.stopPropagation();
            dropzone.classList.remove('border-purple-400', 'bg-[#141725]');
        });
    });

    dropzone.addEventListener('drop', (e) => {
        const dt = e.dataTransfer;
        const files = dt.files;
        if (files && files.length > 0) {
            handleFileSelection(files[0]);
        }
    });

    fileInput.addEventListener('change', (e) => {
        if (fileInput.files && fileInput.files.length > 0) {
            handleFileSelection(fileInput.files[0]);
        }
    });

    // Select All Checkbox
    if (chkSelectAll) {
        chkSelectAll.addEventListener('change', () => {
            const checked = chkSelectAll.checked;
            document.querySelectorAll('.chk-import-row').forEach(cb => {
                cb.checked = checked;
            });
            updateImportSelectionCount();
        });
    }

    // Confirm Import Action
    if (btnConfirmImport) {
        btnConfirmImport.addEventListener('click', handleExecuteImport);
    }
}

function openDataImportModal(category = 'student') {
    setImportCategory(category);
    resetImportModalState();
    openModal('modal-import-data');
}

function setImportCategory(category) {
    importCurrentCategory = category;

    // Sync radio inputs & card styles
    document.querySelectorAll('input[name="import-category"]').forEach(r => {
        r.checked = (r.value === category);
        const card = r.closest('.import-type-card');
        if (card) {
            if (r.checked) {
                card.classList.add('border-purple-500', 'bg-purple-950/30');
                card.classList.remove('border-[#2d3748]', 'bg-[#0f121d]');
            } else {
                card.classList.remove('border-purple-500', 'bg-purple-950/30');
                card.classList.add('border-[#2d3748]', 'bg-[#0f121d]');
            }
        }
    });

    // Update Preview Table Column Headers
    const th1 = document.getElementById('th-col-1');
    const th2 = document.getElementById('th-col-2');
    const th3 = document.getElementById('th-col-3');

    if (category === 'teacher') {
        if (th1) th1.textContent = 'คำนำหน้า / รหัส';
        if (th2) th2.textContent = 'ชื่อ - นามสกุลอาจารย์';
        if (th3) th3.textContent = 'ตำแหน่ง / หมายเหตุ';
    } else if (category === 'subject') {
        if (th1) th1.textContent = 'รหัสวิชา';
        if (th2) th2.textContent = 'ชื่อรายวิชา';
        if (th3) th3.textContent = 'หน่วยกิต (ท-ป-ศ)';
    } else {
        // student
        if (th1) th1.textContent = 'รหัสนักศึกษา';
        if (th2) th2.textContent = 'ชื่อ - นามสกุล';
        if (th3) th3.textContent = 'ระดับชั้น / หมายเหตุ';
    }
}

function resetImportModalState() {
    window._lastUploadedFile = null;
    importExtractedItems = [];

    const fileInput = document.getElementById('import-file-input');
    if (fileInput) fileInput.value = '';

    const fileInfo = document.getElementById('import-file-info');
    if (fileInfo) fileInfo.classList.add('hidden');

    const statusBar = document.getElementById('import-status-bar');
    if (statusBar) statusBar.classList.add('hidden');

    const previewSection = document.getElementById('import-preview-section');
    if (previewSection) previewSection.classList.add('hidden');

    const btnConfirm = document.getElementById('btn-confirm-import-data');
    if (btnConfirm) {
        btnConfirm.disabled = true;
        document.getElementById('label-confirm-import').textContent = 'ยืนยันนำเข้าข้อมูล (0 รายการ)';
    }
}

function handleFileSelection(file) {
    if (!file) return;
    window._lastUploadedFile = file;

    // Display File Info
    const fileInfo = document.getElementById('import-file-info');
    const fileName = document.getElementById('import-file-name');
    const fileSize = document.getElementById('import-file-size');

    if (fileInfo && fileName && fileSize) {
        fileName.textContent = file.name;
        const sizeKb = (file.size / 1024).toFixed(1);
        fileSize.textContent = `(${sizeKb > 1024 ? (sizeKb / 1024).toFixed(2) + ' MB' : sizeKb + ' KB'})`;
        fileInfo.classList.remove('hidden');
    }

    processUploadedFile(file);
}

function setImportStatus(message, isSpinning = true) {
    const statusBar = document.getElementById('import-status-bar');
    const statusText = document.getElementById('import-status-text');
    if (statusBar && statusText) {
        statusBar.classList.remove('hidden');
        statusText.textContent = message;
        const icon = statusBar.querySelector('i');
        if (icon) {
            icon.className = isSpinning ? 'fa-solid fa-circle-notch fa-spin text-blue-400' : 'fa-solid fa-circle-check text-green-400';
        }
    }
}

async function processUploadedFile(file) {
    const ext = file.name.split('.').pop().toLowerCase();
    setImportStatus(`กำลังอ่านข้อมูลจากไฟล์ ${file.name}...`, true);

    try {
        if (['xlsx', 'xls', 'csv'].includes(ext)) {
            await parseExcelOrCsvFile(file);
        } else if (ext === 'pdf') {
            await parsePdfFile(file);
        } else if (['png', 'jpg', 'jpeg', 'webp', 'bmp'].includes(ext)) {
            await parseImageFileWithOcr(file);
        } else {
            alert('รองรับเฉพาะไฟล์ Excel (.xlsx, .xls, .csv), เอกสาร PDF (.pdf) และรูปภาพ (.png, .jpg)');
            setImportStatus('ประเภทไฟล์ไม่ถูกต้อง', false);
        }
    } catch (err) {
        console.error('File parsing error:', err);
        setImportStatus(`เกิดข้อผิดพลาดในการอ่านไฟล์: ${err.message}`, false);
        alert(`เกิดข้อผิดพลาดในการประมวลผลไฟล์: ${err.message}`);
    }
}

// 1. EXCEL / CSV PARSER (SheetJS)
function parseExcelOrCsvFile(file) {
    return new Promise((resolve, reject) => {
        if (typeof XLSX === 'undefined') {
            reject(new Error('SheetJS library ไม่พร้อมใช้งาน'));
            return;
        }

        const reader = new FileReader();
        reader.onload = (e) => {
            try {
                const data = new Uint8Array(e.target.result);
                const workbook = XLSX.read(data, { type: 'array' });
                
                // Aggregate 2D row arrays from all sheets
                let allRows = [];
                workbook.SheetNames.forEach(sheetName => {
                    const sheet = workbook.Sheets[sheetName];
                    const rows = XLSX.utils.sheet_to_json(sheet, { header: 1, defval: '' });
                    allRows = allRows.concat(rows);
                });

                importExtractedItems = extractItemsFromRows(allRows, importCurrentCategory);
                renderImportPreview();
                setImportStatus(`ดึงข้อมูลสำเร็จ พบ ${importExtractedItems.length} รายการ`, false);
                resolve();
            } catch (err) {
                reject(err);
            }
        };
        reader.onerror = reject;
        reader.readAsArrayBuffer(file);
    });
}

// 2. PDF PARSER (PDF.js)
async function parsePdfFile(file) {
    if (typeof pdfjsLib === 'undefined') {
        throw new Error('PDF.js library ไม่พร้อมใช้งาน');
    }

    const arrayBuffer = await file.arrayBuffer();
    const loadingTask = pdfjsLib.getDocument({ data: arrayBuffer });
    const pdfDoc = await loadingTask.promise;

    let textLines = [];

    for (let pageNum = 1; pageNum <= pdfDoc.numPages; pageNum++) {
        setImportStatus(`กำลังอ่านเอกสาร PDF หน้า ${pageNum}/${pdfDoc.numPages}...`, true);
        const page = await pdfDoc.getPage(pageNum);
        const textContent = await page.getTextContent();
        
        // Group items by line based on vertical Y coordinate
        const linesMap = {};
        textContent.items.forEach(item => {
            const y = Math.round(item.transform[5]); // Y position
            if (!linesMap[y]) linesMap[y] = [];
            linesMap[y].push({ x: item.transform[4], text: item.str });
        });

        // Sort lines top to bottom (Y descending in PDF space)
        const sortedY = Object.keys(linesMap).map(Number).sort((a, b) => b - a);
        sortedY.forEach(y => {
            const lineItems = linesMap[y].sort((a, b) => a.x - b.x);
            const lineStr = lineItems.map(i => i.text.trim()).filter(Boolean).join(' ');
            if (lineStr) textLines.push(lineStr);
        });
    }

    importExtractedItems = extractItemsFromLines(textLines, importCurrentCategory);
    renderImportPreview();
    setImportStatus(`ดึงข้อมูลจาก PDF สำเร็จ พบ ${importExtractedItems.length} รายการ`, false);
}

// 3. IMAGE PARSER (Tesseract.js OCR)
async function parseImageFileWithOcr(file) {
    if (typeof Tesseract === 'undefined') {
        throw new Error('Tesseract OCR library ไม่พร้อมใช้งาน');
    }

    setImportStatus('กำลังสแกนรูปภาพด้วยระบบ OCR (ภาษาไทย/อังกฤษ)...', true);

    const result = await Tesseract.recognize(file, 'tha+eng', {
        logger: m => {
            if (m.status === 'recognizing text') {
                const pct = Math.round((m.progress || 0) * 100);
                setImportStatus(`กำลังวิเคราะห์ข้อความในภาพ (${pct}%)...`, true);
            }
        }
    });

    const text = result.data.text || '';
    const textLines = text.split('\n').map(l => l.trim()).filter(Boolean);

    importExtractedItems = extractItemsFromLines(textLines, importCurrentCategory);
    renderImportPreview();
    setImportStatus(`ดึงข้อมูลจากรูปภาพสำเร็จ พบ ${importExtractedItems.length} รายการ`, false);
}

// -------------------------------------------------------------------------
// INTELLIGENT PATTERN EXTRACTORS
// -------------------------------------------------------------------------

// Thai Title Prefixes
const THAI_NAME_PREFIXES = ['นาย', 'นางสาว', 'นาง', 'น.ส.', 'ว่าที่ ร.ต.', 'ว่าที่ร้อยตรี', 'ด.ช.', 'ด.ญ.', 'อ.', 'อาจารย์', 'ดร.', 'ผศ.', 'รศ.', 'ศ.'];

function splitThaiName(raw) {
    let clean = (raw || '').trim();
    if (!clean) return { prefix: '', name: '', surname: '', fullName: '' };

    let detectedPrefix = '';
    for (const p of THAI_NAME_PREFIXES) {
        if (clean.startsWith(p)) {
            detectedPrefix = p;
            clean = clean.substring(p.length).trim();
            break;
        }
    }

    const tokens = clean.split(/\s+/).filter(Boolean);
    if (tokens.length >= 2) {
        const name = (detectedPrefix ? detectedPrefix : '') + tokens[0];
        const surname = tokens.slice(1).join(' ');
        return { prefix: detectedPrefix, name, surname, fullName: `${name} ${surname}`.trim() };
    } else if (tokens.length === 1) {
        const name = (detectedPrefix ? detectedPrefix : '') + tokens[0];
        return { prefix: detectedPrefix, name, surname: '', fullName: name };
    }
    return { prefix: '', name: clean, surname: '', fullName: clean };
}

// Extract items from 2D Excel row arrays
function extractItemsFromRows(rows, category) {
    const results = [];
    const seenKeys = new Set();

    rows.forEach(row => {
        if (!Array.isArray(row) || row.length === 0) return;
        const rowStrings = row.map(cell => String(cell || '').trim()).filter(Boolean);
        if (rowStrings.length === 0) return;
        const rowJoined = rowStrings.join(' ');

        if (category === 'student') {
            // Find 10-13 digit student ID (starts with 6x usually e.g. 68401211001)
            let studentId = '';
            let namePart = '';

            for (let i = 0; i < row.length; i++) {
                const cellStr = String(row[i] || '').trim();
                const mId = cellStr.match(/\b(6\d{9,12}|\d{10,12})\b/);
                if (mId && !studentId) {
                    studentId = mId[1];
                } else if (cellStr && !cellStr.match(/^\d+$/) && cellStr.length >= 4) {
                    // Potential name cell
                    if (!namePart && !['ชื่อ', 'นามสกุล', 'รหัส', 'ลำดับ', 'สถานะ'].some(h => cellStr.includes(h))) {
                        namePart = cellStr;
                        // Check if next column has surname
                        if (i + 1 < row.length) {
                            const nextCell = String(row[i + 1] || '').trim();
                            if (nextCell && !nextCell.match(/^\d+$/) && nextCell.length >= 2) {
                                namePart += ' ' + nextCell;
                            }
                        }
                    }
                }
            }

            if (studentId || (namePart && THAI_NAME_PREFIXES.some(p => namePart.includes(p)))) {
                const parsed = splitThaiName(namePart);
                const uniqueKey = studentId || parsed.fullName;
                if (uniqueKey && !seenKeys.has(uniqueKey)) {
                    seenKeys.add(uniqueKey);
                    results.push({
                        col1: studentId || '-',
                        col2: parsed.fullName || '-',
                        col3: 'นักศึกษา ป.ตรี',
                        rawStudentId: studentId,
                        rawName: parsed.name,
                        rawSurname: parsed.surname,
                        rawFullName: parsed.fullName
                    });
                }
            }

        } else if (category === 'teacher') {
            // Search for teacher name
            for (let i = 0; i < row.length; i++) {
                const cellStr = String(row[i] || '').trim();
                if (cellStr.length >= 5 && THAI_NAME_PREFIXES.some(p => cellStr.startsWith(p) || cellStr.includes(' ' + p))) {
                    const parsed = splitThaiName(cellStr);
                    if (parsed.fullName && !seenKeys.has(parsed.fullName)) {
                        seenKeys.add(parsed.fullName);
                        results.push({
                            col1: parsed.prefix || 'อ.',
                            col2: parsed.fullName,
                            col3: 'อาจารย์/ผู้สอน',
                            rawName: parsed.fullName
                        });
                    }
                }
            }

        } else if (category === 'subject') {
            // Search for subject code e.g. 27-40121-2201 or 01-401-201
            let code = '';
            let name = '';
            let credits = 3;
            let hours = 3;

            for (let i = 0; i < row.length; i++) {
                const cellStr = String(row[i] || '').trim();
                const mCode = cellStr.match(/(\d{2}-\d{4,5}-\d{4}|\b\d{4}-\d{4}\b|\b\d{7,9}\b)/);
                if (mCode && !code) {
                    code = mCode[1];
                } else if (!name && cellStr.length > 3 && !cellStr.match(/^\d+$/) && !['รหัส', 'วิชา', 'หน่วยกิต', 'ทฤษฎี', 'ปฏิบัติ'].some(h => cellStr === h)) {
                    name = cellStr;
                }
            }

            // Detect credits & hours in row
            const mCredits = rowJoined.match(/(\d)\s*\((\d+)-(\d+)-(\d+)\)/) || rowJoined.match(/(\d)\s*หน่วยกิต/);
            if (mCredits) {
                credits = parseInt(mCredits[1]) || 3;
                if (mCredits[2] && mCredits[3]) {
                    hours = (parseInt(mCredits[2]) || 0) + (parseInt(mCredits[3]) || 0);
                }
            }

            if (code && name) {
                if (!seenKeys.has(code)) {
                    seenKeys.add(code);
                    results.push({
                        col1: code,
                        col2: name,
                        col3: `${credits} นก. (${hours} ชม.)`,
                        rawCode: code,
                        rawName: name,
                        rawCredits: credits,
                        rawHours: hours
                    });
                }
            }
        }
    });

    return results;
}

// Extract items from raw text lines (from PDF, OCR image, or clipboard)
function extractItemsFromLines(lines, category) {
    const results = [];
    const seenKeys = new Set();

    lines.forEach(line => {
        const clean = (line || '').trim();
        if (!clean || clean.length < 3) return;

        if (category === 'student') {
            // Match student ID: 10-13 digits
            const mId = clean.match(/\b(6\d{9,12}|\d{10,12})\b/);
            // Match name with prefix or Thai words
            const mName = clean.match(/(?:นาย|นางสาว|นาง|น\.ส\.|ว่าที่\s*ร\.ต\.|ด\.ช\.|ด\.ญ\.)\s*([ก-๙]+)\s+([ก-๙]+)/);

            if (mId || mName) {
                const studentId = mId ? mId[1] : '';
                let fullName = '';
                let name = '';
                let surname = '';

                if (mName) {
                    fullName = mName[0].trim();
                    const parsed = splitThaiName(fullName);
                    name = parsed.name;
                    surname = parsed.surname;
                } else {
                    // Remove student ID from line and look for Thai text
                    const rem = clean.replace(studentId, '').replace(/^[0-9.\s-]+/, '').trim();
                    const parsed = splitThaiName(rem);
                    name = parsed.name;
                    surname = parsed.surname;
                    fullName = parsed.fullName;
                }

                const uniqueKey = studentId || fullName;
                if (uniqueKey && !seenKeys.has(uniqueKey)) {
                    seenKeys.add(uniqueKey);
                    results.push({
                        col1: studentId || '-',
                        col2: fullName || '-',
                        col3: 'นักศึกษา ป.ตรี',
                        rawStudentId: studentId,
                        rawName: name,
                        rawSurname: surname,
                        rawFullName: fullName
                    });
                }
            }

        } else if (category === 'teacher') {
            // Find lines with Thai title prefixes
            const mTeacher = clean.match(/(?:นาย|นางสาว|นาง|น\.ส\.|ว่าที่\s*ร\.ต\.|ผศ\.|รศ\.|ศ\.|ดร\.|อ\.|อาจารย์)\s*([ก-๙]+)\s+([ก-๙]+)/);
            if (mTeacher) {
                const fullName = mTeacher[0].trim();
                const parsed = splitThaiName(fullName);
                if (parsed.fullName && !seenKeys.has(parsed.fullName)) {
                    seenKeys.add(parsed.fullName);
                    results.push({
                        col1: parsed.prefix || 'อ.',
                        col2: parsed.fullName,
                        col3: 'อาจารย์/ผู้สอน',
                        rawName: parsed.fullName
                    });
                }
            }

        } else if (category === 'subject') {
            // Find subject code pattern e.g. 27-40121-2201
            const mCode = clean.match(/(\d{2}-\d{4,5}-\d{4}|\b\d{4}-\d{4}\b|\b\d{7,9}\b)/);
            if (mCode) {
                const code = mCode[1];
                let rem = clean.replace(code, '').replace(/^[0-9.\s-]+/, '').trim();
                
                // Check credits pattern e.g. 3(2-2-5) or 3-2-4
                let credits = 3;
                let hours = 3;
                const mCred = rem.match(/(\d)\s*\(([0-9]+)-([0-9]+)-[0-9]+\)/) || rem.match(/(\d)\s*หน่วยกิต/);
                if (mCred) {
                    credits = parseInt(mCred[1]) || 3;
                    if (mCred[2] && mCred[3]) {
                        hours = (parseInt(mCred[2]) || 0) + (parseInt(mCred[3]) || 0);
                    }
                    rem = rem.replace(mCred[0], '').trim();
                }

                // Strip leading/trailing brackets
                const name = rem.replace(/^[\[\(]/, '').replace(/[\]\)]$/, '').trim();

                if (code && name && !seenKeys.has(code)) {
                    seenKeys.add(code);
                    results.push({
                        col1: code,
                        col2: name,
                        col3: `${credits} นก. (${hours} ชม.)`,
                        rawCode: code,
                        rawName: name,
                        rawCredits: credits,
                        rawHours: hours
                    });
                }
            }
        }
    });

    return results;
}

// -------------------------------------------------------------------------
// PREVIEW TABLE & SELECTION LOGIC
// -------------------------------------------------------------------------
function renderImportPreview() {
    const section = document.getElementById('import-preview-section');
    const tbody = document.getElementById('import-preview-tbody');
    const badge = document.getElementById('import-detected-badge');
    const btnConfirm = document.getElementById('btn-confirm-import-data');
    const chkSelectAll = document.getElementById('import-select-all');

    if (!section || !tbody) return;

    section.classList.remove('hidden');
    tbody.innerHTML = '';

    if (chkSelectAll) chkSelectAll.checked = true;

    if (importExtractedItems.length === 0) {
        tbody.innerHTML = `
            <tr>
                <td colspan="5" class="p-6 text-center text-xs text-gray-400">
                    <i class="fa-solid fa-triangle-exclamation text-amber-400 text-lg mb-2 block"></i>
                    ไม่พบข้อมูลที่ตรงกับประเภท "<strong>${getCategoryLabel(importCurrentCategory)}</strong>" ในไฟล์นี้<br>
                    <span class="text-[11px] text-gray-500">ลองเปลี่ยนประเภทข้อมูลด้านบน หรือตรวจสอบรูปแบบไฟล์</span>
                </td>
            </tr>
        `;
        if (badge) badge.textContent = 'พบ 0 รายการ';
        if (btnConfirm) {
            btnConfirm.disabled = true;
            document.getElementById('label-confirm-import').textContent = 'ยืนยันนำเข้าข้อมูล (0 รายการ)';
        }
        return;
    }

    importExtractedItems.forEach((item, idx) => {
        const tr = document.createElement('tr');
        tr.className = 'hover:bg-[#1c2134] transition border-b border-[#2d3748]/60 last:border-0';
        tr.innerHTML = `
            <td class="p-2 text-center">
                <input type="checkbox" class="chk-import-row accent-purple-600 rounded" data-index="${idx}" checked>
            </td>
            <td class="p-2 text-center text-gray-500 font-mono">${idx + 1}</td>
            <td class="p-2 font-mono text-purple-300 font-medium">${item.col1}</td>
            <td class="p-2 text-white font-medium">${item.col2}</td>
            <td class="p-2 text-center text-gray-400">${item.col3}</td>
        `;
        tbody.appendChild(tr);
    });

    // Row Checkbox Listeners
    tbody.querySelectorAll('.chk-import-row').forEach(cb => {
        cb.addEventListener('change', updateImportSelectionCount);
    });

    updateImportSelectionCount();
}

function updateImportSelectionCount() {
    const checkedRows = document.querySelectorAll('.chk-import-row:checked');
    const totalCount = importExtractedItems.length;
    const checkedCount = checkedRows.length;

    const badge = document.getElementById('import-detected-badge');
    const btnConfirm = document.getElementById('btn-confirm-import-data');
    const labelConfirm = document.getElementById('label-confirm-import');
    const chkSelectAll = document.getElementById('import-select-all');

    if (badge) badge.textContent = `พบ ${totalCount} รายการ (เลือก ${checkedCount})`;
    if (labelConfirm) labelConfirm.textContent = `ยืนยันนำเข้าข้อมูล (${checkedCount} รายการ)`;
    if (btnConfirm) btnConfirm.disabled = (checkedCount === 0);

    if (chkSelectAll) {
        chkSelectAll.checked = (checkedCount === totalCount && totalCount > 0);
    }
}

function getCategoryLabel(cat) {
    if (cat === 'teacher') return 'อาจารย์ผู้สอน';
    if (cat === 'subject') return 'รายวิชา';
    return 'นักศึกษา';
}

// -------------------------------------------------------------------------
// IMPORT EXECUTION (APPEND OR REPLACE)
// -------------------------------------------------------------------------
function handleExecuteImport() {
    const checkedBoxes = document.querySelectorAll('.chk-import-row:checked');
    if (checkedBoxes.length === 0) return;

    const selectedIndices = Array.from(checkedBoxes).map(cb => parseInt(cb.getAttribute('data-index')));
    const selectedItems = selectedIndices.map(i => importExtractedItems[i]);

    const importMode = document.querySelector('input[name="import-mode"]:checked')?.value || 'append';

    let addedCount = 0;

    if (importCurrentCategory === 'student') {
        if (importMode === 'replace') {
            appData.students = [];
        }

        const existingIds = new Set((appData.students || []).map(s => s.studentId ? s.studentId.trim() : ''));
        const existingNames = new Set((appData.students || []).map(s => s.name ? s.name.trim() : ''));

        selectedItems.forEach(item => {
            const sid = item.rawStudentId || '';
            const fullName = item.rawFullName || `${item.rawName || ''} ${item.rawSurname || ''}`.trim();

            const isDuplicate = (sid && existingIds.has(sid)) || (!sid && existingNames.has(fullName));
            if (!isDuplicate || importMode === 'replace') {
                appData.students.push({
                    id: generateId(),
                    studentId: sid,
                    name: fullName
                });
                if (sid) existingIds.add(sid);
                if (fullName) existingNames.add(fullName);
                addedCount++;
            }
        });

        // If invoked from Claim Tab 4 (Students editor), sync to activeClaim.students as well
        if (activeClaim && (importTargetContext === 'claim' || currentView === 'claim-form')) {
            if (importMode === 'replace') {
                activeClaim.students = [];
            }
            if (!activeClaim.students) activeClaim.students = [];

            const claimExistingIds = new Set(activeClaim.students.map(s => s.studentId ? s.studentId.trim() : ''));
            selectedItems.forEach(item => {
                const sid = item.rawStudentId || '';
                const name = item.rawName || '';
                const surname = item.rawSurname || '';
                if (!sid || !claimExistingIds.has(sid) || importMode === 'replace') {
                    activeClaim.students.push({
                        studentId: sid,
                        name: name,
                        surname: surname
                    });
                    if (sid) claimExistingIds.add(sid);
                }
            });

            // Update Claim UI
            const inpStCount = document.getElementById('claim-input-students');
            if (inpStCount) inpStCount.value = activeClaim.students.length;
            renderStudentsEditor();
            renderA4Page1();
            renderA4Page2();
        }

    } else if (importCurrentCategory === 'teacher') {
        if (importMode === 'replace') {
            appData.teachers = [];
        }

        const existingTeacherNames = new Set((appData.teachers || []).map(t => t.name.trim()));

        selectedItems.forEach(item => {
            const tName = item.rawName || item.col2;
            if (tName && (!existingTeacherNames.has(tName) || importMode === 'replace')) {
                appData.teachers.push({
                    id: generateId(),
                    name: tName
                });
                existingTeacherNames.add(tName);
                addedCount++;
            }
        });

    } else if (importCurrentCategory === 'subject') {
        if (importMode === 'replace') {
            appData.subjects_master = [];
        }

        const existingCodes = new Set((appData.subjects_master || []).map(s => s.code.trim()));

        selectedItems.forEach(item => {
            const code = item.rawCode || item.col1;
            const name = item.rawName || item.col2;
            const credits = item.rawCredits || 3;
            const hours = item.rawHours || 3;

            if (code && (!existingCodes.has(code) || importMode === 'replace')) {
                appData.subjects_master.push({
                    id: generateId(),
                    code: code,
                    name: name,
                    credits: credits,
                    hours: hours
                });
                existingCodes.add(code);
                addedCount++;
            }
        });
    }

    // Save and Refresh UI
    saveData();
    renderSettingsLists();
    updateGlobalStats();
    updateTabCounts();

    closeModal('modal-import-data');

    alert(`✓ นำเข้าข้อมูล ${getCategoryLabel(importCurrentCategory)} เรียบร้อยแล้ว จำนวน ${addedCount} รายการ`);
}

// -------------------------------------------------------------------------
// GRAND SUMMARY CLAIM (ใบเบิกรวม ตราครุฑ - แบบบันทึกข้อความ)
// -------------------------------------------------------------------------
let currentSummaryTermId = null;
let summaryClaimSelectedSubIds = new Set();

function initSummaryClaimSystem() {
    const btnOpenInTerm = document.getElementById('btn-open-summary-claim');
    if (btnOpenInTerm) {
        btnOpenInTerm.addEventListener('click', () => {
            if (currentTermId) openSummaryClaimModal(currentTermId);
        });
    }

    const btnPrint = document.getElementById('btn-print-summary-claim');
    if (btnPrint) {
        btnPrint.addEventListener('click', printSummaryClaim);
    }

    const btnSelectAll = document.getElementById('btn-summary-select-all');
    if (btnSelectAll) {
        btnSelectAll.addEventListener('click', () => {
            const term = appData.terms.find(t => t.id === currentSummaryTermId);
            if (!term) return;
            term.subjects.forEach(s => summaryClaimSelectedSubIds.add(s.id));
            saveSummaryClaimState();
            renderSummaryClaimSubjectSelector();
            renderSummaryClaimA4();
        });
    }

    const btnDeselectAll = document.getElementById('btn-summary-deselect-all');
    if (btnDeselectAll) {
        btnDeselectAll.addEventListener('click', () => {
            summaryClaimSelectedSubIds.clear();
            saveSummaryClaimState();
            renderSummaryClaimSubjectSelector();
            renderSummaryClaimA4();
        });
    }

    // Input listeners for memo fields
    const memoInputIds = [
        'summary-input-dept',
        'summary-input-doc-no',
        'summary-input-doc-date',
        'summary-input-subject-title',
        'summary-input-recipient',
        'summary-input-requester',
        'summary-input-role',
        'summary-input-dept-name',
        'summary-input-level',
        'summary-input-term-year',
        'summary-input-start-date',
        'summary-input-end-date',
        'summary-input-percent',
        'summary-sig-requester',
        'summary-sig-dept-head',
        'summary-sig-verifier',
        'summary-sig-verifier-role',
        'summary-sig-academic-deputy',
        'summary-sig-resource-deputy',
        'summary-sig-director'
    ];

    memoInputIds.forEach(id => {
        const el = document.getElementById(id);
        if (el) {
            el.addEventListener('input', () => {
                if (id === 'summary-input-requester') {
                    const sigReq = document.getElementById('summary-sig-requester');
                    if (sigReq) sigReq.value = el.value;
                }
                saveSummaryClaimState();
                renderSummaryClaimA4();
            });
        }
    });

    // Attach Autocomplete for personnel in Summary Claim
    const summaryPersonIds = [
        'summary-input-requester',
        'summary-sig-requester',
        'summary-sig-dept-head',
        'summary-sig-verifier',
        'summary-sig-academic-deputy',
        'summary-sig-resource-deputy',
        'summary-sig-director'
    ];
    summaryPersonIds.forEach(id => {
        const el = document.getElementById(id);
        if (el) {
            attachTeacherAutocomplete(el, (name) => {
                if (id === 'summary-input-requester') {
                    const sigReq = document.getElementById('summary-sig-requester');
                    if (sigReq) sigReq.value = name;
                }
                saveSummaryClaimState();
                renderSummaryClaimA4();
            });
        }
    });
}

function getSubjectClaimSummary(sub) {
    const masterSub = (appData.subjects_master || []).find(s => s.id === sub.subjectId) || { code: sub.code || '', name: sub.name || '' };
    const teacher = (appData.teachers || []).find(t => t.id === sub.teacherId) || {};
    
    let subjectCode = masterSub.code || sub.code || '';
    let subjectName = masterSub.name || sub.name || '';
    let teacherName = teacher.name || '';
    let credits = sub.credits || masterSub.credits || 3;
    let students = sub.studentCount || 6;
    const term = appData.terms.find(t => t.id === currentTermId);
    let rate = sub.rate || (term && term.hourlyRate) || 42;
    let hours = sub.hours || 45;

    if (sub.claimData) {
        if (sub.claimData.subjectCode) subjectCode = sub.claimData.subjectCode;
        if (sub.claimData.subjectName) subjectName = sub.claimData.subjectName;
        if (sub.claimData.teacherName) teacherName = sub.claimData.teacherName;
        if (sub.claimData.credits) credits = parseInt(sub.claimData.credits) || credits;
        if (sub.claimData.rate) rate = parseFloat(sub.claimData.rate) || rate;
        if (sub.claimData.students && sub.claimData.students.length > 0) {
            students = sub.claimData.students.length;
        }
        if (sub.claimData.weeks && Array.isArray(sub.claimData.weeks)) {
            let sumHrs = 0;
            sub.claimData.weeks.forEach(w => {
                if (!w.isHoliday) sumHrs += (parseInt(w.totalHrs) || 0);
            });
            if (sumHrs > 0) hours = sumHrs;
        }
    }

    const totalMoney = hours * rate;

    return {
        id: sub.id,
        code: subjectCode,
        name: subjectName,
        teacherName: teacherName || 'นายณัฐวรรธน์ เกษกุล',
        credits: credits,
        students: students,
        hours: hours,
        rate: rate,
        totalMoney: totalMoney,
        claimData: sub.claimData
    };
}

function openSummaryClaimModal(termId) {
    const term = appData.terms.find(t => t.id === termId);
    if (!term) return;

    currentSummaryTermId = termId;

    // Load or initialize summary claim data in term
    if (!term.summaryClaimData) {
        term.summaryClaimData = {};
    }
    const state = term.summaryClaimData;

    // Badge
    const termBadge = document.getElementById('summary-term-badge');
    if (termBadge) termBadge.textContent = `ภาคเรียนที่ ${term.no}/${term.year}`;

    // Select all subjects by default if not set
    if (!state.selectedSubjectIds || !Array.isArray(state.selectedSubjectIds) || state.selectedSubjectIds.length === 0) {
        summaryClaimSelectedSubIds = new Set(term.subjects.map(s => s.id));
    } else {
        summaryClaimSelectedSubIds = new Set(state.selectedSubjectIds);
    }

    // Calculate live effective dates from subjects
    const effectiveDates = getTermEffectiveDateRange(term, summaryClaimSelectedSubIds.size > 0 ? Array.from(summaryClaimSelectedSubIds) : null);
    let defaultStartDate = effectiveDates.startDateStr;
    let defaultEndDate = effectiveDates.endDateStr;
    let defaultDept = 'เทคโนโลยีโยธา';
    let defaultRequester = 'นายณัฐวรรธน์ เกษกุล';
    let defaultLevel = '1';

    if (term.subjects.length > 0) {
        const firstSub = term.subjects[0];
        const claim = (typeof ensureSubjectClaimData === 'function')
            ? ensureSubjectClaimData(term, firstSub)
            : (firstSub.claimData || {});
        if (claim) {
            if (claim.department) defaultDept = claim.department;
            if (claim.teacherName) defaultRequester = claim.teacherName;
            if (claim.level) defaultLevel = claim.level.replace(/[^0-9]/g, '') || '1';
        }
    }

    // Check if saved state has stale placeholder dates or empty
    const isStaleStartDate = !state.startDateStr || 
        state.startDateStr.includes('2 มิถุนายน') || 
        state.startDateStr.includes('มิถุนายน 2568');
    const isStaleEndDate = !state.endDateStr || 
        state.endDateStr.includes('29 กันยายน') || 
        state.endDateStr.includes('4 ตุลาคม 2568');

    const effectiveStartVal = isStaleStartDate ? defaultStartDate : (state.startDateStr || defaultStartDate);
    const effectiveEndVal = isStaleEndDate ? defaultEndDate : (state.endDateStr || defaultEndDate);
    const effectiveTermYear = (state.termYearStr && state.termYearStr.includes(String(term.no))) 
        ? state.termYearStr 
        : `${term.no}  /   ${term.year}`;

    state.startDateStr = effectiveStartVal;
    state.endDateStr = effectiveEndVal;
    state.termYearStr = effectiveTermYear;

    // Populate Memo Input Fields
    const setVal = (id, val, fallback) => {
        const el = document.getElementById(id);
        if (el) el.value = (val !== undefined && val !== null && String(val).trim() !== '') ? val : fallback;
    };

    setVal('summary-input-dept', state.deptHeader, 'สาขาวิชาโยธา  วิทยาลัยเทคนิคอุบลราชธานี');
    setVal('summary-input-doc-no', state.docNo, '');
    setVal('summary-input-doc-date', state.docDate, '');
    setVal('summary-input-subject-title', state.docSubject, 'ขอเบิกค่าสอนระดับปริญญาตรี');
    setVal('summary-input-recipient', state.recipient, 'ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี');
    setVal('summary-input-requester', state.requesterName, defaultRequester);
    setVal('summary-input-role', state.requesterRole, 'อาจารย์');
    setVal('summary-input-dept-name', state.department, defaultDept);
    setVal('summary-input-level', state.classLevel, defaultLevel);
    setVal('summary-input-term-year', state.termYearStr, `${term.no}  /   ${term.year}`);
    setVal('summary-input-percent', state.percent, 60);
    setVal('summary-input-start-date', state.startDateStr, defaultStartDate);
    setVal('summary-input-end-date', state.endDateStr, defaultEndDate);

    // Signatures (ดึงค่าเริ่มต้นจากเทอมแรกอัตโนมัติ)
    const sig = state.signatures || {};
    const defSig = getDefaultSignatures2To9();
    setVal('summary-sig-requester', sig.requester, defaultRequester);
    setVal('summary-sig-dept-head', sig.deptHead, defSig.deptHead || 'นายปริวัฒน์ ยืนยิ่ง');
    setVal('summary-sig-verifier', sig.verifier, defSig.curriculumHead || 'นายชนะ   สุทธิประภา');
    setVal('summary-sig-verifier-role', sig.verifierRole, defSig.curriculumHeadRole || 'หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีหรือสายปฏิบัติการ');
    setVal('summary-sig-academic-deputy', sig.academicDeputy, defSig.academicDeputy || 'นายสุวิชา  มั่นยืน');
    setVal('summary-sig-resource-deputy', sig.resourceDeputy, defSig.resourceDeputy || 'นางสาวสายฝน  สาระผล');
    setVal('summary-sig-director', sig.director, defSig.director || 'นายธาตรี  พิบูลมณฑา');

    renderSummaryClaimSubjectSelector();
    renderSummaryClaimA4();
    openModal('modal-summary-claim');
}

function saveSummaryClaimState() {
    const term = appData.terms.find(t => t.id === currentSummaryTermId);
    if (!term) return;

    if (!term.summaryClaimData) term.summaryClaimData = {};
    const state = term.summaryClaimData;

    const getVal = (id) => (document.getElementById(id)?.value || '').trim();

    state.selectedSubjectIds = Array.from(summaryClaimSelectedSubIds);
    state.deptHeader = getVal('summary-input-dept');
    state.docNo = getVal('summary-input-doc-no');
    state.docDate = getVal('summary-input-doc-date');
    state.docSubject = getVal('summary-input-subject-title');
    state.recipient = getVal('summary-input-recipient');
    state.requesterName = getVal('summary-input-requester');
    state.requesterRole = getVal('summary-input-role');
    state.department = getVal('summary-input-dept-name');
    state.classLevel = getVal('summary-input-level');
    state.termYearStr = getVal('summary-input-term-year');
    state.percent = getVal('summary-input-percent');
    state.startDateStr = getVal('summary-input-start-date');
    state.endDateStr = getVal('summary-input-end-date');

    state.signatures = {
        requester: getVal('summary-sig-requester'),
        deptHead: getVal('summary-sig-dept-head'),
        verifier: getVal('summary-sig-verifier'),
        verifierRole: getVal('summary-sig-verifier-role'),
        academicDeputy: getVal('summary-sig-academic-deputy'),
        resourceDeputy: getVal('summary-sig-resource-deputy'),
        director: getVal('summary-sig-director')
    };

    saveData();
}

function renderSummaryClaimSubjectSelector() {
    const term = appData.terms.find(t => t.id === currentSummaryTermId);
    const container = document.getElementById('summary-subjects-selector-list');
    const badge = document.getElementById('summary-selected-count-badge');
    if (!term || !container) return;

    container.innerHTML = '';

    if (term.subjects.length === 0) {
        container.innerHTML = `
            <div class="p-4 text-center text-xs text-gray-500 bg-[#0f121d] rounded-lg border border-[#2d3748]">
                <i class="fa-solid fa-triangle-exclamation text-amber-400 mb-1 block"></i>
                ยังไม่มีรายวิชาในภาคเรียนนี้ กรุณาเพิ่มรายวิชาในเทอมก่อน
            </div>
        `;
        if (badge) {
            badge.innerHTML = `<span>เลือก 0 รายวิชา</span><span>ยอดรวม: 0.00 บาท</span>`;
        }
        return;
    }

    let selectedCount = 0;
    let selectedMoney = 0;

    term.subjects.forEach(sub => {
        const info = getSubjectClaimSummary(sub);
        const isChecked = summaryClaimSelectedSubIds.has(sub.id);

        if (isChecked) {
            selectedCount++;
            selectedMoney += info.totalMoney;
        }

        const card = document.createElement('label');
        card.className = `p-2.5 rounded-lg border text-xs flex items-start gap-2.5 cursor-pointer transition ${isChecked ? 'bg-orange-950/20 border-orange-500/50 text-white' : 'bg-[#0f121d] border-[#2d3748] text-gray-400 hover:border-gray-500'}`;
        card.innerHTML = `
            <input type="checkbox" class="chk-summary-sub accent-orange-500 rounded mt-0.5" data-sub-id="${sub.id}" ${isChecked ? 'checked' : ''}>
            <div class="flex-1 overflow-hidden">
                <div class="flex justify-between items-center mb-0.5">
                    <span class="font-bold text-white text-[12px] truncate">${info.name}</span>
                    <span class="font-mono text-orange-300 font-bold ml-2">${formatMoney(info.totalMoney)} บ.</span>
                </div>
                <div class="text-[11px] text-gray-400 flex items-center justify-between">
                    <span>รหัส: ${info.code || '-'} | ผู้สอน: ${info.teacherName}</span>
                    <span>${info.hours} ชม. (${info.rate} บ.)</span>
                </div>
            </div>
        `;

        const chk = card.querySelector('.chk-summary-sub');
        chk.addEventListener('change', () => {
            if (chk.checked) {
                summaryClaimSelectedSubIds.add(sub.id);
            } else {
                summaryClaimSelectedSubIds.delete(sub.id);
            }
            saveSummaryClaimState();
            renderSummaryClaimSubjectSelector();
            renderSummaryClaimA4();
        });

        container.appendChild(card);
    });

    if (badge) {
        badge.innerHTML = `
            <span>เลือก ${selectedCount} จาก ${term.subjects.length} รายวิชา</span>
            <span>ยอดรวม: ${formatMoney(selectedMoney)} บาท</span>
        `;
    }
}

function parseThaiDateComponents(str, fallbackYear = '2568') {
    if (!str || !String(str).trim()) {
        return { day: '.....', month: '..................', year: '........' };
    }
    
    let s = String(str).trim();

    // 1. Check DD/MM/YYYY
    if (s.includes('/')) {
        const parts = s.split('/');
        if (parts.length >= 3) {
            const d = parseInt(parts[0].trim()) || parts[0].trim();
            const mIdx = parseInt(parts[1].trim()) - 1;
            const m = (mIdx >= 0 && mIdx < 12 && THAI_MONTHS_FULL[mIdx]) ? THAI_MONTHS_FULL[mIdx] : parts[1].trim();
            let y = parseInt(parts[2].trim()) || parts[2].trim();
            if (typeof y === 'number' && y < 2500) y += 543;
            return { day: String(d), month: m, year: String(y) };
        }
    }

    // 2. Check YYYY-MM-DD
    if (s.includes('-')) {
        const p = s.split('-');
        if (p.length === 3 && p[0].length === 4) {
            let y = parseInt(p[0]);
            if (y < 2500) y += 543;
            const mIdx = parseInt(p[1]) - 1;
            const m = (mIdx >= 0 && mIdx < 12 && THAI_MONTHS_FULL[mIdx]) ? THAI_MONTHS_FULL[mIdx] : p[1];
            const d = parseInt(p[2]);
            return { day: String(d), month: m, year: String(y) };
        }
    }

    // 3. Month extraction (search full names first, then short abbreviations)
    let foundMonth = '';
    const thaiMonthsShort = [
        'ม.ค.', 'ก.พ.', 'มี.ค.', 'เม.ย.', 'พ.ค.', 'มิ.ย.',
        'ก.ค.', 'ส.ค.', 'ก.ย.', 'ต.ค.', 'พ.ย.', 'ธ.ค.'
    ];

    for (let i = 0; i < THAI_MONTHS_FULL.length; i++) {
        if (s.includes(THAI_MONTHS_FULL[i])) {
            foundMonth = THAI_MONTHS_FULL[i];
            s = s.replace(THAI_MONTHS_FULL[i], ' ');
            break;
        }
    }
    if (!foundMonth) {
        for (let i = 0; i < thaiMonthsShort.length; i++) {
            if (s.includes(thaiMonthsShort[i])) {
                foundMonth = THAI_MONTHS_FULL[i];
                s = s.replace(thaiMonthsShort[i], ' ');
                break;
            }
        }
    }

    // 4. Year extraction (4-digit number: 25xx or 20xx)
    let foundYear = '';
    const yearMatch = s.match(/\b(25\d{2}|20\d{2}|\d{4})\b/);
    if (yearMatch) {
        let yVal = parseInt(yearMatch[1]);
        if (yVal < 2500) yVal += 543;
        foundYear = String(yVal);
        s = s.replace(yearMatch[0], ' ');
    } else {
        foundYear = String(fallbackYear || '2568');
    }

    // Clean Thai prefix words like วันที่, วัน, เดือน, พ.ศ., พศ
    s = s.replace(/(วันที่|วัน|เดือน|พ\.ศ\.|พศ)/g, ' ');

    // 5. Day extraction (1-31)
    let foundDay = '';
    const dayMatch = s.match(/\b([1-9]|[12]\d|3[01])\b/);
    if (dayMatch) {
        foundDay = String(parseInt(dayMatch[1]));
    } else {
        foundDay = s.trim() || '.....';
    }

    return {
        day: foundDay || '.....',
        month: foundMonth || '..................',
        year: foundYear || '........'
    };
}

// -------------------------------------------------------------------------
// DYNAMIC TERM DATE RANGE CALCULATION (คำนวณช่วงวันที่เบิกจริงจากรายวิชา)
// -------------------------------------------------------------------------
function getTermEffectiveDateRange(term, selectedSubIds = null) {
    if (!term || !term.subjects || term.subjects.length === 0) {
        return {
            startDateStr: `1 ${THAI_MONTHS_FULL[5]} พ.ศ. ${term ? term.year : 2568}`,
            endDateStr: `30 ${THAI_MONTHS_FULL[8]} พ.ศ. ${term ? term.year : 2568}`
        };
    }

    const subIdsToInclude = selectedSubIds && selectedSubIds.length > 0 
        ? selectedSubIds 
        : term.subjects.map(s => s.id);
    const subs = term.subjects.filter(s => subIdsToInclude.includes(s.id));
    const targetSubs = subs.length > 0 ? subs : term.subjects;

    let minDateObj = null;
    let minDateStr = '';
    let maxDateObj = null;
    let maxDateStr = '';

    targetSubs.forEach(sub => {
        const claim = (typeof ensureSubjectClaimData === 'function')
            ? ensureSubjectClaimData(term, sub)
            : (sub.claimData || {});

        // 1. Check start date
        let subStartDateObj = null;
        if (claim.startDate) {
            const d = new Date(claim.startDate);
            if (!isNaN(d.getTime())) subStartDateObj = d;
        }
        if (!subStartDateObj && claim.weeks && claim.weeks.length > 0 && claim.weeks[0].date) {
            const d = new Date(claim.weeks[0].date);
            if (!isNaN(d.getTime())) subStartDateObj = d;
        }

        if (subStartDateObj) {
            if (!minDateObj || subStartDateObj.getTime() < minDateObj.getTime()) {
                minDateObj = subStartDateObj;
                minDateStr = formatThaiDateFull(subStartDateObj);
            }
        }

        // 2. Check end date
        let subEndDateObj = null;
        let subEndThai = claim.endDateThai;

        if (claim.weeks && claim.weeks.length > 0) {
            for (let i = claim.weeks.length - 1; i >= 0; i--) {
                if (claim.weeks[i].date) {
                    const d = new Date(claim.weeks[i].date);
                    if (!isNaN(d.getTime())) {
                        subEndDateObj = d;
                        break;
                    }
                }
            }
        }

        if (!subEndDateObj && subEndThai) {
            const comp = parseThaiDateComponents(subEndThai, term.year);
            if (comp.month && comp.day && !isNaN(parseInt(comp.day))) {
                const mIdx = THAI_MONTHS_FULL.indexOf(comp.month);
                let yCe = parseInt(comp.year);
                if (yCe > 2400) yCe -= 543;
                if (mIdx >= 0 && !isNaN(yCe)) {
                    subEndDateObj = new Date(yCe, mIdx, parseInt(comp.day));
                }
            }
        }

        if (subEndDateObj) {
            if (!maxDateObj || subEndDateObj.getTime() > maxDateObj.getTime()) {
                maxDateObj = subEndDateObj;
                maxDateStr = (subEndThai && subEndThai.includes('เดือน')) 
                    ? subEndThai 
                    : formatThaiDateFull(subEndDateObj);
            }
        } else if (subEndThai && !maxDateStr) {
            maxDateStr = subEndThai;
        }
    });

    return {
        startDateStr: minDateStr || (targetSubs[0]?.claimData?.startDate ? formatThaiDateFull(targetSubs[0].claimData.startDate) : `1 มิถุนายน พ.ศ. ${term.year}`),
        endDateStr: maxDateStr || (targetSubs[0]?.claimData?.endDateThai || `30 กันยายน พ.ศ. ${term.year}`)
    };
}

function generateSummaryClaimA4HTML(term, selectedSubIds = null) {
    if (!term) return '';
    const state = term.summaryClaimData || {};

    // Calculate effective date range from subjects (or selected subjects)
    const effectiveDates = getTermEffectiveDateRange(term, selectedSubIds);

    // Only read from DOM if #modal-summary-claim is currently open for THIS term
    const isSummaryModalOpenForThisTerm = 
        (typeof currentSummaryTermId !== 'undefined' && currentSummaryTermId === term.id) &&
        Boolean(document.getElementById('modal-summary-claim')?.classList.contains('active'));

    const getVal = (id, fallback) => {
        if (isSummaryModalOpenForThisTerm) {
            const v = document.getElementById(id)?.value;
            if (v !== undefined && v !== null && v.trim() !== '') return v.trim();
        }
        return fallback;
    };

    const deptHeader = getVal('summary-input-dept', state.deptHeader || 'สาขาวิชาโยธา  วิทยาลัยเทคนิคอุบลราชธานี');
    const docNo = getVal('summary-input-doc-no', state.docNo || '');
    const docDate = getVal('summary-input-doc-date', state.docDate || '');
    const subjectTitle = getVal('summary-input-subject-title', state.docSubject || 'ขอเบิกค่าสอนระดับปริญญาตรี');
    const recipient = getVal('summary-input-recipient', state.recipient || 'ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี');

    // Default requester and department from first subject or term
    let defaultDept = 'เทคโนโลยีโยธา';
    let defaultRequester = 'นายณัฐวรรธน์ เกษกุล';
    let defaultLevel = '1';

    if (term.subjects && term.subjects.length > 0) {
        const firstSub = term.subjects[0];
        const claim = (typeof ensureSubjectClaimData === 'function') 
            ? ensureSubjectClaimData(term, firstSub) 
            : (firstSub.claimData || {});
        if (claim) {
            if (claim.department) defaultDept = claim.department;
            if (claim.teacherName) defaultRequester = claim.teacherName;
            if (claim.level) defaultLevel = claim.level.replace(/[^0-9]/g, '') || '1';
        }
    }

    const requester = getVal('summary-input-requester', state.requesterName || defaultRequester);
    const role = getVal('summary-input-role', state.requesterRole || 'อาจารย์');
    const deptName = getVal('summary-input-dept-name', state.department || defaultDept);
    const level = getVal('summary-input-level', state.classLevel || defaultLevel);
    const percent = getVal('summary-input-percent', state.percent || '60');
    
    // Ensure termYearStr matches term
    const defaultTermYear = (state.termYearStr && state.termYearStr.includes(String(term.no))) 
        ? state.termYearStr 
        : `${term.no}  /   ${term.year}`;
    const termYearStr = getVal('summary-input-term-year', defaultTermYear);

    // Ensure dates are updated and not stale dummy values
    const isStaleStartDate = !state.startDateStr || 
        state.startDateStr.includes('2 มิถุนายน') || 
        state.startDateStr.includes('มิถุนายน 2568');
    const isStaleEndDate = !state.endDateStr || 
        state.endDateStr.includes('29 กันยายน') || 
        state.endDateStr.includes('4 ตุลาคม 2568');

    const fallbackStart = (isStaleStartDate || !isSummaryModalOpenForThisTerm) 
        ? effectiveDates.startDateStr 
        : (state.startDateStr || effectiveDates.startDateStr);
    const fallbackEnd = (isStaleEndDate || !isSummaryModalOpenForThisTerm) 
        ? effectiveDates.endDateStr 
        : (state.endDateStr || effectiveDates.endDateStr);

    const startDateStr = getVal('summary-input-start-date', fallbackStart);
    const endDateStr = getVal('summary-input-end-date', fallbackEnd);

    // Parse date components
    const startComp = parseThaiDateComponents(startDateStr, term ? term.year : 2568);
    const endComp = parseThaiDateComponents(endDateStr, term ? term.year : 2568);

    // Split deptHeader into left (department) and right (college) if present
    let deptLeft = 'สาขาวิชาโยธา';
    let deptRight = 'วิทยาลัยเทคนิคอุบลราชธานี';
    if (deptHeader.includes('วิทยาลัย')) {
        const parts = deptHeader.split('วิทยาลัย');
        deptLeft = parts[0].trim() || 'สาขาวิชาโยธา';
        deptRight = 'วิทยาลัย' + parts.slice(1).join('วิทยาลัย').trim();
    } else {
        deptLeft = deptHeader;
        deptRight = '';
    }

    // Signatures (ดึงค่าเริ่มต้นจากเทอมแรกผ่าน getDefaultSignatures2To9)
    const sig = state.signatures || {};
    const defSig = (typeof getDefaultSignatures2To9 === 'function') ? getDefaultSignatures2To9() : {};
    const sigRequester = getVal('summary-sig-requester', sig.requester || requester);
    const sigDeptHead = getVal('summary-sig-dept-head', sig.deptHead || defSig.deptHead || 'นายปริวัฒน์ ยืนยิ่ง');
    const sigVerifier = getVal('summary-sig-verifier', sig.verifier || defSig.curriculumHead || 'นายชนะ   สุทธิประภา');
    const sigVerifierRole = getVal('summary-sig-verifier-role', sig.verifierRole || defSig.curriculumHeadRole || 'หัวหน้างานพัฒนาหลักสูตรสายเทคโนโลยีหรือสายปฏิบัติการ');
    const sigAcademic = getVal('summary-sig-academic-deputy', sig.academicDeputy || defSig.academicDeputy || 'นายสุวิชา  มั่นยืน');
    const sigResource = getVal('summary-sig-resource-deputy', sig.resourceDeputy || defSig.resourceDeputy || 'นางสาวสายฝน  สาระผล');
    const sigDirector = getVal('summary-sig-director', sig.director || defSig.director || 'นายธาตรี  พิบูลมณฑา');

    // Filter selected subjects
    const subIdsToInclude = selectedSubIds ? selectedSubIds : (term.subjects.map(s => s.id));
    const selectedSubs = term.subjects.filter(s => subIdsToInclude.includes(s.id));

    // Determine teacher column width based on the longest teacher name
    const measureCanvas = document.createElement('canvas');
    const measureCtx = measureCanvas.getContext('2d');
    measureCtx.font = '14pt "TH Sarabun New", "TH Sarabun PSK", Sarabun, sans-serif';

    let maxTeacherWidth = 0;
    selectedSubs.forEach(sub => {
        const info = getSubjectClaimSummary(sub, term);
        const w = measureCtx.measureText(info.teacherName || '').width;
        if (w > maxTeacherWidth) maxTeacherWidth = w;
    });
    // Add cell padding (padding: 2px 4px -> 8px horizontal + 4px safety)
    const teacherColWidth = Math.max(90, Math.min(140, Math.ceil(maxTeacherWidth + 12)));

    // Measure non-subject columns:
    // col 1 (ที่): 22px
    // col 2 (ชื่อ-สกุล): teacherColWidth
    // col 4 (หน่วยกิต): 36px
    // col 5 (จำนวน นศ.): 44px
    // col 6 (ชั่วโมง): 34px
    // col 7 (อัตรา/ชม.): 40px
    // col 8 (เป็นเงิน): 66px
    // Printable A4 content width is ~604.7px.
    // Non-subject columns sum = 22 + teacherColWidth + 36 + 44 + 34 + 40 + 66 = 242 + teacherColWidth.
    const maxSubjectTextWidth = Math.max(160, 604.7 - (242 + teacherColWidth) - 8);

    let sumCredits = 0;
    let sumStudents = 0;
    let sumHours = 0;
    let sumMoney = 0;
    let representativeRate = 42;

    let rowsHtml = '';
    selectedSubs.forEach((sub, idx) => {
        const info = getSubjectClaimSummary(sub, term);
        sumCredits += (parseInt(info.credits) || 0);
        sumStudents = Math.max(sumStudents, (parseInt(info.students) || 0));
        sumHours += (parseInt(info.hours) || 0);
        sumMoney += (parseFloat(info.totalMoney) || 0);
        representativeRate = info.rate || representativeRate;

        // Auto calculate font size for subject name from 13.5pt down to 6.5pt
        let bestSubjectFontSizePt = 6.5;
        for (let pt = 13.5; pt >= 6.5; pt -= 0.25) {
            measureCtx.font = `${pt}pt "TH Sarabun New", "TH Sarabun PSK", Sarabun, sans-serif`;
            if (measureCtx.measureText(info.name || '').width <= maxSubjectTextWidth) {
                bestSubjectFontSizePt = pt;
                break;
            }
        }

        // Auto calculate font size for teacher name if needed
        let bestTeacherFontSizePt = 13.5;
        for (let pt = 13.5; pt >= 8.5; pt -= 0.25) {
            measureCtx.font = `${pt}pt "TH Sarabun New", "TH Sarabun PSK", Sarabun, sans-serif`;
            if (measureCtx.measureText(info.teacherName || '').width <= (teacherColWidth - 8)) {
                bestTeacherFontSizePt = pt;
                break;
            }
        }

        rowsHtml += `
            <tr style="height: 28px;">
                <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 11.5pt;">${idx + 1}</td>
                <td class="summary-teacher-cell" style="border: 1px solid #000; padding: 2px 3px; white-space: nowrap; overflow: hidden; vertical-align: middle;">
                    <span class="summary-teacher-text" data-pt="${bestTeacherFontSizePt}" style="display: inline-block; white-space: nowrap; font-size: ${bestTeacherFontSizePt}pt; line-height: 1.15;">${info.teacherName}</span>
                </td>
                <td class="summary-subject-cell" style="border: 1px solid #000; padding: 2px 3px; white-space: nowrap; overflow: hidden; vertical-align: middle;">
                    <span class="summary-subject-text" data-pt="${bestSubjectFontSizePt}" style="display: inline-block; white-space: nowrap; font-size: ${bestSubjectFontSizePt}pt; line-height: 1.15;">${info.name}</span>
                </td>
                <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 11.5pt;">${info.credits}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 11.5pt;">${info.students}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 11.5pt;">${info.hours}</td>
                <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 11.5pt;">${info.rate}</td>
                <td style="text-align: right; border: 1px solid #000; padding: 2px 4px; font-size: 11.5pt; white-space: nowrap;">${formatMoney(info.totalMoney)}</td>
            </tr>
        `;
    });

    // If empty
    if (selectedSubs.length === 0) {
        rowsHtml = `
            <tr>
                <td colspan="8" style="text-align: center; padding: 18px; color: #888; border: 1px solid #000;">
                    (ยังไม่ได้เลือกรายวิชาที่ต้องการเบิก กรุณาติ๊กเลือกวิชาในแถบด้านซ้าย)
                </td>
            </tr>
        `;
    }

    // Totals Row
    const totalsRowHtml = `
        <tr style="height: 28px; font-weight: bold; background-color: #fafafa;">
            <td colspan="3" style="text-align: center; border: 1px solid #000; padding: 2px 4px; font-size: 12.5pt;">รวม</td>
            <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 11.5pt;">${sumCredits}</td>
            <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 11.5pt;">${sumStudents || (selectedSubs.length > 0 ? 6 : 0)}</td>
            <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 11.5pt;">${sumHours}</td>
            <td style="text-align: center; border: 1px solid #000; padding: 2px 1px; font-size: 11.5pt;">${selectedSubs.length > 0 ? representativeRate : ''}</td>
            <td style="text-align: right; border: 1px solid #000; padding: 2px 4px; font-size: 11.5pt; white-space: nowrap;">${formatMoney(sumMoney)}</td>
        </tr>
    `;

    return `
        <div style="font-family: 'TH Sarabun New', 'TH Sarabun PSK', 'Sarabun', Tahoma, sans-serif; color: #000000; line-height: 1.35; font-size: 14pt; padding: 0;">
            
            <!-- Garuda Crest Header (Top Left Garuda, Center Title) -->
            <div style="position: relative; min-height: 68px; margin-bottom: 4px;">
                <img src="ตราครุฑ.jpg" alt="ตราครุฑ" style="width: 64px; height: auto; position: absolute; left: 0; top: 0;">
                <div style="text-align: center; font-size: 33px; font-weight: bold; padding-top: 10px; letter-spacing: 0.5px;">
                    บันทึกข้อความ
                </div>
            </div>

            <!-- Official Header Fields -->
            <div style="font-size: 14pt; margin-bottom: 5px; display: flex; align-items: flex-end;">
                <span style="font-weight: bold; width: 85px; flex-shrink: 0; padding-bottom: 1px;">ส่วนราชการ</span>
                <div style="flex: 1; border-bottom: 1px dotted #333; display: flex; justify-content: space-between; align-items: flex-end; padding: 0 4px 1px 6px; line-height: 1.2; min-height: 22px;">
                    <span style="white-space: nowrap;">${deptLeft}</span>
                    <span style="white-space: nowrap;">${deptRight}</span>
                </div>
            </div>

            <div style="display: flex; font-size: 14pt; margin-bottom: 5px; align-items: flex-end;">
                <div style="width: 50%; display: flex; align-items: flex-end; padding-right: 14px;">
                    <span style="font-weight: bold; width: 24px; flex-shrink: 0; padding-bottom: 1px;">ที่</span>
                    <div style="flex: 1; border-bottom: 1px dotted #333; padding: 0 4px 1px 6px; line-height: 1.2; min-height: 22px; white-space: nowrap;">
                        ${docNo || ''}
                    </div>
                </div>
                <div style="width: 50%; display: flex; align-items: flex-end;">
                    <span style="font-weight: bold; width: 44px; flex-shrink: 0; padding-bottom: 1px;">วันที่</span>
                    <div style="flex: 1; border-bottom: 1px dotted #333; padding: 0 4px 1px 6px; line-height: 1.2; min-height: 22px; white-space: nowrap;">
                        ${docDate || ''}
                    </div>
                </div>
            </div>

            <div style="display: flex; align-items: flex-end; font-size: 14pt; margin-bottom: 5px;">
                <span style="font-weight: bold; width: 50px; flex-shrink: 0; padding-bottom: 1px;">เรื่อง</span>
                <div style="flex: 1; border-bottom: 1px dotted #333; padding: 0 4px 1px 6px; line-height: 1.2; min-height: 22px; white-space: nowrap;">
                    ${subjectTitle || ''}
                </div>
            </div>

            <div style="display: flex; align-items: flex-end; font-size: 14pt; margin-bottom: 12px;">
                <span style="font-weight: bold; width: 50px; flex-shrink: 0; padding-bottom: 1px;">เรียน</span>
                <div style="flex: 1; border-bottom: 1px dotted #333; padding: 0 4px 1px 6px; line-height: 1.2; min-height: 22px; white-space: nowrap;">
                    ${recipient || ''}
                </div>
            </div>

            <!-- Body Paragraph with Indent -->
            <div style="text-align: justify; text-indent: 110px; font-size: 14pt; line-height: 1.35; margin-bottom: 10px;">
                ด้วย ${requester} ตำแหน่ง ${role} สาขาวิชา ${deptName} ขออนุญาตเบิกค่าสอนระดับปริญญาตรี จำนวน ${percent}% ของยอดนักศึกษาที่จ่ายเงินลงทะเบียนเรียน ระดับ ปริญญาตรี ชั้นปีที่ ${level} สาขาวิชา ${deptName} ประจำภาคเรียนที่ ${termYearStr} ระหว่าง วันที่ ${startComp.day} เดือน ${startComp.month} พ.ศ. ${startComp.year} ถึง วันที่ ${endComp.day} เดือน ${endComp.month} พ.ศ. ${endComp.year} รายละเอียดต่อไปนี้
            </div>

            <!-- Table (8 Columns) -->
            <table class="doc-table" style="width: 100%; table-layout: fixed; border-collapse: collapse; font-size: 14pt; margin-bottom: 6px;">
                <colgroup>
                    <col style="width: 22px;">
                    <col style="width: ${teacherColWidth}px;">
                    <col>
                    <col style="width: 36px;">
                    <col style="width: 44px;">
                    <col style="width: 34px;">
                    <col style="width: 40px;">
                    <col style="width: 66px;">
                </colgroup>
                <thead>
                    <tr style="background-color: #f3f4f6; font-weight: bold; text-align: center; height: 28px; line-height: 1.15;">
                        <th style="border: 1px solid #000; padding: 2px 1px; white-space: nowrap; font-size: 10.5pt;">ที่</th>
                        <th style="border: 1px solid #000; padding: 2px 2px; white-space: nowrap; font-size: 10.5pt;">ชื่อ - สกุล</th>
                        <th style="border: 1px solid #000; padding: 2px 3px; white-space: nowrap; font-size: 10.5pt;">ชื่อวิชา</th>
                        <th style="border: 1px solid #000; padding: 2px 1px; white-space: nowrap; font-size: 10.5pt;">หน่วยกิต</th>
                        <th style="border: 1px solid #000; padding: 2px 1px; white-space: nowrap; font-size: 9.5pt;">จำนวน นศ.</th>
                        <th style="border: 1px solid #000; padding: 2px 1px; white-space: nowrap; font-size: 10.5pt;">ชั่วโมง</th>
                        <th style="border: 1px solid #000; padding: 2px 1px; white-space: nowrap; font-size: 10pt;">อัตรา/ชม.</th>
                        <th style="border: 1px solid #000; padding: 2px 2px; white-space: nowrap; font-size: 10.5pt;">เป็นเงิน</th>
                    </tr>
                </thead>
                <tbody>
                    ${rowsHtml}
                    ${totalsRowHtml}
                </tbody>
            </table>

            <div style="text-indent: 110px; font-size: 14pt; margin-top: 6px; margin-bottom: 8px; line-height: 1.35;">
                จึงเรียนมาเพื่อโปรดพิจารณาอนุมัติ
            </div>

            <!-- Signatures Block -->
            <div style="font-size: 14pt; line-height: 1.3; margin-top: 10px;">
                
                <!-- Row 1: ผู้ขอเบิก & หัวหน้าสาขาวิชา -->
                <div style="display: flex; justify-content: space-between; align-items: flex-start; margin-bottom: 10px;">
                    <div style="width: 48%; text-align: center;">
                        ลงชื่อ .................................................... ผู้ขอเบิก<br>
                        <span style="display: inline-block; margin-top: 3px;">(${sigRequester})</span>
                    </div>
                    <div style="width: 48%; text-align: center;">
                        ลงชื่อ .................................................... หัวหน้าสาขาวิชา<br>
                        <span style="display: inline-block; margin-top: 3px;">(${sigDeptHead})</span>
                    </div>
                </div>

                <!-- Row 2: ผู้ตรวจสอบ (Centered) -->
                <div style="text-align: center; margin-bottom: 10px;">
                    ลงชื่อ ..................................................... ผู้ตรวจสอบ<br>
                    <span style="display: inline-block; margin-top: 3px;">(${sigVerifier})</span><br>
                    ${sigVerifierRole}
                </div>

                <!-- Row 3: รองฯ ฝ่ายวิชาการ & รองฯ ฝ่ายบริหารทรัพยากร -->
                <div style="display: flex; justify-content: space-between; align-items: flex-start; margin-bottom: 10px;">
                    <div style="width: 48%; text-align: center;">
                        <strong style="font-weight: bold;">เห็นควรลงนามอนุมัติดังเสนอ</strong><br>
                        <span style="display: inline-block; margin-top: 3px;">ลงชื่อ ......................................................</span><br>
                        <span style="display: inline-block; margin-top: 3px;">(${sigAcademic})</span><br>
                        รองผู้อำนวยการฝ่ายวิชาการ
                    </div>
                    <div style="width: 48%; text-align: center;">
                        <strong style="font-weight: bold;">ควรอนุมัติให้จ่ายได้</strong><br>
                        <span style="display: inline-block; margin-top: 3px;">ลงชื่อ ..................................................................</span><br>
                        <span style="display: inline-block; margin-top: 3px;">(${sigResource})</span><br>
                        รองผู้อำนวยการฝ่ายบริหารทรัพยากร
                    </div>
                </div>

                <!-- Row 4: ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี (Centered) -->
                <div style="text-align: center;">
                    <strong style="font-weight: bold;">อนุมัติให้เบิกจ่ายได้</strong><br>
                    <span style="display: inline-block; margin-top: 3px;">ลงชื่อ .........................................................</span><br>
                    <span style="display: inline-block; margin-top: 3px;">(${sigDirector})</span><br>
                    ผู้อำนวยการวิทยาลัยเทคนิคอุบลราชธานี
                </div>

            </div>

        </div>
    `;
}

function fitSummaryClaimTableFonts(container) {
    if (!container) return;
    // Fit subject name cells
    container.querySelectorAll('.summary-subject-cell').forEach(cell => {
        const textSpan = cell.querySelector('.summary-subject-text');
        if (!textSpan) return;
        const cellWidth = cell.clientWidth;
        if (cellWidth <= 0) return;
        const computed = window.getComputedStyle(cell);
        const pad = (parseFloat(computed.paddingLeft) || 0) + (parseFloat(computed.paddingRight) || 0);
        const avail = cellWidth - pad - 1;
        if (avail > 30) {
            let curPt = parseFloat(textSpan.getAttribute('data-pt')) || 13;
            while (textSpan.offsetWidth > avail && curPt > 6.0) {
                curPt -= 0.25;
                textSpan.style.fontSize = curPt + 'pt';
            }
        }
    });

    // Fit teacher name cells
    container.querySelectorAll('.summary-teacher-cell').forEach(cell => {
        const textSpan = cell.querySelector('.summary-teacher-text');
        if (!textSpan) return;
        const cellWidth = cell.clientWidth;
        if (cellWidth <= 0) return;
        const computed = window.getComputedStyle(cell);
        const pad = (parseFloat(computed.paddingLeft) || 0) + (parseFloat(computed.paddingRight) || 0);
        const avail = cellWidth - pad - 1;
        if (avail > 30) {
            let curPt = parseFloat(textSpan.getAttribute('data-pt')) || 13;
            while (textSpan.offsetWidth > avail && curPt > 7.0) {
                curPt -= 0.25;
                textSpan.style.fontSize = curPt + 'pt';
            }
        }
    });
}

function renderSummaryClaimA4() {
    const term = appData.terms.find(t => t.id === currentSummaryTermId);
    const paper = document.getElementById('summary-claim-paper');
    if (!term || !paper) return;

    paper.innerHTML = generateSummaryClaimA4HTML(term, Array.from(summaryClaimSelectedSubIds));
    fitSummaryClaimTableFonts(paper);
}

function printSummaryClaim() {
    document.body.classList.add('printing-summary-claim');
    window.print();
    setTimeout(() => {
        document.body.classList.remove('printing-summary-claim');
    }, 1000);
}

// -------------------------------------------------------------------------
// BATCH PRINT SYSTEM (ระบบสั่งพิมพ์เอกสารเลือกเทอม/รายวิชา/ใบเบิกรวม)
// -------------------------------------------------------------------------
let batchPrintSelectedSubIds = new Set();

function ensureSubjectClaimData(term, sub) {
    if (sub.claimData) {
        const c = JSON.parse(JSON.stringify(sub.claimData));
        if (!c.rateCustomized && term && term.hourlyRate) {
            c.rate = term.hourlyRate;
        }
        return c;
    }
    const masterSub = (appData.subjects_master || []).find(s => s.id === sub.subjectId) || {};
    const teacher = (appData.teachers || []).find(t => t.id === sub.teacherId) || {};
    const c = createInitialSubjectClaimData(term, masterSub, teacher);
    sub.claimData = JSON.parse(JSON.stringify(c));
    sub.hours = c.weeks.reduce((sum, w) => sum + (w.isHoliday ? 0 : (parseFloat(w.totalHrs) || 0)), 0);
    return c;
}

function initBatchPrintSystem() {
    const btnBatchPrint = document.getElementById('btn-batch-print');
    if (!btnBatchPrint) return;

    btnBatchPrint.addEventListener('click', openBatchPrintModal);

    const termSelect = document.getElementById('batch-print-term-select');
    if (termSelect) {
        termSelect.addEventListener('change', () => {
            renderBatchPrintOptions(termSelect.value);
        });
    }

    const btnSelectAll = document.getElementById('btn-batch-select-all');
    if (btnSelectAll) {
        btnSelectAll.addEventListener('click', () => {
            const termId = document.getElementById('batch-print-term-select')?.value;
            const term = appData.terms.find(t => t.id === termId);
            if (term) {
                term.subjects.forEach(s => batchPrintSelectedSubIds.add(s.id));
                updateBatchPrintCheckboxUI();
            }
        });
    }

    const btnDeselectAll = document.getElementById('btn-batch-deselect-all');
    if (btnDeselectAll) {
        btnDeselectAll.addEventListener('click', () => {
            batchPrintSelectedSubIds.clear();
            updateBatchPrintCheckboxUI();
        });
    }

    const chkSummary = document.getElementById('batch-print-check-summary');
    if (chkSummary) {
        chkSummary.addEventListener('change', updateBatchPrintTotalsBadge);
    }

    const chkP1 = document.getElementById('batch-print-page1-all');
    if (chkP1) {
        chkP1.addEventListener('change', updateBatchPrintTotalsBadge);
    }

    const chkP2 = document.getElementById('batch-print-page2-all');
    if (chkP2) {
        chkP2.addEventListener('change', updateBatchPrintTotalsBadge);
    }

    const btnExecute = document.getElementById('btn-batch-print-execute');
    if (btnExecute) {
        btnExecute.addEventListener('click', executeBatchPrint);
    }
}

function openBatchPrintModal() {
    const termSelect = document.getElementById('batch-print-term-select');
    if (!termSelect) return;

    if (!appData.terms || appData.terms.length === 0) {
        alert('ยังไม่มีภาคเรียนในระบบ กรุณาเพิ่มภาคเรียนก่อน');
        return;
    }

    termSelect.innerHTML = '';
    appData.terms.forEach(term => {
        const opt = document.createElement('option');
        opt.value = term.id;
        opt.textContent = `ภาคเรียนที่ ${term.no}/${term.year}`;
        termSelect.appendChild(opt);
    });

    const targetTermId = currentTermId || appData.terms[0].id;
    termSelect.value = targetTermId;

    renderBatchPrintOptions(targetTermId);
    openModal('modal-batch-print');
}

function renderBatchPrintOptions(termId) {
    const term = appData.terms.find(t => t.id === termId);
    const container = document.getElementById('batch-subjects-list');
    const subCountEl = document.getElementById('batch-term-sub-count');
    const moneyBadge = document.getElementById('batch-term-money-badge');

    if (!term || !container) return;

    // Ensure all subjects have claimData initialized
    term.subjects.forEach(sub => ensureSubjectClaimData(term, sub));

    container.innerHTML = '';
    // By default, select all subjects in this term
    batchPrintSelectedSubIds = new Set(term.subjects.map(s => s.id));

    let totalTermMoney = 0;
    term.subjects.forEach(sub => {
        const info = getSubjectClaimSummary(sub, term);
        totalTermMoney += info.totalMoney;
    });

    if (subCountEl) subCountEl.textContent = term.subjects.length;
    if (moneyBadge) moneyBadge.textContent = `${formatMoney(totalTermMoney)} บาท`;

    if (term.subjects.length === 0) {
        container.innerHTML = `
            <div class="p-4 text-center text-xs text-gray-500 bg-[#0f121d] rounded-lg border border-[#2d3748]">
                <i class="fa-solid fa-circle-exclamation text-amber-400 mb-1 block text-base"></i>
                ยังไม่มีรายวิชาในภาคเรียนนี้
            </div>
        `;
        updateBatchPrintTotalsBadge();
        return;
    }

    term.subjects.forEach(sub => {
        const info = getSubjectClaimSummary(sub, term);
        const card = document.createElement('label');
        card.id = `batch-sub-card-${sub.id}`;
        card.className = `p-3 rounded-xl border text-xs flex items-center justify-between gap-3 cursor-pointer transition bg-blue-950/20 border-blue-500/50 text-white`;
        card.innerHTML = `
            <div class="flex items-center gap-3 overflow-hidden flex-1">
                <input type="checkbox" class="batch-chk-subject w-4 h-4 rounded text-blue-500 focus:ring-blue-400 border-gray-600 bg-gray-700 cursor-pointer flex-shrink-0" data-sub-id="${sub.id}" checked>
                <div class="overflow-hidden flex-1">
                    <div class="font-bold text-white text-xs truncate">
                        ${info.name}
                        <span class="text-gray-400 font-normal ml-1">(${info.code || '-'})</span>
                    </div>
                    <div class="text-[11px] text-gray-400 mt-0.5 flex flex-wrap items-center gap-2">
                        <span><i class="fa-solid fa-user-tie text-[10px] text-blue-400 mr-1"></i>${info.teacherName}</span>
                        <span>•</span>
                        <span>${info.hours} ชม.</span>
                        <span>•</span>
                        <span>${info.students} คน</span>
                    </div>
                </div>
            </div>
            <div class="text-right flex-shrink-0">
                <span class="font-mono text-emerald-400 font-bold text-xs">${formatMoney(info.totalMoney)} บ.</span>
                <span class="block text-[10px] text-gray-400">อัตรา ${info.rate} บ./ชม.</span>
            </div>
        `;

        const chk = card.querySelector('.batch-chk-subject');
        chk.addEventListener('change', () => {
            if (chk.checked) {
                batchPrintSelectedSubIds.add(sub.id);
                card.className = `p-3 rounded-xl border text-xs flex items-center justify-between gap-3 cursor-pointer transition bg-blue-950/20 border-blue-500/50 text-white`;
            } else {
                batchPrintSelectedSubIds.delete(sub.id);
                card.className = `p-3 rounded-xl border text-xs flex items-center justify-between gap-3 cursor-pointer transition bg-[#0f121d] border-[#2d3748] text-gray-400 hover:border-gray-500`;
            }
            updateBatchPrintTotalsBadge();
        });

        container.appendChild(card);
    });

    updateBatchPrintTotalsBadge();
}

function updateBatchPrintCheckboxUI() {
    document.querySelectorAll('.batch-chk-subject').forEach(chk => {
        const subId = chk.getAttribute('data-sub-id');
        const isChecked = batchPrintSelectedSubIds.has(subId);
        chk.checked = isChecked;
        const card = document.getElementById(`batch-sub-card-${subId}`);
        if (card) {
            if (isChecked) {
                card.className = `p-3 rounded-xl border text-xs flex items-center justify-between gap-3 cursor-pointer transition bg-blue-950/20 border-blue-500/50 text-white`;
            } else {
                card.className = `p-3 rounded-xl border text-xs flex items-center justify-between gap-3 cursor-pointer transition bg-[#0f121d] border-[#2d3748] text-gray-400 hover:border-gray-500`;
            }
        }
    });
    updateBatchPrintTotalsBadge();
}

function updateBatchPrintTotalsBadge() {
    const isSummary = document.getElementById('batch-print-check-summary')?.checked || false;
    const isP1 = document.getElementById('batch-print-page1-all')?.checked || false;
    const isP2 = document.getElementById('batch-print-page2-all')?.checked || false;

    const termSelect = document.getElementById('batch-print-term-select');
    const term = termSelect ? appData.terms.find(t => t.id === termSelect.value) : null;

    if (term) {
        const effectiveDates = getTermEffectiveDateRange(term, Array.from(batchPrintSelectedSubIds));
        const dateTextEl = document.getElementById('batch-summary-dates-text');
        if (dateTextEl) {
            dateTextEl.textContent = `ช่วงวันที่เบิก: ${effectiveDates.startDateStr} ถึง ${effectiveDates.endDateStr}`;
        }
    }

    const subCount = batchPrintSelectedSubIds.size;
    const pagesPerSub = (isP1 ? 1 : 0) + (isP2 ? 1 : 0);
    const subPages = subCount * pagesPerSub;
    const summaryPages = isSummary ? 1 : 0;
    const totalPages = summaryPages + subPages;

    const badgeText = document.getElementById('batch-print-total-pages-text');
    if (badgeText) {
        if (totalPages === 0) {
            badgeText.textContent = '0 หน้า (ยังไม่ได้เลือกรายการ)';
        } else {
            let details = [];
            if (isSummary) details.push('ใบเบิกรวม 1 แผ่น');
            if (subCount > 0 && pagesPerSub > 0) details.push(`${subCount} รายวิชา (${subPages} แผ่น)`);
            badgeText.textContent = `รวมทั้งหมด ${totalPages} หน้า A4 (${details.join(' + ')})`;
        }
    }
}

function executeBatchPrint() {
    const termSelect = document.getElementById('batch-print-term-select');
    if (!termSelect) return;
    const termId = termSelect.value;
    const term = appData.terms.find(t => t.id === termId);
    if (!term) return alert('ไม่พบข้อมูลภาคเรียนที่เลือก');

    const printSummary = document.getElementById('batch-print-check-summary')?.checked || false;
    const printPage1 = document.getElementById('batch-print-page1-all')?.checked || false;
    const printPage2 = document.getElementById('batch-print-page2-all')?.checked || false;

    const selectedSubIds = Array.from(batchPrintSelectedSubIds);

    if (!printSummary && selectedSubIds.length === 0) {
        alert('กรุณาติ๊กเลือกอย่างน้อย 1 รายการ (ใบเบิกรวม หรือรายวิชา) เพื่อพิมพ์');
        return;
    }

    if (selectedSubIds.length > 0 && !printPage1 && !printPage2 && !printSummary) {
        alert('กรุณาเลือกหน้าที่ต้องการพิมพ์ (หน้า 1 หรือ หน้า 2)');
        return;
    }

    const batchContainer = document.getElementById('batch-print-container');
    if (!batchContainer) return;
    batchContainer.innerHTML = '';

    // 1. If Summary Claim is selected, append Summary Claim A4 paper
    if (printSummary) {
        const summaryPaper = document.createElement('div');
        summaryPaper.className = 'a4-paper summary-claim-paper';
        summaryPaper.innerHTML = generateSummaryClaimA4HTML(term, selectedSubIds.length > 0 ? selectedSubIds : null);
        batchContainer.appendChild(summaryPaper);
        fitSummaryClaimTableFonts(summaryPaper);
    }

    // 2. For each selected subject, append Page 1 and/or Page 2
    selectedSubIds.forEach(subId => {
        const sub = term.subjects.find(s => s.id === subId);
        if (!sub) return;
        const claim = ensureSubjectClaimData(term, sub);

        if (printPage1) {
            const p1 = document.createElement('div');
            p1.className = 'a4-paper doc-page-1';
            p1.style.fontSize = '14pt';
            p1.innerHTML = generateA4Page1HTML(claim);
            // font fit
            const totalLineEl = p1.querySelector('#p1-calc-total-line');
            if (totalLineEl) {
                let currentPt = 14;
                while (totalLineEl.scrollWidth > totalLineEl.clientWidth && currentPt > 8.5) {
                    currentPt -= 0.5;
                    totalLineEl.style.fontSize = currentPt + 'pt';
                }
            }
            batchContainer.appendChild(p1);
        }

        if (printPage2) {
            const p2 = document.createElement('div');
            p2.className = 'a4-paper doc-page-2';
            p2.style.fontSize = '14pt';
            p2.innerHTML = generateA4Page2HTML(claim);
            batchContainer.appendChild(p2);
        }
    });

    // 3. Trigger Print
    document.body.classList.add('printing-batch');

    setTimeout(() => {
        window.print();
    }, 150);

    const cleanup = () => {
        document.body.classList.remove('printing-batch');
        if (batchContainer) batchContainer.innerHTML = '';
        window.removeEventListener('afterprint', cleanup);
    };

    window.addEventListener('afterprint', cleanup);
    setTimeout(cleanup, 2500);
}

// -------------------------------------------------------------------------
// CLOUDFLARE PAGES REAL-TIME CLOUD SYNC ENGINE
// -------------------------------------------------------------------------
let cloudSyncStatus = 'offline'; // 'ready', 'syncing', 'setup_required', 'error', 'offline'
let cloudSyncDebounceTimer = null;

async function initCloudSync() {
    const btnSync = document.getElementById('btn-cloud-sync');
    const btnSyncNow = document.getElementById('btn-cloud-sync-now');
    const btnPull = document.getElementById('btn-cloud-pull-force');
    const btnPush = document.getElementById('btn-cloud-push-force');

    if (btnSync) {
        btnSync.onclick = () => {
            openModal('modal-cloud-sync');
        };
    }

    if (btnSyncNow) {
        btnSyncNow.onclick = async () => {
            await doCloudSync(true);
        };
    }

    if (btnPull) {
        btnPull.onclick = async () => {
            if (confirm('คุณต้องการดึงข้อมูลล่าสุดจาก Cloudflare มาทับข้อมูลในเครื่องนี้ใช่หรือไม่?')) {
                await doCloudPull();
            }
        };
    }

    if (btnPush) {
        btnPush.onclick = async () => {
            if (confirm('คุณต้องการส่งข้อมูลในเครื่องนี้ขึ้นไปแทนที่บน Cloudflare ใช่หรือไม่?')) {
                await doCloudPush(true);
            }
        };
    }

    // Check if running on Web (http / https)
    const isWeb = window.location.protocol.startsWith('http');
    if (!isWeb) {
        updateCloudSyncUI('offline', 'ในเครื่อง (Local)');
        return;
    }

    // Initial check and fetch on login/load
    await doCloudSync(false);
}

function updateCloudSyncUI(status, label, updatedAt) {
    cloudSyncStatus = status;
    const dot = document.getElementById('cloud-sync-dot');
    const text = document.getElementById('cloud-sync-text');
    const badge = document.getElementById('cloud-status-badge');
    const lastSyncText = document.getElementById('cloud-last-sync-text');

    if (dot && text) {
        if (status === 'ready') {
            dot.className = 'w-2.5 h-2.5 rounded-full bg-emerald-400';
            text.textContent = label || 'คลาวด์ซิงค์';
        } else if (status === 'syncing') {
            dot.className = 'w-2.5 h-2.5 rounded-full bg-amber-400 animate-ping';
            text.textContent = 'กำลังซิงค์...';
        } else if (status === 'setup_required') {
            dot.className = 'w-2.5 h-2.5 rounded-full bg-amber-400';
            text.textContent = 'รอผูก KV';
        } else if (status === 'error') {
            dot.className = 'w-2.5 h-2.5 rounded-full bg-red-400';
            text.textContent = 'ซิงค์ไม่สำเร็จ';
        } else {
            dot.className = 'w-2.5 h-2.5 rounded-full bg-gray-400';
            text.textContent = 'ในเครื่อง';
        }
    }

    if (badge) {
        if (status === 'ready') {
            badge.className = 'px-2.5 py-1 rounded-full text-xs font-medium bg-emerald-500/20 text-emerald-400 flex items-center gap-1.5';
            badge.innerHTML = '<span class="w-2 h-2 rounded-full bg-emerald-400"></span> เชื่อมต่อคลาวด์แล้ว';
        } else if (status === 'setup_required') {
            badge.className = 'px-2.5 py-1 rounded-full text-xs font-medium bg-amber-500/20 text-amber-300 flex items-center gap-1.5';
            badge.innerHTML = '<span class="w-2 h-2 rounded-full bg-amber-400"></span> รอผูก KV Namespace';
        } else if (status === 'error') {
            badge.className = 'px-2.5 py-1 rounded-full text-xs font-medium bg-red-500/20 text-red-400 flex items-center gap-1.5';
            badge.innerHTML = '<span class="w-2 h-2 rounded-full bg-red-400"></span> เกิดข้อผิดพลาด';
        } else {
            badge.className = 'px-2.5 py-1 rounded-full text-xs font-medium bg-gray-500/20 text-gray-400 flex items-center gap-1.5';
            badge.innerHTML = '<span class="w-2 h-2 rounded-full bg-gray-400"></span> โหมดในเครื่อง (ออฟไลน์)';
        }
    }

    if (lastSyncText && updatedAt) {
        const d = new Date(updatedAt);
        if (!isNaN(d.getTime())) {
            lastSyncText.textContent = d.toLocaleTimeString('th-TH', { hour: '2-digit', minute: '2-digit', second: '2-digit' }) + ' (' + d.toLocaleDateString('th-TH') + ')';
        } else {
            lastSyncText.textContent = updatedAt;
        }
    }
}

async function doCloudSync(isManual = false) {
    if (!window.location.protocol.startsWith('http')) return;
    try {
        const u = currentUser ? currentUser.username : 'civilutc';
        updateCloudSyncUI('syncing');
        const res = await fetch(`/api/sync?user=${encodeURIComponent(u)}`);
        if (!res.ok) {
            updateCloudSyncUI('error', 'ซิงค์ผิดพลาด');
            return;
        }
        const json = await res.json();
        if (json.setupRequired) {
            updateCloudSyncUI('setup_required', 'รอผูก KV');
            return;
        }

        if (json.success) {
            if (json.data && (json.data.terms || json.data.teachers)) {
                const cloudTime = json.updatedAt ? new Date(json.updatedAt).getTime() : 0;
                const localTime = appData && appData.lastModified ? new Date(appData.lastModified).getTime() : 0;

                if (cloudTime > localTime) {
                    appData = json.data;
                    const key = getUserStorageKey(u);
                    localStorage.setItem(key, JSON.stringify(appData));
                    if (u === 'civilutc') {
                        localStorage.setItem('teachingFeeData', JSON.stringify(appData));
                    }
                    if (currentView === 'semesters') renderSemestersView();
                    if (typeof renderAnnualDaysChart === 'function') renderAnnualDaysChart();
                } else if (localTime > cloudTime || !json.data) {
                    await doCloudPush(false);
                }
            } else if (!json.data && appData && ((appData.terms && appData.terms.length > 0) || (appData.teachers && appData.teachers.length > 0))) {
                await doCloudPush(false);
            }

            const timeStr = json.updatedAt || new Date().toISOString();
            updateCloudSyncUI('ready', 'คลาวด์ซิงค์', timeStr);
            if (isManual) alert('ซิงค์ข้อมูลกับคลาวด์เรียบร้อยแล้ว!');
        }
    } catch (err) {
        console.warn('Cloud sync error:', err);
        updateCloudSyncUI('error', 'ซิงค์ไม่สำเร็จ');
    }
}

async function doCloudPush(showAlert = true) {
    if (!window.location.protocol.startsWith('http')) return;
    try {
        const u = currentUser ? currentUser.username : 'civilutc';
        updateCloudSyncUI('syncing');
        const now = new Date().toISOString();
        if (appData) {
            appData.lastModified = now;
            const key = getUserStorageKey(u);
            localStorage.setItem(key, JSON.stringify(appData));
            if (u === 'civilutc') {
                localStorage.setItem('teachingFeeData', JSON.stringify(appData));
            }
        }

        const res = await fetch('/api/sync', {
            method: 'POST',
            headers: { 'Content-Type': 'application/json' },
            body: JSON.stringify({ user: u, data: appData, updatedAt: now })
        });
        const json = await res.json();
        if (json.success) {
            updateCloudSyncUI('ready', 'คลาวด์ซิงค์', now);
            if (showAlert) alert('ส่งข้อมูลขึ้น Cloudflare KV เรียบร้อยแล้ว!');
        } else {
            updateCloudSyncUI('error');
            if (showAlert) alert('ส่งข้อมูลไม่สำเร็จ: ' + (json.message || json.error));
        }
    } catch (e) {
        updateCloudSyncUI('error');
        if (showAlert) alert('เชื่อมต่อคลาวด์ไม่สำเร็จ: ' + e.message);
    }
}

async function doCloudPull() {
    if (!window.location.protocol.startsWith('http')) return;
    try {
        const u = currentUser ? currentUser.username : 'civilutc';
        updateCloudSyncUI('syncing');
        const res = await fetch(`/api/sync?user=${encodeURIComponent(u)}`);
        const json = await res.json();
        if (json.success && json.data) {
            appData = json.data;
            const key = getUserStorageKey(u);
            localStorage.setItem(key, JSON.stringify(appData));
            if (u === 'civilutc') {
                localStorage.setItem('teachingFeeData', JSON.stringify(appData));
            }
            if (currentView === 'semesters') renderSemestersView();
            renderAnnualChart();
            updateCloudSyncUI('ready', 'คลาวด์ซิงค์', json.updatedAt || new Date().toISOString());
            alert('ดึงข้อมูลล่าสุดจาก Cloudflare เรียบร้อยแล้ว!');
        } else {
            alert('ไม่พบข้อมูลบนคลาวด์ หรือยังไม่ได้ผูก KV');
            updateCloudSyncUI('setup_required');
        }
    } catch (e) {
        alert('ดึงข้อมูลไม่สำเร็จ: ' + e.message);
        updateCloudSyncUI('error');
    }
}

function triggerAutoCloudSync() {
    if (!window.location.protocol.startsWith('http')) return;
    if (!currentUser) return;
    if (cloudSyncDebounceTimer) clearTimeout(cloudSyncDebounceTimer);
    cloudSyncDebounceTimer = setTimeout(() => {
        doCloudPush(false);
    }, 2500);
}
